[
  {
    "title": "Faculty Panel Guides Students Through Israeli-Palestinian Conflict",
    "author": "Eli Berk & Emilia Raviola '26 News Editors",
    "text": "DEIJ, in collaboration with the Public Issues Board, organized \"An Overview of the Ongoing Crisis in the Middle East\" for boarders on October 9 and for day students the following day. The panel consisted of History Department Chair Joshua Emmott, History Teacher Dr. Perin Gokce, and English Teacher Dr. David Nurenberg. \"We started talking about this last spring,\" explained Emmott. \"[We] basically talked to teachers and parents to solicit what kind of program they would like.\" The same three panelists held a similar Straus Dessert last fall. \"The conflict has been going on for a year... We're here just to provide a bigger context... [about] what happened and how to understand what's happening\" added Emmott. Since all students were required to attend the panel, according to Callum Hegarty '25, a member of the Public Issues Board and one of the moderators last Wednesday, organizers grappled with the question of \"do we try to tend to the people who are very interested and would have gone if it wasn't required, or should we try to make sure the people who wouldn't have been there anyway would still get a lot out of it?\" Overall, he said, the goal was to \"give a lot of people a general understanding, even if that meant we couldn't go as far in-depth.\" Gokce acknowledged that \"if students don't have any connection to the region, [the conflict] is something they might hear a lot about but not really know about.\" Therefore, she said, it was \"important to make students curious about the topic so they'll go read about it, or ask their knowledgeable friends and family.\" She praised student questions, stating that \"there's a lot of nervousness about how to phrase a question, or use the proper vocabulary. Given that, I thought the questions were very insightful.\" Upper School Principal Rachel Stone, in her speech on October 7, who asked the Measure to clarify that her statement does not represent any official stance of the school, said that the events and speakers throughout the fall were \"intended to foster a shared foundation of facts and understanding, to create opportunities for healthy conversation and debate, and ultimately to help all of us understand the ongoing unrest in the world.\" Stone also emphasized that there were \"times woven throughout with opt-in spaces for us to reflect, process, discuss, or simply take a break if we are feeling overwhelmed.\" The panels during the week of October were \"part of a larger arc of programming\" this year, explained Director of Equity and Inclusion Dr. Melissa Lawlor. Lawlor hopes this programming will teach students how \"to stay in a conversation when it gets hard but it needs to happen.\" Stone told students to \"remember that friends can have different opinions and that Lizzy Carroll, a previous guest speaker from Facing History and Ourselves who spoke about civil discourse, \"reminded us last Tuesday to 'call in' rather than 'call out' during critical conversations.\" Nurenberg expressed a similar sentiment, stating that the programming is \"part... of the school's larger mission this year of helping students develop skills in navigating conversations around issues... like this, like the [US presidential] election... where different people have very different views.\" Lawlor added that \"students were feeling frustrated last year about... a lack of mandatory programming around the Middle East that would help students... get a better foundation of what is actually happening, because it's impacting kids very personally on a number of levels.\" Additionally, \"people didn't know how to talk to each other about it.\" Nurenberg, acknowledging that \"the limited time slot and giant crowd in the ACC... aren't ideal for student learning, especially for such a complex topic,\" nevertheless concluded that he's \"pleased that Milton is taking this on, no matter how imperfectly.\" Emmott explained that this programming will continue on October 22 with a two-speaker panel moderated by Harvard Business School Professor Deepak Malhotra P '26 '27. \"If we didn't have this panel of faculty [Emmott, Gokce, and Nurenberg to lay the foundation going into that next panel, [it] might [be set up] in the wrong way,\" said Lawlor. Emmott explained that \"the three of us [Emmott, Gokce, and Nurenberg]... [gave context [for] for] the following week.\" On the panel will be author and politician Gaith al-Omari, a former member of the Palestinian Authority, and US-based Middle Eastern diplomat Ambassador Dennis Ross. Lawlor added, \"what might be hard to dispel is this notion of kind of a binary conflict where it's one party versus another. Hopefully the [faculty] panel [dispelled] that.\" With last year's new policy that, according to an email sent out to the school in June, \"Milton's Board of Trustees, in partnership with the school's Leadership Team... [will not] issue institutional responses to external events in the future,\" some saw the panels this year as part of a new approach to current events and global issues. \"This time last year there were a lot of people who wanted Milton Academy to say, 'we stand with Israel' or 'we stand with the Palestinians\" said Emmott. \"In terms of taking a stance, we're not. But what we want is for our community to be informed.\" Lawlor feels the new policy is \"really helpful because we don't have to spend all our resources crafting the most perfect statement-we can actually care for kids where they need to be cared for... that's what we're supposed to be doing.\" \"I think that Milton's new policy is generally a good thing,\" said HT Xue '26. \"The school has... a responsibility to educate us on all these issues, and I love that they are doing that this year. I think to take it one step further, it falls upon the students to use this knowledge to express their voices.\" According to Nurenberg, the importance of this panel extended beyond simply informing students about a single current event. \"Even if students remember none of the specific facts,\" he said, \"I would want them to at least walk away with an appreciation for the idea that... one's whole understanding of a situation can be dramatically different depending on what narratives or stories you have about it.\" He concluded that \"conflicting stories about the same situation can both be valid. That's not a way we're used to thinking.\""
  },
  {
    "title": "\"The \"Zad\" Marks Culmination of Nine Year Plan",
    "author": "Adair Johnson '27 News Writer",
    "text": "This fall, students began classes in the newly renovated Farokhzad Math Center (FMC), a building described by the school website as having \"greater usefulness [than] outdated buildings as we meet the needs of modern teaching and learning.\" The previous math setup at the top of Ware Hall contained 11 classrooms for 19 math teachers, a setup the website called \"cramped.\" With the creation of the new math building, the school hopes for \"interdisciplinary collaboration and innovation in robotics, computing, and math curriculum,\" the website explained. Administration has been planning this vision for a while: Math Department Chair Rebecca McCormick cited the \"2015 strategic plan\" as the foundation of the project that led to the construction of the FMC, now commonly nicknamed the 'Zad. The building \"just felt like it was never going to get here,\" she remembers. \"2024 felt like so far away.\" Indeed, \"the math building is the last major project in the school's master plan,\" according to Chief Financial and Operating Officer Heidi Vanderbilt-Brown, who supervised every step of the math center's creation. The master plan in question aimed to \"support the school's strategy through \"campus-related improvements,\" some of which included the Cox Library relocation, renovations of Wigglesworth, Ware Hall, the Student Center, and the entirely new Berylson Turf Field. Vanderbilt-Brown stated that \"a major [priority of the master plan] was math,\" specifically an \"increase [in] the number of math classrooms\" and learning-oriented physical structure. The planning \"was all rooted in research and input from the math department about how students learn math.\" Throughout the FMC's development, design, and construction process, Vanderbilt-Brown and her \"team...have worked with campus planners, architects, engineers, and project managers\" and consulted varying departments to carefully realize the building. McCormick \"[enjoys] the advantages of the math teachers'] having their own classrooms\" but also expressed missing \"more organic running into colleagues and being able to have those conversations\" which resulted from Ware's shared classrooms. She highlights the importance of maintaining those relationships along with \"continually... monitoring...and discussing [usage of space]\" in the 'Zad. The building has recently seen the final touches, mainly furniture, to the building's two faculty spaces. A recent Milton Paper poll asked students for their opinions on a possible FMC nickname: the \"Zad, the Rok, the Ferrari, or simply the FMC. With a majority of 57.7%, the 'Zad, a play off of the Farokhzad donor name, came in first, with the FMC at 22.3% second place. McCormick \"feels [that] it's really important that we use [the donors'] name\" while referring to the building, so feels \"a little bit mixed\" on the nickname. She stated, \"I almost would wonder how [the Farokhzad family] would feel about it being called the 'Zad,\" but \"even when we call it FMC, that's a shortened version of it.\" The multimillion-dollar gift of the donors, Shadi and Omid Farokhzad P '23 '25 contributed vastly to the FMC's creation. The family explained that they \"chose to make a gift in support of a state-of-the-art mathematics building to provide students with the best possible opportunity to develop their problem-solving skills and curiosity. They] are so happy to help to create innovative environments where young people can grow and develop skills and confidence as they learn.\" The pair stated, \"It is our hope that our gift will inspire others to join us in supporting this effort,\" and have challenged the community to an ongoing donation for the math center lasting until December 31, 2024, according to the school website. However, some will miss the old Cox Library, which had more floors and study space. According to the Society of Architectural Historians, during a high period of construction at Milton, the school built the old Cox Library in 1971 after the town closed the Gun Hill Street extension, \"which had cut diagonally across the southern campus from Randolph to Centre Streets.\" Maddie Dorcena '27 thinks \"the math center is cool\" but \"would like a bigger library.\" Even though \"the new library is nice,\" she feels that it's \"too small.\" Nonetheless, Dorcena also believes that \"having math classrooms all over campus [was] annoying.\""
  },
  {
    "title": "Seniors Share Opinions on Ballot Questions in Massachusetts",
    "author": "Teresa Li '26 News Writer",
    "text": "This year, many local elections will coincide with the presidential election. In particular, there will be five questions on the ballot for Massachusetts voters. Topics in question are an auditor's oversight of the legislature, eliminating the MCAS graduation requirement, allowing unions for rideshare drivers, legalizing psychedelic drugs, and altering the minimum wage for tipped workers. Overall, 10 out of 13 seniors interviewed were not aware of what the ballot questions are; however, some who were informed on the topic focused mainly on the second, third, and fifth question. As Max Donovan '25, head of Public Issues Board, explained, if the first question on auditor oversight is passed, \"the actions of the legislature would be surveilled and scrutinized as a way to prevent the state government from breaking tax laws [and other issues].\" The second question centers on whether or not MCAS (a standardized test in Massachusetts) should be part of the graduation requirement for high school. Ashley Clarkson '25 believes that the MCAS \"shouldn't be required because there could be people who have good grades but may not be good test takers. So, if they do badly on [the test], they would be held back, which isn't fair.\" Eliana Soiffer '25 disagreed, saying that removing MCAS as a bargaining means that drivers across multiple graduation requirement \"is a bad idea because it is the only standardized thing at all required for getting a high school diploma and it's really quite reasonable to get a passing score.\" The third question discusses issues on allowing rideshare drivers to form unions; Donovan clarified that \"this is called sector-based bargaining, and it's unlikely to succeed in a first attempt even if voters pass this question.\" Specifically, according to the Tufts Center for State Policy Analysis, sector-based bargaining means that drivers across multiple different companies could negotiate together for benefits and protections. Clarkson supports the question by stating that \"a lot of the time, people do that (ride-share apps) as a job, [so they] should be able to advocate for things like] medical benefits.\" However, Donovan expressed that \"question three is a long shot, even if it's passed, since if Uber and Lyft drivers are able to form a union of sorts, it would take many years and many court battles to pass it into law.\" Next, the fourth question draws on issues regarding psychedelic drugs, which as Donovan expresses, \"for some medical conditions...[could] really help patients.\" The fifth and last question is based on whether tipped workers should earn the minimum wage, which is $15 dollars an hour in Massachusetts. Speaking to this issue, Donovan stated that \"currently in MA, workers in certain industries (such as restaurants), are only paid $6.75 an hour...because these workers receive lots of money in tips that covers the rest of their salary.\" Donovan continued, claiming that, \"there are concerns that an increase in worker salaries will trigger higher prices at restaurants and put servers tips into jeopardy.\" For example, David Lee '25 feels strongest about the fifth question on minimum wage for tipped workers, believing that \"with the inconsistent nature of tipping culture, it is crucial that tipped workers receive minimum wage.\" Similarly, Clarkson thinks tipped workers should be paid minimum wage due to irregular tipping, but she raised a concern that \"it could be unfair to for example retail workers who are also making minimum wage but don't get tipped.\" As Donovan noted, \"this question could impact any students at Milton that work in the restaurant or tipped worker industries.\" Donovan concluded that some other local elections to look forward to include \"MA Senator Elizabeth Warren... running for re-election\" and the election of the nine representatives to the House."
  },
  {
    "title": "Redefining Dialogue From \"Difficult\" to \"Necessary\"",
    "author": "Editorial Board",
    "text": "An education at a prestigious institution like Milton grants us immense privilege. With access to unparalleled resources, experienced and passionate teachers, and, most importantly, a diverse campus community, we each have the opportunity to become students, thinkers, and people who are more likely to take risks. We pride ourselves on inclusivity; we claim to be a school that encourages \"difficult discussions\" as a part of our core curriculum. Whether concerning politics, current events, or personal morals, Milton wants us to contribute to an open-minded environment one where listening leads to personal growth and collaboration fosters collective action. The responsibility for engaging in that dialogue falls to the students, and yet the students often fall short. Recent assemblies and campus conversations have made it clear that the DEIJ office champions such dialogue. But do their methods produce their desired results? On 10/1, Lizzy Carroll, New England Program Director of Facing History and Ourselves, spoke about Loretta J. Ross' 2021 Ted Talk, \"Don't call people out -- call them in.\" The talk frames calling out as an alternative to cancel culture. When someone makes a mistake one that seriously hurts someone - we should bring that to their attention in a way that creates productive dialogue. Instead of attacking them, we should, as Carroll said, ask them to explain their opinion. This method holds true when someone says something genuinely horrible you cannot hold productive conversation with someone spewing hate. That form of dialogue, however, is not well-suited to the dialogue we want to create on campus around October 7th. \"Calling in\" sets the stage for a sermon, not a conversation. It is a lecture, not an invitation for discussion. Calling in implies that the \"caller\" is in the right, and the one being \"called\" is in the wrong. The \"called,\" then, needs to change their views because the alternative to this discussion is being \"canceled.\" This method of discussion is not open, as there is no option for the \"caller\" to change their mind. On October 9th and 10th, our Public Issues Board hosted hour-long Faculty Panels on the war between Israel and Palestine. Before a brief Q&A session with their student audience, Dr. Nurenberg, Dr. Gokce, and Mr. Emmott presented timelines and statistics to inform us of the war. While acknowledging their unfortunate time constraints, the panel seemed to accomplish its goals of summary. Students appeared engaged. But in the context of the prior assembly, did it set us up for productive discussion? We say no. No, because the framework of \"calling in\" is incompatible with discussions about Israel and Palestine. Regardless of the language by which we call \"in\" or \"out,\" the structure assumes that someone is in the right and someone is in the wrong. The issue is convoluted, intricate, and personal to many of us. On a topic where Milton students are so divided, conversation is essential there is no right or wrong, no \"calling out\" or \"calling in.\" Thus, for now, we must set aside our predisposition to assume our opinions reign over others. To better foster these \"difficult\" conversations, our community first needs to redefine them. The apparent difficulty of such topics causes students to shy away from discussion, afraid to be \"called out.\" As learners, we shouldn't just have these conversations when we are instructed to only when they are \"difficult,\" or when someone says something offensive - we should have them because we want to. If we are open to simply listening, not correcting, these conversations wouldn't be so \"difficult.\""
  },
  {
    "title": "Faculty Spotlight: Yann Kumin Builds Inclusive Spaces",
    "author": "Margot Murphy-Hara '28 News Writer",
    "text": "Yann Kumin is a former English teacher and football coach, a cancer survivor, and a rapper who has performed with Wu Tang Clan. He identifies all of these past experiences as formative in his journey to his current role of Upper/Middle School Equity & Inclusion Program Manager. Since last year, when his title was DEIJ Community Coordinator, Kumin's work with DEIJ (Diversity, Equity, Inclusion and Justice) has expanded out of the high school and into the middle school. Director of Equity and Inclusion Dr. Melissa Lawlor identifies what she calls \"operational\" and \"student-oriented\" components to his current role. The operational component consists of planning and organizing programming for Upper and Middle School students, including speakers, culture fests, as well as some curricular review. The student-oriented side, according to Kumin, involves working to make students \"feel seen, heard, treated equitably, [and] have their identities and experiences represented in the community.\" Kumin's experiences as a student, teacher, and coach directly inform his work with the DEIJ team. As a student of color and gay man in an independent school in the late 90s, he has experienced first-hand the impact that exclusion can have on mental health and one's sense of self programming for a school of He described his successful cancer fight in 2019 and its effect on his \"conceptions of the authentic\" as the final impetus for him to engage in equity and inclusion work full time, in order \"to create equitable [and just spaces within education.\" Kumin explained that his passion for his job stems largely from the young people with whom he works. He is deeply interested in the ideas that students have for building a less divisive and exclusive society. He stated: \"I get to see young people every day who are looking at their world and instead of bemoaning it, are saying, 'How can I make it better? How can I make this world more equitable?\" Furthermore, he appreciates students' ability to connect across and have meaningful discussions about their differences. Despite the joy that comes with his job, Kumin added that it is not without its challenges. Developing Milton's size and diversity requires careful planning. Kumin explained, \"it's not easy to create programming that is going to resonate equally with 750 adolescents from the ages of 14 to 18, from over 25 countries and over 20 states.\" Time, or a lack thereof, can pose another challenge. Faculty and staff have busy schedules, and even after an event has successfully been scheduled and taken place, the DEIJ team must also find necessary time for processing and next-step discussions. Kumin explained his concrete goals for his work. First, he seeks to cultivate a strong relationship between the middle and upper schools, creating opportunities for collaboration and partnerships between students across divisions. Second, he wants to continue to develop programming that follows what he calls \"a curricular arc\" that will give students a progressive understanding of principles of social justice and equity. Finally, he plans to create programming that builds community and encourages nuanced discourse amongst the student body, teaching students of all ages how to have difficult conversations through their differences. Above all, Kumin wants students to know that \"the door is always open for conversation in [the DEIJ] office.\" Seeking to create empathy, widen views, and ensure that all students feel included, Kumin sees his role as a crucial response to inequity, exclusion, and injustice in American society. He assured students, \"if you got in here, if you found your way here, you belong here. You deserve to be here, and you deserve full, total access to this place, to its experiences, and to the education it provides you.\" Further, Lawlor highlighted the importance of Kumin's role at the particular developmental stage of high school, when students often explore their identities in new and more complex ways. She argued, \"the earlier you start, the better connected you feel to yourself.\""
  },
  {
    "title": "Civil Discourse Programming Met with Mixed Engagement",
    "author": "Darby Yang '27 News Writer",
    "text": "On October 1, the Upper School student body gathered on the bleachers in the ACC to welcome Milton alum Lizzy Carroll '98, the New England Program Director of Facing History and Ourselves, and her presentation on civil discourse and difficult conversations. Carroll returned to her alma mater to speak to current students on behalf of Facing History and Ourselves, an organization dedicated to using historical elements to teach students about combating hate and bigotry. Melissa Lawlor, Director of Equity and Inclusion, explained, \"If you look at the arc of all the Upper School Programming, [that day] actually was inspired by the way we ended last year. There was a lot of feedback that was like, 'I don't know how to talk about the conflict in the Middle East with my friends.'\" She continues, \"People felt silenced because they didn't know what to say. As a result, says Lawlor, DEIJ wanted to provide resources and skills for students to start those conversations and learn how to navigate them when they inevitably get difficult. Al Ptaszek '27, a DEIJ Board member who coordinates with Lawlor, elaborated on the purpose of the programming, commenting on how the session was aimed at \"[educating] students on the facts in order to allow them to use their critical thinking skills and form an opinion of their own.\" The talk was particularly focused on the process of how to disagree respectfully. For example, Carroll introduced the idea of \"calling in.\" In contrast to the traditional \"calling out,\" \"calling in,\" as Carroll defines it, \"offers grace and leads with questions to seek understanding.\" The purpose of \"calling in,\" she said, is to acknowledge an issue or contentious sentiment in a conversation and prevent further harm from being inflicted. In response to a question about the reception of the programming, Kumin stated, \"I think, as is the case with any programming, there are some people who saw it as very valuable and productive, and there are people who saw it as less than that or saw areas in which we need to improve.\" Yann Kumin, Upper/Middle School Equity & Inclusion Program Manager, commented regarding the connection between the assembly and the upcoming election. \"I think that we live in a time where political affiliation has been deeply tied to conceptions of identity, and as such, has made it so that it's pretty difficult for a lot of people to have any productive conversations across political difference.\" He added, \"the goal was to provide a foundational basis for how to approach having conversations across difference, to understand the notion, or to reaffirm the notion, of civil discourse.\" However, not all students have been on board with the programming. Like in many all-school assemblies, side conversations continued while the speaker talked, and phones clattered as they occasionally dropped onto the bleachers. Ptaszek, for example, said that he \"[does] believe that the assembly was productive.\" On the other hand, Jiner Huang '28 commented, \"Honestly, I think it depended on whether or not you wanted to be listening. There were definitely people who were actively trying to listen and actually hear what was being said, and those were the people who learned it got people talking.\" Expressing similar opinions, Sasha Westerfield '26 claimed that she \"thought [the presentation] was fine, and it addressed a good idea, but assemblies like those don't actually change anyone's behaviors.\" Westerfield also pointed out a flaw with \"calling in,\" as it \"only works if both parties in the conversation/argument are on board. For example, if someone was thinking about saying something controversial, they would likely only put that idea out there if they knew they weren't going to get called out, and of course, that isn't guaranteed.\" Kumin's conclusion regarding student reception of the assembly was that \"there was some good [and] some bad, but at the very least, it got people talking about calling in' and about how to have those conversations and how to create spaces in which those conversations are both safe and brave, which is our goal.\""
  },
  {
    "title": "Aramark Workers Serve Dinner with a Side of Joy",
    "author": "Elizabeth de Ramel '26 Opinion Writer",
    "text": "In every school, there exists a group of unseen heroes, whose contributions go far beyond simply adding an extra handful of fries. At Milton Academy, we have our Aramark Team, the dedicated staff who man age not only our cafeteria but also our social life. Although frequently overlooked, these people are crucial to creating a welcoming environment for students and staff Their infectious smiles, unwavering positivity, and dedication to building community radiate in so many ways-from creating vibrant birthday celebrations to fostering uplifting environments filled with music and joy. An aspect every student notices about the infamous \"Milton Academy dining experience\" is the music. Just as 5:30 pm rolls around, Forbes transforms into an unexpected stage where staff and students unite for an improvised karaoke session or dance lesson between the pasta and salad bars. For boarders like me, living hours away from home, our cafeteria serves as a crucial link to comfort and familiarity, and the Aramark team plays an essential role in creating a home-like atmosphere. Many of the students face the challenges that come with being away from their families for the first time, which can be daunting. This comfort, however, extends beyond just boarding students; day students also find solace in the homey cafeteria experience. After a tough game or a disappointing test score, there's something incredibly uplifting about the chance to join in a little song or dance. Despite often being overlooked in our school's system, our Aramark team works tirelessly and deserves recognition. While their efforts go unnoticed by some, they are the backbone and heartbeat of our daily school experience. The Aramark team invests time in connecting with students on a personal level, asking about their day, or showing genuine interest in students' lives. As Ariam Gebresilassie '25 said, \"They never fail to put a smile on my face. Those small gestures a quick 'Hey how are you?'-- really make a difference.\" Such meaningful connections elevate our daily experiences, especially in a school environment. This crew often serves as mentors for many, creating bonds that go beyond the typical student-teacher dynamic. While teachers play a crucial role in a student's academic development, Gebresilassie highlights how support staff, like the Aramark team, cultivate a unique bond with students. Overall, Aramark workers play a crucial role in fostering a positive atmosphere. These small yet significant acts build trust and encourage students to feel comfortable sharing their opinions, ultimately enriching Milton's supportive school environment. Without Marie's and Martine's presence, the heart of our school would undoubtedly skip a beat. Although many students may be too preoccupied with their almost glistering plates to notice, it's crucial to recognize the incredible people behind the scenes. Their presence transforms the lunch room into a vibrant hub of laughter, connection, and warmth. Milton as a school, would not be the same without their unwavering positivity. Whether through soulful music, spontaneous dancing, or sparkling smiles, these people play a vital role in fostering a sense of belonging. In this vibrant atmosphere, where everyone--regardless of their their role-comes together to share not only food but also the warmth of connection and camaraderie. Our Aramark team is more than just staff; they are the glue that holds our school community together, ensuring that students feel valued and at home."
  },
  {
    "title": "Special Schedules May Exacerbate Student Stress",
    "author": "Anton Badushov '26 Opinion Writer",
    "text": "This year, in addition to the break for Rosh Hashanah, Milton's hazy scheduling approach includes more disruptions, most notably an awkward splitting of Assessment Week. This year's Assessment Week, known for being one of the most stressful times of the year due to the heavy load of exams and assignments, will be cleft into two parts. The first part will run from Tuesday to Friday after a Monday off for Martin Luther King Jr. Day, while the second consists of one day the next Monday. After struggling through the demanding week, students are left with even more pressure from yet another exam the following Monday, disrupting what could otherwise have been a relaxing weekend. Instead of using that weekend to recharge, students are forced to stay locked in studying for the following Monday's assignments. This mixing of \"off and on days adds unnecessary stress to an already intense week, ultimately adding to students' anxiety. Since the beginning of this year, I have noticed a growing number and significance of midweek no-school days. A few weeks ago, Milton canceled school for Rosh Hashanah, the Jewish New Year, breaking up a full week of school with a Thursday off Considering how much the school emphasizes the importance of students maintaining their routines and getting back in the flow of classes, this mid-week interruption makes no sense. While it's essential to honor cultural and religious holidays, Milton's handling of the days on which to close school disrupts students' internal schedules, doing more harm than good. Beyond surface inconvenience, these constant shifts between off-days and on-days can have a detrimental effect on students' mental health. The inconsistency can interfere with students' internal clocks and add unnecessary stress onto their workload. The Cleveland Clinic reports that cortisol, the body's stress hormone, peaks in the morning on weekdays and decreases as the day progresses; that is why students always feel a bit antsy during their first periods and can better complete work later in the day when their stress hormone decreases. Paired with our traditional five-day school week, this bodily system provides a smooth rotation between periods of benign stress and productivity. However, when there is a midweek break in your schedule, your brain is tricked into thinking that the week is completed and the weekly cortisol pattern will be disrupted-with the sheer number of midweek breaks in the year, the school risks giving busy students much more unnecessary stress that could be easily avoided by adjusting the schedule. After a huge change that like splitting Assessment Week into two parts, Milton can't possibly mess anything up after that, can it? Well, following the Monday assessment, students will be given a three-day break a needed time to recharge and relax-only to attend classes again for one day on Friday. Here, they rob students of what could have been a well-deserved, six-day relaxation period. With Martin Luther King Jr Day's awkward landing, Milton's bizarre way of handling Assessment Week, and Rosh Hashanah giving students a Thursday off, Milton's oath of supporting students mental health is not looking good."
  },
  {
    "title": "Fostering Independence: How We Balance Parental Engagement",
    "author": "Charles He '26 Opinion Writer",
    "text": "Parental involvement in education is often hailed as a cornerstone of student success. At Milton Academy, parents aren't just spectators-they're partners in the educational journey. But here's the catch: too much parental involvement can stifle a student's growth, while too little can leave them feeling unsupported. So how does Milton strike the perfect balance between the two? The answer lies in the school's nuanced approach to parental involvement. Monthly parent meetings held by the UPSA (Upper School Parents' Association) create a line of communication. between the school and the parents without involving students. This keeps parents informed about campus events without hovering over their children's shoulders. It's a system that says, \"We value your involvement, but we also trust your child's ability to navigate and create their own path.\" For boarding students like myself, this balance becomes even more critical. Many people think boarding life is just the alternative to attending school if you live far away, but that's simply not true. Boarding life is a transformative experience that fosters self-reliance and personal growth. We're not just attending school-we're learning to manage our time, make our own decisions, and become responsible adults through this experience of almost full independence, And the school recognizes that. Consider how Milton handles academic responsibilities: we use Schoology, a digital platform, to handle our assignments and grades Unlike some schools where parents receive constant updates about missing assignments, the school leaves that responsibility squarely on our shoulders. There's no parental notifications when we miss a deadline it's up to us to face the consequences and learn from them. This isn't negligence; it's intentional. It's teaching us to be accountable for our actions. But independence doesn't mean isolation-the school has thoughtfully implemented systems to ensure our safety and well-being. As a boarding student, when we want to venture off-campus, perhaps into Boston for the weekend or to another friend's house for a sleepover, we use an app called Reach, which streamlines the process of getting parental and dorm parent approval for our outings. It's especially beneficial for international students whose parents might be in different items zones. By requiring parental consent for off-campus activities, the school ensures that parents are involved in the big-picture decisions that relate to safety and well-being without micromanaging our lives. The difference in parental engagement between boarding and day students is notable. Day students go home every day, share meals with their families, and thus their parents are naturally more intertwined in their daily life. Boarders don't have that kind of luxury; we might not see our parents daily, and communication might be limited to morning and evening calls due to time zone differences. Yet I don't feel unsupported, as Milton has fostered a boarding community which fills that gap. Support systems like our advisors or the counseling center offer a space for us to seek guidance and discuss challenges, whether academic or personal. It's almost as if we have that resource, a parental figure on campus who can understand the unique pressures we face. Moreover, the school's philosophy, \"Dare to be true,\" encourages us to explore our identities and become who we want to be, free from external pressures. For some students, especially those navigating complex aspects of their identity or future, this separation from parental or social expectation back home is liberating. But again, it's not like we're on different sides; parents and students can enjoy student life together. Digital platforms like Veracross provide parents with updates on school events and news, enabling them to engage in meaningful conversations with us without needing constant oversight. They can ask about the recent dance or how the sports teams are doing, ensuring connection without intrusion. So, is Milton's approach perfect? In my eyes, absolutely. The school has crafted an environment where students can choose their level of parental engagement. If you want to talk to your parents everyday, you can. If you prefer to embrace your independence more fully, that's supported too. The systems in place from academic management to off-campus permissions are designed to nurture autonomy while ensuring safety and support. In a world where constant overparenting can take away a student's own path, our school stands out by empowering students. It's not about cutting parents out; it's about allowing students to step into their own shoes: to make mistakes, to learn, and ultimately to grow. By nurturing independence and providing the right amount of parental engagement, Milton prepares us students not just for college but for life."
  },
  {
    "title": "Dare to Speak Up About the Election",
    "author": "Gustavo dos Reis '26 News Writer",
    "text": "Out of my four years at this school, 2024 is particularly a special one-a year in which our voices matter, and our privileges carry power. In this 2024 presidential election, Milton Academy students must speak up. Finding my voice in my community back home and using it to create significant change marked the years prior to my coming to Milton in 2022. Whether it meant resisting school administration pushback or joining national protests against the Brazilian government, I recognized the power of youth voices before I stepped on this campus. Thus, when I arrived and noticed this community's diversity and intellectual curiosity, I also expected to constantly witness students speaking up about global issues and injustices. Yet, as time went on, Milton did not exactly meet my initial expectations. I then noticed a lack of advocacy from the community, especially we students. Don't get me wrong: our students say and do a lot of smart things. But, at times, our voices feel artificial rather than unique. Even worse, at the Harkness table, our voices can speak up with the intention of earning impressive grades rather than truly reflecting on pressing issues. This culture feels weirdly wrong, however: as we navigate through school, we must recognize our privileges and use them in favor of oppressed groups. This year, as citizens set out to vote for either Kamala Harris or Donald Trump, our community has an important role in the process. Yes, a few of us-including me-are non-citizen international students. Yes, many of us are not even 18 yet. And yes, Massachusetts is not a swing state. But when we go to one of the wealthiest and most prestigious schools in the country, the extent of our voices and quality of our education can successfully prompt changes among other students. Whether you think Harris must win or Trump must return, our school's academics have prepared us to successfully discuss what options would truly benefit this country. Beyond discussions, we can also raise awareness about these issues to other communities. We must speak up, even and especially-if discord arises. Take a look at the archives of the Milton Paper in the late 1980s. Students and teachers constantly called each other out in articles. Even more productive, students spoke their minds about issues and our school's administration; they discussed politics, racism, and whatever issue tormented their communities, wide and narrow. And, through civil discourse, students educated the community about global problems and gradually became advocates for their beliefs. Now, I invite the administration, students, and staff to join me in this attempt for more active discourse, especially in such a defining political year as 2024. It is about time we end the performative activism that surrounds this community, dare to leave our comfort and privileged zones-the Milton bubble in which we live in-and talk to each other about what this presidential election could mean to this school and this country. To the administration, I know institutional neutrality is a must, but it should not serve as a pass for passive and performative actions. Speeches at all-school assemblies sound great; Ms. Stone's scoreboards successfully highlight our weaknesses and strengths. But where are the real actions? How can the administration emphasize civil discourse beyond providing spaces for discussions? To the teachers, bring this controversial topic up in class. You don't need to share your personal opinions, but discussing the presidential election always finds its space in every subject, especially across the humanities departments. As some of you have proved, teachers carry the power to engage hundreds of students and their reflections on this topic. Finally, students: let's create change. Share your opinions through the Milton Measure or Milton Paper. Help register more voters around your communities. Stay informed about the latest news. Educate your community around civic education topics. Engage others in productive discussions. Beyond all, debate among yourselves; agree and disagree. So, whether you support Trump, Kamala, or neither, speak your mind-a privilege that so many simply don't have."
  },
  {
    "title": "Beatnik Epitomizes Community",
    "author": "Char Mone '25 Senior Editor",
    "text": "Before the lights dim and the jazz ensemble begins to play, a warm buzz resounds throughout Straus Library. Level with the stage, some students fill the rows of chairs as others climb into window seats or opt for one of the few, comfortable seats on the second floor. Through noisy chatter and shuffling movement, even the inevitable throng of spectators standing at the back of the room quiets down in anticipation of the first act. As the introductory notes begin to ring out. a soft melody, the atmosphere is welcoming and vibrant. When Dr. Callen emphasizes the importance of community at Milton, we each envision our own distinct interpretations. For me, the community lies within the fierce camaraderie of the soccer team, the close bond of our small (but mighty) Classics department, and, especially, Milton's culture of music. Since my first Beatnik in the fall of my freshman year, music has formed the very foundations of my definition of our community. In my mind, the first champion pillar of Beatnik is our culture of unrelenting support. The audience whoops and cheers for every performance, regardless of experience level or musical ability. Whether it be an original poetry recitation, a Hendrix cover, or a musical theater number, every performance garners a high level of appreciation. At no other Milton event besides perhaps Dance Concert have I seen this level of universal respect. The consistency of support is what encouraged freshman me to begin performing. Throughout my freshman and sophomore years, I accompanied my friends with my guitar during their vocal performances. Prompted by the supportive atmosphere, however, I gradually worked up the gall to sing myself Though I've had my share of offkey moments and pitch snafus, every time I step onstage, I know that the safe environment of Beatnik will make up for my evident lack of vocal training. It's this reliance upon our community that makes up one crucial element of my love for Milton's music. The second main factor, of course, is the music itself As one of three co-heads of Magus Mabus Music, I worked alongside my fellow guitarists, Jack Bradner '25 and Simon Picotte '25, to form a well-rounded, involved, and skilled music board, And though I am well aware of the immense level of musical talent at our school, I never properly prepare myself At one point point while while spectating the show, I received a text from my friend in the audience in regards to my facial expressions apparently, my mouth had fallen open in disbelief; the performers really are that good. From a beautiful, raw original song to a ridiculously impressive jazz composition to a heartfelt Jeff Buckley cover, both the music board and other Milton musicians demonstrated their immense range of abilities at the first Beatnik of the year on October 4th. As I sat on the couch on the side of the stage, I realized that my favorite part of my role, apart from delegating and reprimanding the audience, was listening. Listening to each other is as crucial a part of community inside Beatnik as it is outside. Allow for silence in conversations as you respect the negative space in a well-phrased jazz solo. Abandon your preconceived judgments ents and distracted thoughts in difficult conversations just as you engage with a moving acoustic performance. And, most importantly, when someone shares a vulnerable part of themselves, listen as intently as you would to a cover of \"Linger.\" It isn't one skilled singer or accomplished pianist that makes Beatnik so integral to our school. It's all of you."
  },
  {
    "title": "Teachers Must Be More Inclusive on Family Weekend",
    "author": "Kaysia Maddix '26 Opinion Writer",
    "text": "Throughout my time here, Family Weekends have been rocky. This weekend serves as an opportunity for families to observe how their kids and their teachers act in class, meet with teachers one-on-one, and get a sense of their students' school day routine. However, the boarding population, which makes up approximately 50% of the student body, is divided between local boarders and non-local boarders. In the latter, students and their families hail from out of state and abroad, from which traveling to Milton for one sole weekend can be inconvenient and impractical. So, while family weekend was originally intended as a chance for families to interact with their students at school, for many non-local boarders this weekend evokes a poignant sense of longing and homesickness, underscoring the importance of support and inclusion during that time. During my freshman year, my family could not attend the programming on Friday and could make it to only the teachers' meeting the following day. I dreaded going to school on Friday, unequivocally the most important day of family weekend. I vividly remember walking into the RSG, trying to find my classroom in a sea of bustling bodies, as families scoured for their kids. The sound of everyone's footsteps echoed through the hall as they eagerly anticipated meeting their family. For that day, most of my classes were interactive with parents and kids, and I truly felt like an outsider. For my math class, students were paired off with their families to work on a math exercise whilst I just sat there, alone and longing to be included. As my sophomore year rolled around, I watched as teachers did the same thing. In my experience, teachers created classroom environments that excluded students whose families were unable to attend, only benefiting those who had the support of their families. I do not think my teachers intended to evoke such a strong sense of longing among those whose parents could not attend. However, the manner in which they operated classes on this day resulted in such feelings. With the school year still young, it is natural for non-local boarders to struggle with homesickness. Their hearts likely ache for the comfort of a home-cooked meal, the warmth and the tender embrace of family members in the flesh rather than through a screen, the cherished memories, and the familiarity of their own homes. Many non-local boarders, especially new students who are experiencing their first months away from home, grapple with this reality. Many teachers agendas for family weekends exacerbate their feelings of loneliness and isolation. With Milton priding itself on inclusivity, teachers need to do better in creating lesson plans that include everyone regardless of students' families' attendance. Despite the joy I feel because my family is finally able to come to the programming this Friday, I sympathize with those whose families are unable to attend, because I know that situation all too well. Let this be a call to action for teachers: do not let the name of Parents' Day distract you from your top priority, your students."
  },
  {
    "title": "Class IV Follies Brings Dreams to Life",
    "author": "Lyra Dvorin '28 A&E Writer",
    "text": "Dreaming Wide Awake, the 2024 Class IV Follies, opened last night after a six week rehearsal process. This year's Follies showcases a collection of scenes, songs, and dances centered around the theme of dreams. Director Scott Caron described the show as a \"collage\" of different stories, displaying \"both the dreams that we think of late at night and the things that we aspire to be... both fantastical and tangible.\" The show uses a full circle effect, starting and ending with the same image, a particular favorite device of the director. Though having such green actors is sometimes stressful and complex, Caron believes that \"at the end, the payoff is much bigger.\" Even freshmen who have previously participated in theatrical productions agree that the high school experience is very different. \"It really feels like mature theater,\" stated actor Nora Jin '28. Each musical number and transition requires the cast to be fully synchronized, one of the many factors that makes the show \"magical,\" according to Xu. Dreaming Wide Awake is also distinctive in that it is performed in the round, with audience members surrounding the stage for an immersive experience. Members of the tech and stage crew have also been working hard since the beginning of school. \"It's a lot of trial and error,\" explained crew member Khoi Coleman '28. They have completed a large variety of tasks, ranging from building the stage's floor and decorating the theater, to adding lighting and audio effects to the show. Stage Manager Cindy Zeng '27 commented that, throughout the rehearsal process, \"[she was] writing down blocking and taking notes.\" This preparedness helped the cast and crew move effectively through the process. However, Zeng, along with other members of the crew, performed her main job when the show runs. Zeng stated that she was \"in charge of all the stage cues, [including lighting, audio, and call ing people into their spots.\" These essential tech aspects were what made the show truly come to life. The Dreaming Wide Awake cast rehearsed almost every day for six weeks, spending two to four hours of their days together, and even more during the week preceding the show. According to several cast members, rehearsing a show together creates a robust community. Jin stated that \"when [the cast is] off stage, we're still so connected.\" The Follies provide an opportunity for freshmen to participate in the Performing Arts Department. This year's show features 13 Class IV students, many of whom had never participated in theater before. Actor Mia Xu '28 revealed: \"I had zero experience doing this. When I first came here, I was very worried.\" She was not alone in this sentiment. However, she said that \"as [she] slowly got to know everyone, it got better.\" Having a cast consisting entirely of Class IV also changes the perspective on the theme of dreaming. Caron believes this is particularly exciting, explaining that \"we're seeing [the theme through the youngest kids in our our [Upper School's] eyes.\" This authority over the show's perspective allowed the cast members to interpret the theme in a myriad of possible ways. The nature of this show made it extremely complex to create. It involved \"a lot of moving parts, memorizing, and being engaged with Follies include scenes from books, movies, and plays such as Coraline, A League of Their Own, The BFG, The Secret Life of Walter Mitty, and Dorothy Meets Alice, as well as many songs familiar to the audience. This process has been a valuable way for freshmen to meet fellow class members while creating a work of art. Looking forward, Koulomzin adds, \"I can't wait to continue to be friends with [these] people.\""
  },
  {
    "title": "Chappell Roan Backlashed: Does Fame Obligate Celebrities to Take Political Sides?",
    "author": "Phoebe Zhang '26 A&E Writer",
    "text": "As a singer, Chappell Roan has enriched and empowered many through her music. Her strong, authentic songs and her passionate, all-in concerts together tell a narrative of her experience as a queer woman and artist. Accordingly, her fanbase has risen at an unprecedented speed over the past six months; debuting her first hit, \"Good Luck Babe,\" in April, Roan broke the record for the largest crowd at Austin City Limits Music Festival in August. However, a month after her record-breaking, Roan made a controversial statement: she announced her vote for Kamala Harris in a Guardian interview. Still, she said she does not \"feel pressured to endorse [anyone because] there are problems on both sides.\" Some at Milton supported the comment. Among them is Sarina Miller '26, who expressed, \"If [Roan] sees problems on both the left and the right, an opinion many people can relate to, then that is a completely valid reason to not endorse a candidate.\" Adrienne Webb '26 echoed Miller's support saying, \"I understand why [Roan] will vote for [Harris] and still not accept everything she does: there is no best president or a perfect party.\" Yet critics overshadowed these voices of encouragement and characterized her as evasive for not taking a firm political stance. Today, with this new label spread across all media, Roan encounters a challenge most celebrities fear-political backlash. Analyzing the situation, we see that the reason for the backlash is simple. Roan's ambiguous stance frustrates critics and some fans who expect a clearer political position, especially when seeing her as a queer representative. Indeed, as Miller explains, \"many have the idea that specific groups should support a party simply because the members of that group are of a specific identity.\" Since queerness is often associated with the political left, this bias underpins much of the criticism Roan faces: as someone who is very influential and of marginalized identity, many critics believe she should fully support the left both in the interest of her fans and the group she represents. This expectation is dangerous. By showing Roan in a bad light for not endorsing Harris, the media and her fans with strong political opinions place a burden on her, a public figure, to adopt a monolithic stance based solely on identity. This pressure, under the context of the nearing presidential election and the heightened polarization, becomes serious social harm. As Miller further highlights, \"In the case of Chappell Roan, if [people] punish her for not conforming to the political expectation of her identity, then we will never live in a society where we can have healthy discourse.\" Additionally, we must admit another danger: the public puts too much political pressure on celebrities. Of course, being influential naturally comes with the responsibility of making prudent choices so that no damage is inflicted on others. As Rue Tanzi '26 expresses, \"[Celebrities] should know they have a lot of influence and that depending on who they are and what they say, there can be [consequences].\" However, we as the public need to start, as Tanzi puts it, \"humanize celebrities.\" Webb expands on Tanzi's point: \"Celebrities should be on the same political pedestal as a candidate. Therefore, what celebrities have to say about politics should not influence anyone]'s political views.\" Indeed, celebrities are just humans, and Roan's job as a singer is to create music. As Jiayi Wu '27 adds, \"It is the [singer]'s choice to include politics in their art, and people shouldn't expect [them to bear more political] responsibility than most people.\" Ultimately, the messages that Chappell Roan's backlash conveys-society's ongoing nonacceptance of diverse political opinions and the over-pressured role the public imposes on celebrities politically-are essential for society at large to recognize as the election approaches. However, as we navigate the complexity of this event, it is also vital for us to remember that Roan's artistry transcends beyond her political backlash. Despite Roan's current struggles, her hits like \"Red Wine Supernova,\" \"My Kink is Karma,\" and \"Naked in Manhattan\" continue to offer empowerment and connections to people who need it. As Tanzi reminds us, \"[Roan still] works to bring light to many minorities,\" emphasizing Roan's true purpose: to use her platform to uplift marginalized voices."
  },
  {
    "title": "More Than Art: AMC Outdoor Installation Spreads Climate Awareness",
    "author": "Mira Lu '27 A&E Writer",
    "text": "To kick off the school year, the Visual Arts department hosted the opening reception of Morris Norvin's outdoor installation \"A Plea from the Sea\" outside of the AMC. From the opening reception on September 26, 2024, this exhibition's six sculptures will remain on display throughout the school year until its closing on June 14, 2025. A graduate of the School of the Museum of Fine Arts, Norvin works with a diverse range of materials, including metal, wax, clay, and wood. He specializes in welding steel and incorporating found, functional objects, a practice he refers to as \"Junk Art.\" With a figurative anatomical focus, his work focuses on providing a connection between the living and industrial worlds. Norvin, who rarely purchases art materials, states that \"[his] interest lies in recycling objects and materials, things that had a previous life and purpose and then found themselves discarded.\" Norvin's work features a variety of exhibitions and installations, as well as performances and numerous miscellaneous works. With his 2024 outdoor installation \"A Plea From The Sea,\" which features all recycled materials, Norvin hopes to spread awareness of climate change. He titled the series with the word \"plea\" to express his environmental concerns and to highlight the imagery of sea creatures. The installation includes a large octopus, dolphins, a polar bear, and a school of fish, all made of reclaimed metal and paint. Norvin believes that these sculptures are representative of the issues regarding climate change that society should pay attention to and address. Though the installation has occupied campus for less than two weeks, it has already caught the attention of many students. Located at a visible location outside the AMC, Adair Johnson '27 noted that \"[she] always [likes] to see the art [there].\" Nehemiah Sanon '26 described the pieces as \"visually pleasing,\" and Angela Xu '27 expressed her admiration for \"the creativity of the artwork and how expressive it is for using trash to explore ideas about pollution.\" Elizabeth Harris '28 saw the animals simply as \"cute and happy  the meaning doesn't need to be figured out like a jigsaw puzzle.\" Certainly, the figurative nature of the animals suggests that the meaning behind this exhibition is open to artistic interpretation. Eliana Soiffer '25 found the \"polar bear really memorable\" for being \"not only shiny but [allowing audiences] to feel trapped or cramped in a sense.\" Noa Heikkia '27 thought that \"the octopus was pretty fire,\" and Erin Breva '27 loved \"the blue and purple gradient dolphins.\" Each animal displays unique forms, colors, and sizes, with some reflecting a shining silver color while others have tints of both warm and cool colors. Some students who caught a glimpse while passing by or have yet to see the installation are eager for a closer look. \"I don't really pay attention to them,\" said Nia Phillips '25, although she mentioned she'd love to pay a visit. William Nass '26 said that \"[he] didn't know there were pieces outside the AMC,\" suggesting that there might be room for improvement in the promotion of these pieces. Typically, the outdoor exhibitions in front of the AMC change every year. Last year featured Michael Alfano's Mind Made Visible, and the year before showcased Nora Valdez's Passage. Other Visual Arts exhibitions to look forward to this fall include Daphne Confar's paintings Home, acclaimed for the \"irresistible appeal of vintage snapshots,\" currently on display at the Nesto Gallery until October 31st, 2024. Following Confar's exhibition will be Santiago Hernandez's Archiometires, featuring a collection of abstract paintings and drawings, as well as a mixed media assemblage. Looking ahead, 2025 will also mark Nesto Gallery's 50th year. To celebrate, a special exhibition in the Spring will feature a series of curated art, including William Nesto '68's Canto XXX until graduation in June."
  },
  {
    "title": "A Cappella Groups Foster a Tight and Trusting Community",
    "author": "Raphael Rufino '27 A&E Writer",
    "text": "Through joining a cappella groups like Epic, the Miltones, Octet, and Resonate, students gain the ability to display their passions and talents, form bonds with students from other grades, and grow exponentially in learning music and understanding the power of their voice. One of the main objectives of these groups remains to come together and celebrate the shared value of singing within the school. By including singing groups within school boundaries, students who are a part of a cappella have the opportunity to share their talents with the people around them, fostering a sense of community and recognition of their craft. The Miltones, Milton's all-male-identifying a cappella group (led by Callum Hegarty '25 and Gratian Ting '25), has around 12 participants, making it one of the largest a cappella groups on campus. After a successful 2023-2024 year, with many performances ranging from interactive Valentine's Day serenading to various special performances, the Miltones have become a club known across the school. The Miltones certainly understand that maintaining a close community amongst themselves remains essential. Toby Kim '27 remarks on his appreciation for the group, stating, \"It's a place where I can have a lot of people who have common interests as me: singing.\" Hugh Kramer '27 adds, \"Singing is a vulnerable moment because you're putting yourself out there. It's something that you don't do that often. It really builds a community of trust.\" Hegarty expressed that novice Miltones frequently naturally find their place in the club, however, \"having fun environments...being open, and staying back after rehearsals\" immensely contribute to the tighter bond that forms. Another a cappella group at Milton, Resonate, is the only all-gender a cappella group at Milton, and along with The Miltones, is one of the biggest. Run by Claudia Krishnan '25, Maggie Dudley '25, and Mika Hsieh '26, Resonate is also challenged with maintaining fame throughout the Milton Academy community. With auditions happening during the third week of school, the three co-heads hustled to establish a successful new beginning. According to Krishnan, \"It's great to see how the new generation of Milton Academy students is accepting a cappella,\" she adds, \"23 new people auditioned, which is more than we've ever had audition before.\" Dudley mentions that she \"didn't know a lot of underclassmen, [so] meeting them [through auditions] was great.\" Sarah Price '25 added, \"It's a lot easier to engage in [singing] when you're in a club like Resonate.\" Price continued, \"A cappella is a good way to get involved with something you're passionate about in a very low-key way. It creates a nice community, where everyone is very supportive and helping each other grow.\" Octet, the oldest female a cappella group at Milton, is another club where female-identifying students meet to sing arrangements organized by their co-heads, Camilla Butler '25 and Emilia Raviola '26. Although historically, the group consisted of an entirely female choir, Octet evolved to accept a beatboxer of any gender identity. Busy and hardworking, Butler and Raviola hit the ground running with auditions on September 27. Raviola explains her perspective on the small size of the club, explaining, \"With a group like that we get to know each other really quick.\" Raviola also adds her appreciation for the group, stating, \"We wouldn't know each other if it weren't for OctetI think it allows me to make friends with people that I don't generally have classes or activities with.\" Epic, an a cappella group run by Safina Abramova '25, Georgia Isaac '25, and Rae Hanlon '25, is an exclusive girls-only a cappella group. When asked how this a cappella group differed from the rest, Maya Walsmith '26 explains, \"The community aspect of it makes it stand out.\" Walsmith adds, \"We have so much fun singing together and the group has definitely also brought me some of my closest friends.\" Walsmith also mentions that Epic will perform at Boarder Dinner and upcoming All School Programming events."
  },
  {
    "title": "Its Friday Night...No Lights",
    "author": "Lachlan Quinn '26 Sports Writer",
    "text": "Picture this: it's a Friday night, and you and all your friends are preparing to watch the football game. The falling leaves crunch under your feet as you trek from campus to the Milton High football field. But this year, there won't be any leaves crunching under your feet on your way to the stands, as this common tradition of Friday night football games has been eliminated. Let's take a look into why this elimination happened, not only for football, but for every sport, and how Milton athletes feel about it. The first reason is equity; if one sports team has a Friday night game, then every other varsity sport, during that specific season, must have one as well. Milton does not have its own lights; so, if they wanted to have a night game at all, they would need to use the fields of Milton High School or Curry College. But, this year, the two schools can't host every team. Equity trumps a scenario where only one or two of all varsity teams can relish this experience. So, with the combination of fairness and the actual inability to have Friday night games for every team, night games have been eliminated from this year's sports schedule. But, how do the athletes feel about this change? When regarding how no Friday night games will affect team spirit, senior football player Gavin Thomas '25 said that \"the cancellation of Friday night light games will have a huge negative effect on the school's team spirit.\" This makes sense, as the Friday night games are a hallmark of Milton culture. The players get hyped for the game, ready to perform in front of the whole school. Without that sense of anticipation, the atmosphere might not feel the same. Thomas also emphasized that the lack of Friday night games could \"affect overall attendance at games.\" With all the other athletes playing on Saturday and non-athletes having extracurriculars that day too, Saturday poses much more inconvenience for attendees than Friday, when few have commitments. Chloe Diadamo '26 reiterated that point when saying that no Friday night games \"make game days [Saturdays] less exciting, and instead of the community being all together on a Friday night celebrating, people are doing their own thing.\" Friday nights were what brought the Milton community together, a place to cheer on your teammates and represent your school; it was a way to bring borders and day students together, something that is important in a 50-50 schooling environment. Now, without Friday night lights, the community suffers. It's not only the football team that is affected, either. When asking Devan Kathiresan '26, a member of the boys' varsity soccer team, about the lack of Friday night games, he expressed that he \"[knew he and his] teammates were all a little bit disappointed.\" Larissa Rubeiz '26, a player on the girls' varsity soccer team, said that Friday night games \"makes [the girl soccer team] play better because it incentivizes [them] with fans and atmosphere.\" Friday night games are experiences shared by the whole community, allowing fans to gather and players to perform under, literally, the brightest lights. So, what should Milton do about this? One idea is to add lights to the fields. That, however, is tricky due to the neighborhood. Milton is located on a street ridden by houses, whose residents may be bothered by the noise and crowd. For now, Milton students must accept the fact that Milton won't be having under-the-light games on Fridays for the foreseeable future, or at least until an agreement between Milton High or Curry Collage forms which would allow for every Milton team to participate in games under the lights."
  },
  {
    "title": "Darlings Program Builds Strength and Spiritships",
    "author": "Jai Malhotra '26 Sports Writer",
    "text": "The Darlings Program isn't just about breaking a sweat-it's about breaking through barriers. For the last 21 years, the Darlings Program has offered student-athletes a way to stay in shape during their off-season, while also welcoming students who are simply looking to improve their fitness. As Athletics and Physical Education Instructor and Coach Steve Darling, who is the eponym for the \"Darlings\" initiative, explains, \"the primary goal of the program is to help student-athletes improve their overall athleticism, which involves improving their mobility, stability, strength, speed, and conditioning.\" Athletes start each session with foam rolling and stretching. This is followed by a dynamic warmup that leads into the gym workout, which occupies most of the time. But you're not done yet: the session ends with an endurance workout. Darling says that this routine and his specific exercises were designed to \"educate the student-athletes regarding a proper system of training based on scientific evidence and research.\" The Darlings Program is offered as an Intramural activity during the Fall and Winter seasons. Students can sign up through the email sent out by the athletic department over the summer. This annual email invites students to join, ensuring everyone has a chance to benefit from the program. Just five weeks since the start of school, members of the Darlings Program are already starting to see an impact. Conner Noel '27 explained that he \"feel[s] stronger on the court-jumping higher and feeling in better shape.\" Building on their early successes, participants are eager to continue pushing themselves with the help of Coaches Darlings and Brett Harring, another strength and conditioning coach who helps run the program. Cole Simmons '26 has seen dramatic improvements. At the beginning of last year's Fall season, Simmons could bench press 160 pounds, which improved to 175 by Winter. He is now putting up 205 pounds on the bench, and credits much of his success to the Darlings Program. He also believes that \"with the help and support of Coach Darling and the Darlings Program, [he] can reach [his] goal of a 215 bench by the time the basketball season begins.\" Gavin Thomas '25 echoed Noel and Simmon's remarks, saying \"[Darlings] has helped me stay in shape both through conditioning and strength during the off-season, which translated smoothly to the [football] season.\" Participating in the Darlings Program not only increases the physical capabilities of individual players but also creates a sense of unity amongst teammates. Gabriel Koerner-Imas '26 explains that \"during Darlings, we push each other to our limits and do partner and group exercises which promote team spirit amongst the boy's hockey team.\" Kaysia Maddix '26 has had a similar experience: \"Doing the competitive Darlings workouts [have] helped me as both an athlete and member of the community as it promotes team spirit and team bonding.\" Even some students who aren't in the Darlings Program have managed to notice its positive influence. \"From what I've seen,\" Rhia Patel '26 reports, \"people at Darlings work together and are always encouraging each other to do better every day... and I think that's a really great spirit that the Darlings community has.\" The Darlings Program is also doing its part to help Milton achieve its goal of helping integrate new student-athletes into the community. Brody Sharpe '26, a hockey player who is new to Milton Academy, said that \"Darlings has helped [him] get acquainted with the hockey team and get to know [his] teammates better.\" Sharpe does not stand alone in this; Spencer Booth '27, a new basketball player for Milton, reports that \"working with Coach Darling has helped [him] become a lot closer to his teammates, some of whom [he] considers his closest friends here at school.\" The Darlings Program isn't just about creating stronger athletes - it aims to create stronger teams and communities, and habits that last a lifetime."
  },
  {
    "title": "From Victory to Dynasty: Celtics Pursue Consecutive NBA Champion",
    "author": "Anthony Wu '27 Sports Writer",
    "text": "\"We know how it feels to win, and we tryna do it again,\" Boston Celtics star player Jayson Tatum said on Celtics Media Day on September 24th, exactly 100 days after the team lifted its first NBA Championship trophy since 2008, according to the Celtics' YouTube video \"Jayson Tatum Press Conference.\" The reigning champions are looking to win it again, and this year, they're one of the top seeds to defend the title. In the 2024 NBA Draft, the Celtics took Baylor Scheierman at the 30th pick and Anton Watson at the 54th pick. Scheierman averaged career highs of 18.5 points and nine rebounds per game while also shooting 38.1 percent from the three-point range for Creighton University last season, according to his 2024 NBA Draft profile. As NBC Sports Boston reported, Watson is a 6'8, 225-lb forward from Gonzaga University, having averaged 14 and seven in his fifth college season. Avid Celtics fan Sammy Greer '27 said that Scheierman \"is an elite scoring threat on our bench andanother great three-point shooter to help keep [the Celtics'] offensive scheme going.\" Greer hopes that Scheierman's three-point shooting percentage and Watson's strength can translate to the league so that \"after having such an elite defensive team last year, the new offensive weapons are going to make this repeat easy.\" Cyrus Brun '27 offered his insight into the Celtics' biggest strength this season, stating, \"Their starting lineup has no bad defenders.\" He continued that, out of the Celtics' seven-man rotation, three people-Derrick White, Jaylen Brown, and Jrue Holiday-\"could make the All-Defensive First Team,\" an honor given to the NBA's best defensive players. In fact, professional sports analysts agree with Brun's claim: Yahoo Sports ranked the 2023-2024 Celtics' defensive lineup as the second-best in the league. HT Xue '26 added that \"there is no situation on the perimeter where a switch is a bad option for their guards, and though Tatum and Porzingis may not be great defenders they are both quite large in stature and capable of playing above-average defense on both the small forward, power forward, and center positions.\" Professionals and fans alike agree that the Celtics' impenetrable defense makes the team a strong contender for the NBA championship title. \"On a good night, they are unstoppable. On a bad night, they are like KSI's new song [\"Thick of It\"]: \"They don't hit.\" Mckenna Ruland '27 commented on the Celtics' overreliance on their three-point shooting, which is also one of the team's biggest weaknesses. The Celtics average the most three-point attempts in the league, and on a good night can put up 40.3% of its shots, informed USA Today. On a cold night, however, that percentage falls to around 30.6%. Furthermore, the Celtics' lack of playmaking skills tends to hinder the team's success. Peter Cohen '28 expressed concerns about the way the Celtics seem to neglect playmaking, saying that \"we shouldn't have traded Marcus Smart [as] he [was] probably our best playmaker.\" Without him, Cohen predicted, the ball will get \"[stuck] on the offensive end.\" The Celtics sit at 23rd in the league on assists per game, reported the Celtics Blog, and play isolation-in which one player is given the ball and others clear away to let him win a 1v1 and score-a lot, standing at a whopping fourth in the league for frequency of iso plays. Although the Celtics have some of the best isolation players in the league, the offensive stagnation from lack of playmaking and frequent cold shooting nights could thwart the Celtics' success in the long run. The Celtics also face some threats this season: other teams that could stop it from repeating. Rae Hopkins '26 is confident that \"a healthy Milwaukee Bucks team is the biggest threat to the Celtics in the East.\" Hopkins continued, \"One thing the Celtics never saw during their playoff run was a dominant big,\" jargon for a dominant central-forward player, \"and with [the Bucks'] having Giannis Antetokounmpo, it's going to be a tough challenge for our big men [Al Horford and Kristaps Porzingis] to keep up with.\" Horford is getting old, and Porzingis is still dealing with injuries. As the Boston Celtics prepare to defend their NBA title, they bring a mix of seasoned talent and promising rookies. The team's formidable defense, plethora of All-Star players, and NBA Finals MVP Jaylen Brown make them prime contenders. Though offensive weaknesses and challenges from teams like the Milwaukee Bucks could divert their success, the season promises to bring thrills as Boston aims to win back-to-back championships."
  }
]

