[
  {
    "title": "Scheduling Slip-Up Sparks Late Lunch Mayhem",
    "author": "Dilan Payne '27",
    "text": "On September 16, 2024, students kicked off their first Orange Monday morning of classes with a smooth start, only to be greeted in Forbes by a crowd of approximately 600 students, nearly twice the usual number. Jane Shoemaker '28 described her lunch block as \"the Hunger Games.\" While it took some students who pushed their way to the front a mere ten minutes to reach the front of the line for the hot meal, others, Shoemaker noted, waited up to 25 minutes during their assigned lunch block, all in hopes of securing California sushi rice bowls.\n\nScience Department Chair Sarah Jacobs, one of four faculty members who helped to create Upper School schedules, explained the reason for the wait. According to Jacobs, quite a bit more goes into the construction of the schedule than students may appreciate. While students first review their schedules in late August, the plans are the result of months of work. Accommodating 714 course requests, they usually \"make changes right up until those schedules go out,\" says Jacobs. The scheduling team—composed of Jacobs, Registrar Liz Wood, Assistant Registrar Susan Mosher, and Academic Dean Heather Sugrue—spends five consecutive, ten-hour days together to produce the structure of the upcoming year's schedule. Each plays a distinct role in the organization: Mosher tracks classroom occupancy, Jacobs runs the software, Sugrue advocates for student schedules, and Wood, as Jacobs describes, manages to \"hold just about everything in her mind.\"\n\nAccording to Jacobs, each individual schedule is built upon a foundation of carrier blocks, which define how long and how frequently each class meets. This year, Jacobs recounted how the team of four paid special attention to the schedule's \"flow.\" However, these structured blocks are just the beginning. They then dedicate the next day and a half to the placement of \"singleton\" classes, courses with only one section. These are placed using Class A Scheduler, a piece of software capable of organizing the days of all 848 students and faculty. Once these individual courses are locked in place, the team moves onto the two day process of integrating classes with more than one section, adding each one individually and adjusting student schedules accordingly.\n\nHowever, the team must then incorporate more than the mere organization of class blocks. They must also be aware of classroom vacancy, teacher availability and class diversity. Once the schedules are adjusted, when each has been adapted and accommodated, Wood and Sugrue primarily take over, taking course requests and updating student schedules accordingly.\n\nWhile Class A Scheduler assigns students to classes and structures times, it does not divide the early and late lunch blocks, which are intended to split the student body in half. Jacobs explains that the mistake was likely due to \"a decimal in the wrong place in a number.\" She continues, outlining that that error \"can unbalance something else by mistake.\" Yet Wood acted quickly. Within 30 minutes of hearing from Campus Services, Wood had updated the lunch schedule for 300 students, sending an email, as well as updating the Google Calendars and Veracross.\n\nYet those forty-five minutes will be remembered, as some hungry students smoothly cut to the front of the lines, squeezing past other, more patient students. Bridget Hunt '27, one of the 600 students in Forbes that day, described that she \"could hardly see the floor.\" She waited for over half of her forty-five minute lunch block, losing time primarily due to the inconsiderate nature of the other hungry students. \"I saw kids marching right up to the front, elbowing past people who had been waiting for almost thirty minutes,\" said Brady Payne '25. \"It wasn't subtle—people were skipping whole sections of the line, and no one was saying anything.\" To Payne, it felt like everyone was out for themselves.\" The mix-up was swiftly resolved. But as Shoemaker summarized, \"It's a funny way to start off my first year of lunches in Forbes. Hopefully, next time, if there is a next time, everyone will remember that we're all in this together—even when we're hungry.\""
  },
  {
    "title": "Club Fair Attracts Students, Raises Scheduling Concerns",
    "author": "Joanna Zhang '27",
    "text": "On September 19, the annual club fair took place in the ACC. Students explored and signed up for many clubs and organizations, from the Milton Measure, the Milton Paper, OBK, and TutorMilton to various extracurriculars.\n\nAccording to several students, the club fair serves as a great platform for students to navigate the clubs on a deeper level without scrolling through the \"spam\" club advertisements in their emails. \"I think club fair really [helped] new students know about the clubs in Milton because, throughout the year, clubs just happen on their own so students don't get to know about what is happening in each club,\" stated Tiffany Guo '26. Kaia Evans '27 also believes that \"the club fair is a really good opportunity to explore different options and know who is in the club and the vibe of the club.\" Evans also liked how students were able to interact with club heads and ask questions about the club.\n\nMoreover, the club fair helped some club heads and board members attract more students to attend their clubs. As a board member and co-head for various clubs, Gus Vogel '25 stated that \"the club fair [was] super useful as it [gave heads and board members] the time and space to answer questions that prospective members may have. There's only [limited information that heads] can fit in an email... while the club fair gives heads 100% control over how they want to represent [their clubs].\" Regarding board applications, Mariana Dos Santos '25, a co-head of Sustainability Board, claimed that \"the club fair was a good opportunity to meet students who are interested in applying. It's good to talk to students in person... so [heads] could select them.\"\n\nDespite bringing opportunities for students to devote themselves to a plethora of interests, the large number of clubs on campus fuels competition between clubs to attract more students to sign up. Cattien Hyuh '26 stated that \"there were just way too many clubs that have to compete amongst one another.\" Dos Santos also noted the competitions between clubs in the club fair as heads and board members \"want more people to sign up to attend their clubs even though many students probably won't show up to the meetings later on.\" Although the competition was stressful for some, it motivated heads and board members to put more effort into advertising their clubs. Guo, a member of the K-pop group in Korean Culture Club, did her best to make the posters more compelling and visible to students so they could come to sign up. Guo also stated that \"it's very exciting to see students be attracted to the same field that [she is passionate about.\" However, despite the great opportunities and the fun environment at the club fair, \"there [were] fewer students who came to the club fair this year compared to last year\" and \"many students left early,\" according to Dos Santos. Potentially, the decrease in students attending the event is because many students are dissatisfied with the way clubs are run. Alisha Xu '27 said, \"I hate how there's only 3 club blocks this year. Seeking to analyze the use of club blocks, especially club block two which conflicted with the extra help block, the committee conducted surveys among students and faculty. A club blocks rather than 4 club blocks... a lot of the clubs that I want to attend conflict with each other.\" Similarly, Huynh stated how she dislikes the \"over-saturation of clubs in specific club blocks. For example, [Asian Society] meets during club block one which stops me and other members from attending other [clubs] that occur at the same time.\" The faculty schedule committee decided to reduce the number of \"challenge emerged... during extra help blocks since [students] had the other option to go to a club, and we, as an institution, prioritize the extra help time,\" said Heather Sugrue, Academic Dean. \"With the data we collected, prioritizing extra help as a time that's not double booked felt super important.\""
  },
  {
    "title": "Dorm Dinner Forbes Reorganization Frustrates Day Students",
    "author": "Eli Berk '26 & Emilia Raviola '26",
    "text": "Last year, dorm dinner, required dinners for every student of each dorm, occurred on only Mondays, but this year, Thursday dorm dinner has returned. Director of Residential Life Anika Walker-Johnson announced on Monday, September 16 in an all-school email that \"day students and boarding families who are not participating in sit-down dinner [which occur on Mondays and Thursdays] are welcome to arrive by 5:30 p.m. and should plan to depart Forbes Dining Room by 6 p.m.\" However, she wrote, \"boarding students are free to invite day students to join them at sit-down dinner.\" Explaining the creation of reserved seating, Walker-Johnson acknowledged a \"really complex dining space issue. A lot of schools have one central dining room where everyone can fit. Milton doesn't have that.\" Between Wolcott, Forbes, and Academy Houses, 95 students eat dorm dinner in Forbes. With the addition of faculty members, Walker-Johnson called it a \"puzzle to try to figure out where everybody fits.\" According to her, \"in order to ensure they have space, the space needs to be reserved.\"\n\nWalker-Johnson added that \"signage will be visible on the tables to designate... seating for day students... [and] reserved seating for boarding students who live in Wolcott, Forbes, and Academy Houses.\" This change was especially impactful for the Speech and Debate team, which includes 57 day students, all of whom also have to get dinner in Forbes before their 6:30 Thursday practice. There are only slightly more than half as many seats in the \"open seating\" section. S&D Coach Lindsay Donovan noted that when it comes to issues affecting boarders, the administration \"never contacts the...coaches directly beforehand to give us notice.\" Donovan explained that the coaches moved practices by fifteen minutes to adapt to the change. Practices also \"moved to Thursday evening to accommodate athletics,\" she said. \"We are often a very secondary or even tertiary concern on campus, even though we have 100 students... Some students are always excused from sit-down dinner due to club sports teams. [It's] quite annoying.\" Gus Vogel '25, a member of the S&D team, explained that \"a big part of my routine is going to Forbes before [S&D] practice... So many of my after-school activities end at around 5:45... I definitely don't want to feel rushed. Especially since I've already had such a busy day, I kind of need that time to relax, reflect, and have a nice nutritious meal before I am sent off to speak publicly in front of my peers.\" \"I think roping off those areas is just a way for people to understand that oh, I might need to grab my food and go,\" said Josh Jordan, Wolcott House Head. \"I don't want it to be something that's dividing. I just want boarding students to feel like this is their space, their dinner.\" Hoping that this change will help day students to understand dorm dinner culture, Jordan stated that \"after a while... maybe we won't have to do as much reserving the tables and blocking space off. People will know.\" Speaking to the value of dorm dinners as a whole, Jordan stated that \"something about sitting down and eating a meal is very wholesome and intimate.\" Multiple students expressed criticism for the new setup. \"Day students don't really have a place to sit... tables are really quickly taken up,\" said day student Anh Tran-Nguyen '26. \"Dorm dinner is in concept a great idea,\" stated Wolcott boarder HT Xue '26. \"People in the dorm do sometimes bond over [it], but a lot of people are not super into it,\" he continued, \"I think it's pointless to try to force people in dorms to come together.\" On the contrary, Mira Lu '27 called dorm dinner \"a really nice dorm bonding activity.\" Xue also stated that the new Forbes arrangement \"doesn't really change much.\" Despite her belief that \"dorm dinner on Monday and Thursday is a valuable opportunity to check in at the beginning and at the end of each week,\" Walker-Jonhson acknowledged that \"time is something of a challenge. I love to have dinners where people feel like they can slow down.\" Similarly, Jordan mentioned that \"it's almost impossible\" to \"get everybody in a space at one time that works for everyone.\" Both Jordan and Walker-Johnson emphasized that day students are welcome to join dorm dinners, each highlighting the importance of intentionality in taking part. \"We want them to join our experience,\" stated Jordan. Expressing a similar sentiment, Walker-Johnson stated that she \"know[s] that roping off tables might seem exclusionary. It's more for a sense of direction. We're trying to help you understand that this is Wolcott, Forbes, or Academy, and you're welcome to join, but you should know that you're participating in something.\""
  },
  {
    "title": "Performative Passions: College Admissions Create Commodification Culture",
    "author": "Editorial Board",
    "text": "When it comes to college applications, do Milton students define their educational pursuits by their authentic interests or a resumé? With nosediving college acceptance rates following the COVID-19 pandemic, students scramble to intrigue admissions officers with creative but shallow high school narratives. Overwhelming extracurricular and academic loads have become a common characteristic across the student body. To validate this point, the editorial board acknowledges its members' extensive head positions: Asian Society, Multicultural Club, SAGE, Magus Mabus Music, Classics Club, Body+, Milton Yearbook, Community Engagement board, Sustainability Board, Latinx, BOLD, Science and Engineering Club, Invest in Girls, Math Club, OBK, and SGA.\n\nAll honors courses, straight-As, co-head of three clubs, and a perfect SAT score characterize an ideal Milton student. More often than not, students base the importance of their Milton education on college acceptance. Instead of genuinely discovering new interests, students, hoping to stand out amongst thousands of other applicants, hone a narrative that neatly fits them into some unique categorical box: \"the STEM kid,\" \"the future doctor,\" \"the sustainability activist,\" \"the history geek,\" \"the social justice warrior,\" and so on. This prescribed purpose informs every extracurricular activity and academic course; it paves a clear, intentional path to the personal statement essay.\n\nThe newest strategy to establish this narrative is the all-encompassing \"passion project:\" conducting fundraisers and creating a non-profit organization all for it to take up an activity slot on the Common App. This very idea of a \"passion project\" is paradoxical, as catering one's efforts to an admissions officer instead of the project's intended population is anything but passionate.\n\nWhen walking into the ACC tennis courts of the club fair, colorful signs with bulging QR codes flash and flare before the eyes of prospective members. Should these students, inundated with \"extracurricular opportunities,\" select what they are truly interested in or what \"looks good\" for college? These clubs, though they can require hours of preparation, action, and passion, can also be reduced to the 150 character summary on their Common Application activity list. So why not sign up for as many as you want? Why not punch your email into the sticky laptop keys on the table for another email list? Currently, Milton faces an oversaturation of clubs. While some clubs do definitely come from a place of pure enthusiasm, others are buoyed by club heads who run around this ACC gym to their different tables, dividing their efforts among numerous organizations, lacking priority.\n\nSimilarly, Milton's course catalog poses the same problem. So many courses can appeal to many students' interests; however, a specific compilation of courses over time can market a student with a narrative, a story in which they write themselves into the ideal, well-rounded yet specialized, challenged yet excelling, student. Surrounding course planning at the beginning of March, most students look to sign up for the \"easiest courses\" that at the same time \"look the best for college.\"\n\nYet, as students commodify themselves for college through carefully curating a high school resumé, they actively lose the purpose of these formative years: determining their passions. How can students actively explore themselves if they are constantly trying to fit themselves into a box, manufacturing themselves into a \"perfect\" applicant?\n\nThe Community Engagement Board, SAA, and SGA have an informal rule where a student cannot head more than one of these programs. This practice underlines how the oversaturation of clubs at Milton has normalized the idea that there is a defined list of major and minor clubs. As some students half-heartedly head multiple clubs and prioritize their activities, clubs fade into the background and lose their air of significance within the student body. Some students confine educational pursuits to a dispassionate resume and thus the school leaves its unique appeal behind. Each student applied to Milton Academy and now find themselves in a school of unparalleled opportunities meant to be taken advantage of. So instead of limiting our interests to a 30 second read from a college admissions officer, let's take risks and explore who we are.\n\nIf you want to nurture your affinity for science, ignore completing your two year history credit during your underclassmen year. Rather, sign up for biology and environmental science courses and explore your interests. In the long run, students need to come to terms with their natural idea of what success and happiness means. Right now, for you, that does not mean chasing a planned idea of who and what you want to become for college admissions officers. The Editorial Board's message to you is to be who you want to be."
  },
  {
    "title": "Speech and Debate Wins Awards at Yale",
    "author": "Anaïs Bricout '26",
    "text": "From September 20 to 22 in New Haven, Connecticut, the Speech and Debate Team competed at the annual Yale tournament. Fresh off months of summer preparation, Milton's team earned several awards at the tournament. In the Congressional Debate category, Rhys Adams '26 won the tournament, and Cindy Zeng '27 and Anna Schmults '25 were semi-finalists. Several Public Forum debaters ranked high in speaker awards, the individual ranking that is separate from the pair tournament. In Varsity, Teddy Choe '26 received 52nd speaker. In JV, Alex Sherman '27 received 32nd speaker, and Tobias Kim '27 received 40th speaker. Finally, for Humorous Interpretation, a speech event where students offer their humorous take on a previously published piece, Caroline Blake '25 made it to semi-finals.\n\nThe team's first tournament of the year and one of just a few travel tournaments, Yale is a returning addition to the tournament schedule for the 2024-2025 school year; the last time Milton attended was school year 2022-2023. According to Speech and Debate coach Lindsay Donovan, this change occurred simply as a result of Yale's availability as a tournament for Milton's students. She underscored that much of this was in the \"context of COVID, and... that changes everything.\" Furthermore, the Yale Debate Association supposedly \"didn't have [enough] funds\" in the last couple of years, so the tournament was temporarily online and then available in person only to Speech.\n\nTo Donovan and other Speech & Debate coach Scott Caron, with their main values of \"equity [in] Speech and Debate in terms of opportunities,\" attending a tournament where only half of the students could experience the \"travel aspect\" seemed \"unfair.\" In fact, Donovan focused on the fact that although she wants students \"to be serious about competition,\" she also wants them to \"have a good time and enjoy being somewhere else.\" Hence, more travel tournaments will be available this year; in late November, students will have a new opportunity to attend a tournament in Glenview, Illinois.\n\nDue to the tournament's early timing in the school year, Milton Academy students \"[had] to do a lot of work over the summer\" and \"take on the bulk of the preparation alone,\" stated Donovan. As such, this event was exclusive to veteran members of the team who had been involved and dedicated last year. Depending on the category, preparation could mean \"writing affirmative responses on a piece of legislation, or writing an entire oratory on a topic you're interested in.\" Yale was definitely a \"pretty heavy lift to start the year,\" she emphasized. For those not involved in this tournament, Donovan and Caron organized this year so that returners would not have to begin practices with the team until October 10th, leaving much more leeway for new students to build their skills. With that time, the two coaches focused on creating a boot camp for novices, as well as preparing Yale tournament attendees.\n\nYale this year also represents a fresh start for the team. Donovan described that the team was \"making little goals,\" implementing changes that would encourage further student participation. For example, one-on-one coaching sessions, as Donovan highlighted, are a new focus because students \"get substantial feedback and action items,\" which are \"a lot more fruitful\" in making them better orators. On the other hand, in terms of more big-picture goals, Donovan spoke of her desire to encourage more participation from the entire team. Some policies she re-enacted include required minimums for tournament attendance and rules for practices. For Donovan, the tournament signals the continuation of Speech and Debate's highly successful era."
  },
  {
    "title": "Division Divides: A Critique of Culture Clubs",
    "author": "Rebekah Manon Fabella '25",
    "text": "In my four years at Milton, I have attended a single Asian Society meeting. It was my freshman year, and I was lured in by White Rabbit candies. Over the past year, I've occasionally regretted not having bought that famed navy hoodie with the \"A.S\" dragons on the chest. However, every time I realize I've been sitting only with other Asian Americans at the Forbes table, I am struck with guilt.\n\nJust the other day, my friend told me she was beginning to resent other Black people. Having just returned from a Black culture club meeting, she rattled off instances where she felt excluded by the club's very members. Though we've discussed before the dilemma of Milton's racially homogeneous friend groups, I never would've guessed that a culture club, of all places, could ever produce such ostracism. I shocked myself with how much I agreed with my friend's point: that too-friendly culture clubs are accomplishing the very opposite of their goals.\n\nAt a school like Milton, culture clubs exist to build community within minorities. \"The issue isn't that everyone in the club is friends with each other,\" says Asian Society co-head Adrienne Fung '25. \"That's like the best possible outcome.\" SAMENA co-head Sarya Refai '25 similarly describes her goals as, \"We are trying to become a friend group.\" If the objective of culture clubs is unity, of course we'll make friends within them. Though I've identified divides within student bodies of shared racial backgrounds, I realize that the friendly nature of culture clubs isn't necessarily to blame. But considering the inevitability of forming bonds within groups rooted in commonality, what's strange, now, is what I believe to be Milton's new wave of segregation.\n\n\"It's kind of like an indoctrination,\" began Tang co-head Andre Leung '25. \"Listen to what we do with family, what we eat, that kind of thing. Then we start talking commonalities and connections. But the first step is inherently an 'us' versus 'them' narrative.\" Though culture clubs could hypothetically prioritize resolving issues and divides within the group itself, their goals understandably lie beyond just affinity. So, now that clubs additionally aim to share their culture through greater student body integration, is a racial divide inevitable? Refai stresses the contradiction: \"I think it's really good to educate others about your culture. But I also never realized it could cause a divide [between people who aren't of that culture and those who are.\"\n\nCase in point: riots for bubble tea. Or, what was supposed to be our on-campus Mid-Autumn Festival celebration. \"That event really made us realize that attendance shouldn't be our only factor,\" Leung reflects. \"Obviously, if you take that as the only metric, we did great. But, obviously, we didn't feel great. We don't celebrate Mid-Autumn Festival with boba. We do it with mooncakes and we do it with lanterns. The problem is that, for people to come, we do things that cater to the wants of, let's say, white kids.\" It should be saddening that culture clubs are sacrificing tradition for attendance. \"How many people show up depends on how you advertise the event,\" confirms Latinx Association board member Montse Martinez '26. Culture clubs never did exist to unlock the wonders of some mystical world of exotica, and they never should. \"It's not like, 'hey, white people, come here, we'll teach you about mooncakes,\" as Tang co-head Kailin Shi '25 says.\n\nAs delighted students and teachers, we say \"a school like Milton\" to brand ourselves with our historically progressive views. When suddenly suspicious of this very same history, we say it to connote our long-existing predominant whiteness. So, at a school like Milton, I see this modern segregation—in and between racial groups—as especially wrong, considering how things have changed. Fung asks, \"As Milton becomes diverse, do culture clubs serve the purpose that they once did?\" Though attendance remains a priority, ASA co-head Tesani Teages '26 reminds us: \"Our main goal is to represent ourselves.\" So, as Milton's as diverse as ever, why are clubs compromising their own culture's traditions for the sake of an increasingly shrinking white population?\n\nTo those running the club and to those running away: I'm critiquing your intentions. Milton's rapid increase in what used to be \"minorities\" suggests we pivot from prioritizing affinity; in that regard, culture clubs have outgrown themselves. Today, intentions of integration are far more relevant. But it feels wrong to be pushed to the bleachers, staring in silence at the sort of ethnic spectacle at the other half of the gym. It feels wrong to show up, loudly, only when tradition is being compromised for your attendance. It doesn't hurt to wonder: can we sit with the discomfort of not being catered to? If the club has grown out of style, do we show up at all? Or, is this very talk of division and difference exactly what's making us more divided, what's making our differences so much clearer?"
  },
  {
    "title": "Absence Policy a Good Idea, but Neglects Needs of Student Athletes",
    "author": "Mason Porter '26",
    "text": "Did you know that you cannot—without any exceptions—miss more than five combined days per school year? Mrs. Sugrue's mention of the new five-day absence policy might have come as a shock to many during Upper School Programming a few weeks ago. Class II Dean and History teacher Joshua Furst agrees with the policy's implementation. \"This policy is a step in the right direction,\" Furst says. \"It holds students to the expectation to attend class.\" While this policy doesn't seem to interfere with most lifestyles, concerns could arise for certain students who recall missing more than five days in years past. Student athletes' sporting schedules and the policy clash, creating a difficult-to-resolve conflict.\n\nThe recruiting process for many sports requires far-away and lengthy tournaments and showcases. In years past, I have noticed some of my peers miss multiple days of class for sports without issue. This year, however, does not allow multiple lengthy tournaments to be an option. Outside of athletes, I think that a maximum of five absences is a mostly reasonable rule and an important part of following through with the commitment to being a student. In addition to falling behind academically, absences also create more work for teachers. I have not experienced a teacher unwilling to help me catch up on missed class material, yet I do not think it is fair to constantly miss class and create more time-consuming work for the teacher. Thus, class absences should be taken only out of pure necessity since they inflict an increasing workload on the student as well as the teacher.\n\nTherefore, I agree with the standard to which this policy holds students, but I think there are certain circumstances that leave students with no control. Tri-season varsity athlete Mary Quatrale '26 expressed her concern with her club hockey team schedule. \"I have a commitment to my team,\" Quatrale says. \"I have to follow through with that.\" She already foresees potential conflict: if her team makes nationals, she would not be able to go. Varsity athlete Brandon West '26 sees difficulty in maintaining the policy while navigating the recruitment process. If outside-of-school sports and recruiting interfere with the expectations and rules of being a student at Milton, what does this new policy mean for upperclassmen student-athletes? Is five days enough to fulfill the demanding number of sports events needed to get attention? This policy enforces that we are students before we are athletes. Asher Seelig '26, giving his opinion on the topic as a prospective collegiate baseball player, said, \"I think this rule is unfair to many athletes who may have to miss school to play at a college to achieve their dreams of playing sports at the collegiate level [to unlock] a great education.\" Like Mr. Furst, I think the policy reinforces the importance of attending class and being present for the full academic experience, but the 'no exceptions' part of the policy creates difficult circumstances for student-athletes. We cannot assume from the get-go that no student has extenuating circumstances. I assume that the policy was put in place due to a high absence rate in the previous years, but I think the policy would be just as effective if there was not a specific number of absences allowed, but instead a more in-depth review for each absence. By adding more school consideration to each absence, there would be an increase in the thought and care that students put into missing school. Overall, I think that class absences should not be taken lightly—rather, they should be deeply considered—but student-athletes and other special circumstances also should be considered in the policy."
  },
  {
    "title": "Trustees' Current Events Statement Does Not Promote Indifference",
    "author": "Jennifer Li '26 & Leah Li '26",
    "text": "In an email this June, the Milton Academy Board of Trustees announced that the school \"has decided not to issue institutional responses to external events in the future.\" The message raised a question: if a school's mission is educating its students, shouldn't such education extend to that of current events? The school intends to nurture global citizens aware of and willing to change their communities. The new statement may be interpreted as insensitive and an extension of the Milton \"bubble,\" promoting indifference to the world outside this small town; however, we believe that interpretation to be oversimplified. Though this policy may appear to blur the line between neutrality and indifference, it does not promote the latter. The absence of an administration response does not shut down the community's discourse on acknowledgement, but instead promotes it.\n\nTo understand the Board's justification for the change, we talked to the President of the Board of Trustees, Claire Hughes Johnson '90. The administrative team had mulled over this choice for a few years, Hughes Johnson explained, but new faces—including Upper School Principal Rachel Stone, Head of School Dr. Alixe Callen '88, and Chief Communications Officer Eileen Newman—helped revisit and resolve once-stagnant decisions such as this one. In the past, they said, declaring a stance on current events risked communicating to students the false idea that complex situations could have only one narrative. In their analysis, spoon-feeding such information restricts the development of students' own analysis and condemns their deviation from a standardized perspective. Conversely, maintaining neutrality fosters an environment for all opinions and promotes friendly debate; this way, the school can more effectively honor the students' responses and their freedom of inquiry. Referencing the Harkness tables, Hughes-Johnson led a moment of silence, a sure acknowledgement of the tragedy and opportunity for students to process it. During weekly Upper School Programmings, too, students often hear from long-term researchers and experts of fields pertaining to current global affairs. So long as the school continues to furnish these resources, the risk of ignorance amongst students will run low.\n\nAdditionally, Hughes-Johnson believes that Milton students are already quite interested in current events. As students three years into our Milton journey, we feel similarly. Just last week, many friends around us gathered with dorm-mates to watch the presidential debate, and references peppered lunch table conversations, the following day. Furthermore, online news sources, which the school grants students free access to, and social media—albeit less credible—allow students to stay informed. This new statement aligns with an ideology, developed in 1967 by the faculty committee of the University of Chicago, termed \"institutional neutrality,\" which mandates that schools abstain from speaking on a political and social issue unless it threatens the mission of the institution. The Kalven Report, an extended essay on this policy, articulates: \"The university is the home and sponsor of critics; it is not itself the critic.\"\n\nIndifference suggests a lack of care, but the fact that the administration takes great strides to promote discussion and understanding of global issues negates this fear of insensitivity. As an institution, Milton cares about enriching student discourse around provocative topics as much as it does current events; as this new statement satisfies both objectives, we perceive it as an extremely promising decision. In the absence of a prominent global event since the statement's release in the summer, students have not yet witnessed the policy in action under high stakes. With our present global disorder and the upcoming presidential election, however, we may not need to wait long."
  },
  {
    "title": "Our Community Lacks Proper Awareness for Disabilities",
    "author": "Elizabeth Sim '27",
    "text": "When it comes to disability, Milton students and faculty seem fundamentally unaware. Our lack of knowledge might not be coincidental: Milton is a private boarding school with a largely upper-class community whose privilege can induce blindness to the struggles of certain individuals. Conversely, in public schools, people develop an awareness as they pass by special education classrooms in the halls and see students who need more help than others. But an isolated background is no excuse for Milton's lack of addressing disabilities. There are two main issues upon which Milton fails to take action: inadequate school facilities for physical disabilities and a general lack of awareness among non-disabled members of the community.\n\nMilton is old; buildings like Straus Library are practically historical sites. Straus, in keeping its old-fashioned layout, lacks an accessible entrance for wheelchair users like Iko Lee '26. Because he can walk short distances, entering the building is not an impossibility, but he feels nonetheless that \"the campus wasn't built for [him].\" Should people, then, continue to preserve the old traditions at the expense of current community members? Construction might require thorough paperwork and even disassembly of the entire structure, but conserving the building to commemorate past centuries should not undermine the priorities of its current utility. Far from the historical treasure that Milton deems it, Straus is a blatant symbol of ignorance and neglect.\n\nEven though we have newer facilities that provide accessible entrance for disabled students, no one really seems to pay attention to their upkeep. Namely, the Quad-facing doors of the Schwarz Student Center have an automatic button that never works. Lee says he brought up the issue to a member of staff, but that no one ever resolved the situation. If Milton is so adamant about keeping historical spaces the way they are, the bare minimum the school can do is invest in existing accommodations that are meant to help people with physical disabilities. We cannot simply install a button and wash our hands of the job.\n\nAn important reason why these issues go ignored is that the student body is largely uneducated about the disabled community. Such ignorance engenders harm, whether intentionally or not. \"Just treat us like normal people,\" says Lee. He believes that, on a fundamental level, people at Milton don't know how to interact with someone who has a disability. \"The biggest thing is intrusive questions. Upon seeing me, people think, 'I can ask this question about you. I have a right to know what's going on with you.'\" Often, he hears these remarks from people whom he does not even know.\n\nTo spread awareness about disabilities, students and faculty need to hear from multiple voices as people's experiences can differ vastly. Last year, Jake Thibeault '22 delivered an empowering speech to the Upper School audience on his journey of recovering from a life-changing injury—his memorable and meaningful speech, wherein he articulated his \"no quit\" mindset, deeply resonated with the audience. However, it seems as if Milton has decided that his story is both the start and end of the conversation around disability. Thibeault's speech, on the contrary, is not the right place to stop. If Thibeault is the only individual through which students acquire knowledge about people with disabilities, his image is the only image that will come to mind when people think of a disabled person: inspiring, moving, and resilient. Such a perception, in reality, is nothing but dehumanizing.\n\nThis harmful view stems from distorted media portrayal of the disabled community. For example, an online poster might display a marathon-running amputee and a caption that reads, \"If she can do it, you can too!\" Disability rights activist Stella Young coined the term \"inspiration porn\" to state that such representations objectify disabled people's experiences into objects of inspiration. The media, in doing so, sets unrealistic standards for people with disabilities; to make people aware of the harm in portraying disabled people as inspirational saints, Milton does not have to reject stories such as Thibeault's. Rather, the school must educate students and faculty that disabled individuals do not share the same narrative. Everything builds upon awareness. By maintaining accessible facilities and encouraging discourse and awareness, Milton can do better. Its overwhelmingly disproportionate non-disabled population, too, needs to reevaluate the root of their judgment. Such a habit—not distorted representation—is what will bring people true inspiration."
  },
  {
    "title": "Basically No Upperclassmen We Know (Personally) Went to Glow Dance... Why?",
    "author": "Char Mone '25, Onur Gurol '25, Rebekah Manon Fabella '25",
    "text": "In the very beginning of my freshman year, I heard countless fables from juniors and seniors regarding the infamous Glow Dance. As these upperclassmen recounted, Glow Dance was one of the best events all year, and by far the most fun dance. Unfortunately, by my time, it had been discontinued, and I was disappointed that I would not be able to experience what the \"hype\" was all about. When Glow Dance returned my sophomore year, I was excited to attend and spent twenty minutes in the Stu decorating my t-shirt, only to leave with my friends after ten minutes. Glow Dance turned out to be overly crowded, humid, and far too loud to enjoy the presence of my friends. Moreover, the whole glow element was so understated that I didn't understand why the event had been so celebrated. So, when it came time for the event the following two years, I did not even consider attending. For underclassmen, Glow Dance can be a fun opportunity to meet people and interact with new faces; for upperclassmen, however, Glow Dance often inhibits conversation and connection. Especially for us seniors, who have only one year left, events like Quadival and Beatnik are better for fostering those deeper relationships that we spend all four years developing.\n\nI prefer the SAA's laid back events to their dances. When I envision plastic glow sticks being thrown around, and freshmen screaming along to \"Party in the U.S.A,\" not a single ounce of my body tells me, \"Onur, go to Glow Dance.\" After three years of attending these below-par school hosted dances, I knew I wouldn't be fooled this year. This isn't even a shot at Glow Dance anymore. When I hear the words \"school\" and \"dance\" - and even worse, \"glow\" - in the same sentence, I don't even bother asking my friends if they are attending. Now, I'm not saying it's a bad thing. I believe SAA still hosts good events, but after four years of maturation, my desire to attend Glow Dance has reached rock bottom. I prefer a more tranquil, laid-back event with the opportunity to converse with others, rather than a mosh pit packed with sweaty underclassmen. I don't think that Glow Dance is a bad event, but it is one that loses appeal as we progress throughout our time at Milton.\n\nAfter school that Friday, I went straight to the Stu to get a white t-shirt in every size. If SAA is giving away fairly good-quality cotton essentials for free, I'll go to all of their events! But when I say I was truly, truly considering checking out this whole Glow Dance thing, I'm telling the truth. For, ever since the beginning of this strange senior year—ever since I tripped over my pumps in the middle of the ACC at convocation, ever since that wretched SmugMug photographer hunted down me and my apparently racially-diverse friend group on the way to calc—I've been feeling nostalgic. Last Sunday, I went apple picking with my dorm; I watched a non-Ratatouille Pixar movie on the quad; I made s'mores for toddlers (people born in 2010)... I might get so desperate to cherish these moments that, despite the campus of $30 delivery fees, I might actually attend a club during club block! But, no matter my sentimentality, there's a reason I couldn't bring myself to prance around to Miley Cyrus with swarms of Wolcott underclassmen wearing neon-green bangles: here, you gotta know that there are things for us and there are things for the kids."
  },
  {
    "title": "Emmy Awards 2024: Celebrating Televisionary Excellence",
    "author": "Zifu Song '27",
    "text": "As the drums of autumn roll in, the curtains of television show awards roll up. On September 15, 2024, the 76th Primetime Emmy Awards were announced in Peacock Theater in Downtown Los Angeles, California. The Emmy Awards, or the Emmys, are prizes recognizing excellence in various areas of television and media entertainment—there are many Emmys throughout the year, covering an extensive range of nominees in the television industry. Yet, the Emmy Award ceremony, which receives the most attention, is usually the Primetime Emmys.\n\nThis year, the Primetime Emmy Awards were split into 25 categories, recognizing outstanding work in Drama Series, Comedy Series, Reality Competition Program, Talk Series, amongst others. Reassuringly, many popular television shows earned a fair share of awards. However, the media highlighted several shows for their exceptional performance.\n\nMany record-breaking shows made their mark in this year's Emmys. Shogun, an American historical drama created by Rachel Kondo and Justin Marks, became the first non-English language television series to receive 18 awards out of its 25 nominations. Globally, it set the record as the most-awarded single season of television in the history of the Award. Additionally, the comedy-drama television series Hacks won the Outstanding Comedy Series, the Netflix show Baby Reindeer won Outstanding Limited or Anthology Series, and The Traitors received the Outstanding Reality Competition Program Award. The late-night show television programs. The Daily Show on Comedy Central and Last Week Tonight with John Oliver on HBO claimed the positions of Outstanding Talk Series and Outstanding Scripted Variety Series, respectively. Among the community of TV enthusiasts, controversy regarding choices for the awards also rose. Many expressed dissatisfaction with the judgment of the Outstanding Talk Series award, as The Daily Show, a fan favorite, does not have a full-time host. On this topic, Jason Louie '25 expressed, \"The Daily Show is indeed a great program, but the concerns about not having one [full-time host] are justified. I think [the selection] might not be fair to the other nominees that are not only great shows but have the name of the host in the title.\" He highlights that the title of other contestants for the prize include the name of the full-time host, for instance, Jimmy Kimmel Live! The dispute raises questions about the criteria and standards of the famous Television Academy.\n\nHowever, the television community set the disagreements and controversies aside and enjoyed a truly heartwarming moment when actress Anna Sawai received her Outstanding Lead Actress in a Drama Series award. \"Mom. I love you. You are the reason I'm here. You showed me stoicism, and that's how I was able to portray Mariko,\" Anna Sawai said in tears with the gleaming, signature Emmys trophy in hand. She proceeded to dedicate her winning of the award to \"all the women who expect nothing and continue to be an example for everyone.\" Starting her acting career at the age of 11 in a Tokyo stage production of the musical Annie, Sawai persevered through her early days playing supporting roles for small productions. 2019 was a year of transition for Sawai, as she was cast in Hollywood productions Giri/Haji and Fast & Furious 9. Finally, in 2021, she was cast as the female lead in Shogun, leading to her great accomplishments along with the success of the show. With her first Emmy's in 2024, she became the first Asian actress to win a Primetime Emmy Award, receiving credit for her exceptional acting skills and diligent attitude. September has been a fruitful month for actors, directors, and creators in the television industry and has been a roller-coaster ride for TV lovers. With the 76th Emmys being broadcasted, stories of Emmy Award-winners are being shared and more actors are being recognized for their talent and dedication. Behind the scenes, each person who makes the brilliant shows we watch daily has their own story. As a saying goes, \"A minute of glory on stage requires ten years of practice off stage.\" It is great to look past a production's surface and appreciate entertainment professionals for not only their work, but also their character and morals."
  },
  {
    "title": "Parallel Practices Exhibition: Milton Faculty and Staff Shine",
    "author": "Georgia Isaac '25",
    "text": "Art has always been a window into the soul of a community, and this year's Faculty Art Exhibition is no exception. With media ranging from classical sculpture and painting to knitting and quilt-making, the exhibition is a testament to the variety of creative expression flourishing among Milton's faculty. Held in the bright, open space of the Kellner Art Commons, the exhibition invites viewers to explore a wide array of styles, techniques, and themes. The pieces offer an intimate glimpse into the personal worlds of the faculty artists. Stepping into the gallery, visitors are greeted by an eclectic mix of textures, colors, and forms. It's hard to know where to look first. To the right, a bronze sculpture that nearly appears to glow commands attention, and across from the entrance, detailed landscape paintings draw viewers in with their rich colors. Alongside the landscapes, an intricate, purple hand-knitted piece offers a stark but beautiful contrast. This variety in media ranges from traditional oil painting to textile arts like quilting and knitting. A metal sculpture, crafted by department teacher Martin McDermott, explores the intersection of human-made and natural forms. The jagged lines and raw form of the sculpture mimic nature—curving and depicting chaos in a way that seems almost alive. Garnet Ricks' landscape paintings bring a riot of color to the exhibition—the intricate detail of western rock faces and calm skies invite quiet reflection, evoking a sense of peace that lingers long after you've stepped away. Perhaps the most unexpected pieces in the exhibition are the textile works—hand-knitted installations and intricate quilts, which stand alongside the more traditional mediums of sculpture and painting. This medium, often considered part of the domestic or craft tradition, takes on new life in the context of fine art. From the gallery walls hangs Anne Kaufman's knitting piece, which forms a tapestry-like web that invites the viewer to engage with its layered intricacies. Molly Wong's quilts, meanwhile, contain small images and pastel colors, transforming a traditionally functional art form into something deeply expressive, creating a visual narrative of personal and collective history. Each stitch tells a story, connecting Wong's experiences to those of the viewer, and stimulating a sense of shared community.\n\nBeyond its displayed technical skill and aesthetic beauty, the Faculty Art Exhibition is ultimately about connection. It is a way for faculty members to share their inner worlds with their colleagues, students, and the wider community. The exhibition challenges traditional notions of art by placing everyday materials like yarn and fabric—on the same pedestal as paint and marble, expanding our understanding of what art can be. For many of the artists, this exhibition is not just a showcase of their work but a way to engage in dialogue with viewers, inviting them to interpret the layers of meaning embedded in each piece. The Faculty Art Exhibition will remain in the Art Commons through October 24, with gallery hours the same as those of Kellner, showing that Milton faculty and staff have much more than just their academic expertise to offer. This vibrant celebration of creativity that art is an essential part of our shared experience as a community, adding beauty to our lives and fostering connections in ways that go beyond words. Whether you are an art aficionado or just passing by, there is something here to inspire everyone in our community."
  },
  {
    "title": "Despite Low Turnout, Dorm Hop Builds Community Among Borders who Attended",
    "author": "Carmelle Jagaselvan '26",
    "text": "On Saturday, September 21st, SAA and the boarding community hosted Dorm Hop. This event, in which students can go to each dorm on campus to participate in challenges and games to win prizes, The turnout this year at Dorm Hop was around twenty students, as many participated in only the activities held in their own dorms, even if it was just enjoying the snacks. \"I didn't go to Dorm Hop, but when I was in Wolcott, there was a small group of freshmen and a few sophomores. It didn't look super popular,\" stated boarder Gustavo dos Reis '26. One reason for the smaller turnout was the rainy weather on the day of the event. SAA co-head Jason Yu '25 elaborated on the effect of the weather: \"Given that the event started in Hathaway and east campus, students on main campus were deterred from participating.\" Despite the challenging circumstances, students who participated reported having had fun. \"The overwhelming feedback from the small group that participated was that they enjoyed touring the dorms,\" said Yu. \"Compared to previous years, there were many more things to do at each dorm, even if it was just enjoy-ing the snacks.\" Christina King '27 explained, \"Dorm Hop helps with getting to know different people and getting to see how dorm cultures are different.\" The activities offered in the dorms this year included scavenger hunts, board games, black jack, Just Dance, and more. Dorm Hop is unique in that it is one of the only campus events that is hosted in the dorms and organized by the dorm monitors. \"Communication between dorm monitors and house heads was key. Because each dorm had its own set of plans (alongside its own personalities), it was crucial that the dorm monitors were efficient and creative,\" explained Boarding Monitor David Lee '25. Director of Student Activities Kelly Reiser and the SAA board were responsible for advertising the event to the student body, and preparation for the event was also an opportunity to build connections among boarding students. \"In Hathaway, a lot of the [students] decorated and got ready for Dorm Hop together, so that in itself was a bonding experience,\" explained another boarding monitor Chloe Li '25. The Student Activities Association promotes Dorm Hop as a way for day students to see what it is like to live in a dorm. \"We want Dorm Hop to be a fun way of breaking the divide between day and border,\" said SAA co-head Ella Metri '25. Still, the attendance of day students at Dorm Hop is often little to none. \"I didn't go to Dorm Hop,\" said Amara Prather '26. \"I had no idea that day students could go or were encouraged to go...I heard Dorm Hop and I assumed it's for boarders.\" SAA is hoping to shift this perspective and encourage more day students to attend in the future by hosting Dorm Hop on Friday night rather than Saturday night. One of the main takeaways from this year's Dorm Hop was its importance to new boarding students. \"It's a great way for new students to acclimate to campus,\" explained Millet's dorm monitor, Isa Torres '25, \"and it's a great way for [underclassmen] to make a diverse friend group.\" Goodwin dorm monitor Chase Judge '25 echoed this point: \"The main focus of Dorm Hop is to influence boarders to visit each other in their dorms. Although boarders live in separate dorms, Dorm Hop shows us that instead of being boarders in all different houses, we're really one big community.\""
  },
  {
    "title": "Is Thrifting Worth the Hype?",
    "author": "Adrienne Webb '26",
    "text": "What is \"sustainable fashion,\" and is it truly sustainable? These questions have recently been trending as shoppers press for changes in the fashion industry. Although the trend of shopping sustainably has newly emerged, the issues surrounding fashion and design have been prevalent for years. For instance, the anti-fur advocates that would interfere with designer runway shows are one example of efforts towards sustainable fashion in the past. Today, while we do not have as many riots targeted towards the fur industry, we do have social media.\n\nThe standard methods of sustainable fashion are often thrifting, repairing, and ethically sourcing. As social media has shown, thrifting has become less of a taboo and more of a fun activity. However, in the face of newfound interest, some have found that certain thrift stores like Goodwill have started to raise their prices. Anais Bricout '26, a self-described participant in thrifting, claims that she has noticed rising prices in the Buffalo Exchange franchise and believes that \"they sell clothes at a price you might expect if you bought it in-store.\" Despite these stores claiming the price increase is because of inflation and not the growing popularity, many ponder the question of how sustainable thrifting would be if it became as mainstream as shopping at Walmart or Target.\n\nAnother issue some thrifters encounter is resellers' buying used clothing or items then reselling them on apps like Depop, Vinted, or Poshmark for their benefit. Reselling is a well-known practice, but with the spike in interest for thrifted clothes it is a slap in the face for those who thrift out of necessity. Bricout raises the point that while resellers make good profit, they rob dependent thrifters of the clothes they need. This point reflects the voices of partisans who see thrifting as their regular shopping method, in the same way, some shop at fast fashion stores. Because thrifting has become more expensive, the welfare of those who rely on second-hand stores to stay clothed is a concern.\n\nThese concerns aren't to say that thrifting, as a practice, is bad, because it is still resourceful. Rue Tanzi '26, who also tries to contribute to sustainable fashion, does so by \"only buying things that [they] will wear and wearing it until they are permanently stained or have holes\" in hopes of reducing the amount of waste material that would be thrown away. They also bring up the point that even though they buy from brands like Urban Outfitters—a fast fashion company—they still try to incorporate a healthy balance between mainstream stores and small businesses to be as sustainable as they can. Young people are especially susceptible to falling for trends, and fast fashion is designed to utilize this flaw for to increase their profits. So, it makes sense that nobody, even those who are older, can't fully resist the urge to buy a shirt or two from stores like Zara or Forever 21. Even I am at fault from buying from Shein—yes I admit it; nobody is perfect when it comes to sustainability.\n\nNow, how can students cut down on their unsustainable habits? The Sustainability (SUS) board has introduced a few methods, including various clothing drives. The Milton Bazaar, in particular, is a student-run sale for used clothing. The Community Engagement board leaves bags around campus for students to put clothes they no longer use in them. Then, once all the clothes are collected, the items are all displayed on the quad for students to browse through and purchase at low prices. Linnea Engstrom, the Sustainability Coordinator states that, \"it was meant to be an opportunity for students to gain thrifting experience,\" as the leftover clothes are donated to other charities later. Engstrom stresses the issue of workers under fast fashion companies' being unethically worked and paid. She sets an example by maintaining her clothes for as long as possible and repairs them herself to cut down on the rate at which she throws clothing away.\n\nSustainability is an important practice that should be normalized to help society change its wasteful tendencies. Even with the pros and cons of having thrifting be a new obsession or trend, I personally view it as a more positive trend than constantly following new fashion rules and supporting fast fashion. So, when the time comes, try looking towards your local thrift stores or the Milton Bazaar before participating in fast fashion."
  },
  {
    "title": "Fall Arrives on Campus",
    "author": "Madeline Wu '27",
    "text": "September 22nd marked the official beginning of fall; while the summer warmth slowly dissipates into a crisp fall air, the community comes together to welcome the precious season. For some, fall serves as a time for new beginnings and transitions. Esme Cobb '28 exclaims that “there’s nothing more beautiful than fall. I just love the freshness of a new season. It is definitely a season of renewal and coziness.” Natalia Reichbach-Soto '27 elaborates, “Fall really just transitions me from summer to winter. It feels like a preparation season, but it is just as significant because it marks the start of school. It reminds me of new beginnings.”\n\nArguably one of the gorgeous aspects of fall is the changes in weather and environment. The leaves vary from breathtaking reds to glowing oranges and elicit joy across campus. Roman Casagrande '27 believes the trees look “so cool” and they “make [him] happy.” Mrs. Reardon, one of the librarians, echoes this sentiment. She notes, “The campus becomes so alive in the fall.” Her favorite tree “is right outside Ware Hall. [She] loves to watch it start green and, throughout the duration of a couple weeks, slowly progress to orange.”\n\nFurthermore, fall relieves New England of the sweltering summer heat. Euganie Smith '28 is “tired of all the heat… [she] is ready for it to cool down.” According to Abby Robson '27, the cooler weather also causes “everyone to start hanging out inside,” and it “really brings together a community.” Additionally, colder temperatures call for the return of many seasonal fashion staples. Hugh Kramer '27 remarks, “My favorite fall activity is wearing sweatshirts.” Traditionally, fall attire has consisted of cozy knit sweaters, sometimes even homemade. Reardon continues, “I’m a knitter so this weather makes me feel so cozy. I love to dig my materials out of the closet, sit by the fireplace, and make some socks or a sweater.” If someone is opting for a more trendy look, the recent old money, layered look has been gaining traction. Neutral beiges in conjunction with pops of warm tones such as cherry reds allow for a classic, effortlessly chic outfit. Another defining characteristic of fall are the quintessential spirited events, which stirs excitement amongst the community. The high attendance at sports games and dances exemplifies our hearty sense of spirit. Smith is especially eager to experience Milton's fall. She explains, “Since my brother has already attended Milton, I saw the community’s fall from afar. This year I can’t wait to participate in it, especially through SAA events like Glow Dance.” She also cannot wait to bond with her dorm in the fall. Reichbach-Soto furthers, “The back-to-school excitement really reminds me of fall. I love how we get into the fall spirit through Quadival, glow dance, and the fall festival.”\n\nAdditionally, fall brings beloved holidays: Halloween and Thanksgiving. Both of these celebrations serve as a time for a community to come together and experience the joys of fall together. James McEvoy '25 “[does] not know what [he] will be yet” for Halloween, “but [he] is looking forward to it!” Casagrande notes that Thanksgiving is his favorite season and he “likes the food and seeing his extended family.” Whether it be through the reminder of new beginnings, the changes in the atmosphere, or the celebratory spirit, this coming season serves as an opportunity to appreciate the changes around us and each others’ company. Happy fall, everyone!"
  },
  {
    "title": "Students Prepare for the Return of Fall Fashion",
    "author": "Merikukka Koeppel '26",
    "text": "Now that Escapism Season is rapidly approaching, Vogue writers claim that leopard print, suede, and burgundy are in. But is this true for the students within our community? Many students are leaning towards darker color palettes, as expected for the fall, but they’re also into more refined outfits such as sweaters and cardigans. Shoe-wise, sambas are still some of the most popular shoes on the market, although I believe we will see a drop in popularity as 2025 hits. On the other hand, boots are on the rise—not only cowboy boots but also riding boots, Frye boots, and suede boots. Still, I have yet to see someone wear boots to class. It seems to me that, most students in the US dress down for class, saving their cuter outfits on other occasions. For this reason, let's take two approaches to exploring the immediate future of fashion: looking at Vogue predictions and runway styles and reporting what students see themselves wearing.\n\nAccording to Glamour, the trending styles for this fall include boho, country-house chic, and denim on denim. Boho includes flowy fabrics such as Chloé blouses, maxi skirts, and neutral colors. Country-house chic combines quilts and clothing; think Scottish grandpa, but chic. This style is all over the runways of Chloé, Burberry, and Rabanne. Denim on denim is exactly how you would expect it to be. The commonality between all of these styles is that they pair well with boots, especially the riding-style boot, the most popular being the Frye boot. However, if you want a more laid-back look, I recommend slouchy options, such as the Isabel Marant Edrik boot or Free People's Triple Crown Over-the-Knee Boots. Of course, as we move into colder weather, coats become an essential part of one's wardrobe. Currently, the runways sport different styles of wool or fur jackets, including long, floor-length coats and pea coats with statement collars, such as stand-up and shirt collars. Trending accessories will likely consist of gloves, hats, and scarves in dark chocolate, burgundy, and leopard print. Jewelry will stay in the spotlight with chunky 80s-style earrings and long pendant necklaces, which can be styled in stacks or alone as signature pieces.\n\nIn my experience, students at school vaguely follow these trends, often opting to wear darker, more neutral shades. Some students I interviewed reported finding their fashion inspiration online, especially on Pinterest and TikTok. However, Amelie Devine '25 states that she gets “almost all of [her] outfit inspo from people watching.'' Devine reports appreciating the styles she witnesses in her hometown of Chicago, claiming that ''people are always dressed in cool and different ways.” Most interviewees describe wearing more neutral colors and generally limiting their wardrobes to basic staples. Devine says she is “trying to keep it simple. Lots of plain, staple pieces, like solid-colored crew necks and sweatshirts.” Chloe Yeo '26 says that she “always [goes] for the neutrals.” This reflects the persistence of the capsule wardrobe trend, which focuses on having a few basic garments to mix and match. However, students' inclinations toward neutrals does not mean that they are less trendy. Yeo says she is wearing “chunky, cable-knit cardigans…pointelle tops…Low-rise baggy jeans...and Frye boots,” reflecting the aforementioned trends.\n\nNo matter what Vogue says, students dress individually and as they wish to express themselves. Whether it is a dress for convocation, an outfit for class, or a weekend occasion, it is important that you wear what you want and feel comfortable in. As Yeo preaches, “know yourself.\" Do not wear something only because everyone else is wearing it, or because Vogue tells you to."
  },
  {
    "title": "New Season Brings Triumphs and Trials",
    "author": "Dennis Zhou '27",
    "text": "As the fall sports season kicks off, the athletic program has begun to show a mixture of successes and difficulties among its teams. Several teams have already shown promise in their performance, such as Boys Varsity Soccer, who have played each game with passion and resilience after placing first in the NEPSACS and ISL last year. The current record for Samba stands at 3-1-1 after matches against very tough teams. “Teams have taken us much more seriously this year because we were the best team in the league last year,” commented Boys Varsity player Emmanuel Cheyo '27. Yet even with this pressure, the team’s talent and determination have still reflected onto the scoreboard due to the “increase in talented players” on Samba, according to Cheyo. With a 6-0 win against Exeter and a 4-1 win against Lawrence, the boys are on track to continue being the best soccer team in the league.\n\nSimilar to the Samba Boys, Girls Varsity Soccer has shown tremendous talent and development at the start of this season. While the scoreboard currently stands at 1-1-1, returning players in the Wolfpack are optimistic about their playing this year. Girls Varsity player Shira Keitner '27 commented that in comparison to last year, they have been “playing more as a unit and switching the fields more,” and that their team has been “much more connected.” Girls Varsity player Edna Macuacua '25, who scored a hat-trick against Austin Prep, even states that “the Wolfpack is working the dream.” Girls Varsity Soccer is confident in their change in playstyle this year, and players interviewed have no doubt that they will perform as the season continues.\n\nVarsity Volleyball has had a smooth start to the season with a record currently standing at three wins and one loss. Varsity Volleyball player Katelyn Xue '26 says that in comparison to last year, “the team dynamic is really different.” This change in attitude can be attributed to the fact that of the 12 varsity players last year, only four returned to the team. Even so, the girls have shown dedication in their performance with wins of 3-1 against Dana Hall, Lawrence, and Thayer. The biggest difference from last season is that the team “is more focused on defending than attacking,” as Xue emphasized. As the season progresses, Varsity Volleyball hopes its team’s passion will continue to reflect on the scoreboard.\n\nAlthough many teams are already performing at their top, some still are developing towards that point, including the Boys Varsity Cross Country Team. The current record for the team stands at 1-5, losing a friendly and an ISL meet. Referring to a meet, Gratian Ting '25 said that the loss was because “many of the faster runners weren’t there.” In comparison to last season, Ting commented that “the team felt more competitive last year, while this year everyone is more laid back.” However, the change isn’t necessarily for the worse, as there has been less stress and fewer injuries, keeping the team spirit greater than ever. Boys Cross Country aims to get over this bumpy start and perform at meets as time passes.\n\nIn short, the fall sports season at Milton is turning out to be a mix of achievements and challenges. Teams like Boys and Girls Varsity Soccer and Varsity Volleyball are showing strong performances and growth, building on last year's successes. Meanwhile, Boys Varsity Cross Country, despite a shaky start, maintains a positive team spirit that athletes hope will bring future improvements and growth."
  },
  {
    "title": "The North Stars of Milton: How Captains Lead Teams to Success",
    "author": "Avaneesh Siruvuri '26",
    "text": "Captains at Milton act as teammates, friends, and, in a sense, family. But what makes an honorable captain? Taking a look at some of the greatest leaders in sports of all time, certain trends emerge consistently. Tom Brady, a hall-of-fame football quarterback, was quoted saying “[he is] not a person who defends [himself] very often,” rather he “let[s] [his] actions speak for himself.” This is the hallmark of captainship, leading by example, both on and off the field. In the classroom, in the gym, and even during team dinners, our captains at Milton strive to be capable leaders, pushing their teammates to the best of their abilities. Leadership styles differ from captain to captain, but one essential skill of being a leader is creating team unity. Track captain John Valerio '26 expressed that he demonstrates “[his] energetic personality” even in high-pressure moments because he knows “nerves can run high.” Valerio went on to state, “as long as I am keeping my teammates calm and collected, then I know that I am doing my job right.” Whether at an ISL championship, a regular season meet, or just practice, captains are the guiding “north star” for team morale and confidence.\n\nOur upperclassmen leaders not only perform at a high level but also help the progression of younger players. Matthew Ramos '27, an attacker on Boys Varsity Lacrosse, believes that his captains “make [him] better through competition and brotherhood.” In a sense, sports are similar to entering a battle. In team sports, one enters the battle with their teammates, and their family. The camaraderie expressed in Milton's captains not only displays maturity but also impact. However, captainship is not all smooth sailing. “Having the title of being a ‘captain’ has brought some unexpected pressure to being a leader,” said Reagan Vaughn '26, Girls Varsity Basketball captain. There is a reason why teams vote on their captain: it takes hard work and dedication. Being a leader is like walking across a thin sheet of ice between fun and work. Valerio feels that “keeping things fun and most importantly keeping everybody on the team healthy” are essential goals of a leader. At the end of the day, winning is great, but as Valerio expressed, the physical and mental health of student-athletes takes the number one priority. Especially in such a high-pressure environment to achieve both athletically and academically, captains must care for our health both on and off the field.\n\nAs mentioned earlier, captains serve as the north star for the team, and the goals that they set transpire to the aspiration of the team. Katelyn Xue '26, captain of Varsity Volleyball, has a goal to “be back-to-back ISL champions as well as get past the first round of NEPSAC,” through “work[ing] every day to improve both [her] skills and communication.” While captains may be seen as “better,” this is not true in any regard. Varsity Football captain and quarterback Qur’an McNeill '26 “believe[s] [he] matured tremendously.” Captains have just as much to prove and learn as anyone else; in fact, one does not have to be a leader to be a captain. The qualities of being a leader and a role model exist within all of us; it is how we express those qualities that matter. Through fostering an environment of learning, fun, and competitiveness, sports captains hold themselves and their teammates to a high standard— one which we should all aspire to meet. By scoring the game-winning goal or picking up trash on the sideline, you, too, can exercise the values and practices of a captain."
  },
  {
    "title": "Transitions Made for a Bittersweet Start to My Last Year",
    "author": "Tolu Adeyfa '26",
    "text": "This year’s Transitions program, being my last, was bittersweet for me. I have experienced this program for three of my four high school years— first as a mentee, then as a mentor. However, this year's program felt most special to me compared to years past. I coordinated with my other mentors, developed strong relationships with each of my mentees, and connected well with all of the new students who attended the Black affinity spaces. Speaking from experience, the program contributes to the success of new students of color within the community; observing my mentees reminds me once again of the value of this program.\n\nAfter three years of experiencing the activities created to build community within the student of color population, I believe the most effective part of Transitions is the affinity space meetings. As a mentee, I attended these spaces to form relationships with the students whose identifiers were similar to mine. As a mentor, leading the affinities helped introduce me to the new Black students, forming a strong support system as early as possible. I was able to develop an especially strong connection with my mentees this year; amongst themselves, too, lasting friendships have bloomed. I believe that the recent addition of Mentor Tea Time into the Transitions schedule played a huge role in the deep relationships I was able to make with my mentees. The two mentees whom I conversed with during Tea Time are the freshmen I maintain the closest relationship with. One of those freshmen is Amanee Dixon '27 from Newark, New Jersey. She boards in Hathaway, and despite the distance (as my dorm Robbins is perched on main campus), I see her every day, whether that be passing by in the hallway or eating together in Forbes. In reflecting on her experience during Transitions, Amanee stated that she’s “definitely friends with Jolie,” another mentee in her home group, highlighting the lasting connections that Transitions breeds. She also recognized the value of the program, noting that “Transitions is so important for students of color and easily one of the reasons [she] is friends with the people [she’s] friends with now and why [she] got so comfortable at Milton.” I can relate directly to her sentiment because I met some of my closest friends through my Transitions three years ago. Coming to Milton, I was extremely shy, but the company of other new students of color brought me out of my shell and shaped me into who I am today. I can trace many successes of my time at Milton back to parts of Transitions that prepared me well.\n\nSimilar to Amanee, Osiris Niven '27 from Norton, Massachusetts, who boards in Forbes, expressed gratitude for the Transitions program and how it prepared him well for his next years at a predominately white institution. Osiris said that he believes the program “gave [students] the opportunity to truly connect, creating strong bonds.” He acknowledged the many successes of Transitions, such as how home groups “[are] not separated by grade” and thus allow friendships to “[expand] … across classes.” With the school year underway, I’ve noticed many students from my home group spending time together in Forbes and at the weekend activities. Not only that, but I’ve seen my mentees embrace other students from Transitions and expand their friend circles to include students from New Student Orientation. I can see the influence Transitions has had on mentees and mentors alike, having gone through the program from both perspectives. The lessons I learned from Transitions are things I’m going to take with me beyond Milton."
  },
  {
    "title": "Faculty Spotlight: To Michael Kassatly, Pickleball is for All",
    "author": "Benjamin Wang '27",
    "text": "For Michael Kassatly, longtime math teacher better known as “Ksat,” taking on the role of Intramural Pickleball Coach this year has been an exciting new challenge. It is also an extension of his philosophy as an educator: fostering inclusivity, facilitating personal growth, and helping students find a sense of belonging in learning—whether in the classroom or on the court.\n\nKassatly’s journey to Milton Academy reflects a deep-rooted curiosity about the world and a genuine passion for education. Growing up in Worcester and attending Westborough Public High School, Kassatly wrestled the choice “between math, physics, computer science, philosophy, and music” for his college major. Ultimately, he decided on math, as “it was the path of least resistance.” Kassatly's intellectual curiosity led him to consider a career in education. He spent five years teaching at Loomis Chaffee before going to graduate school at UCLA, where he rekindled his passion for teaching. “I missed the classroom,” Kassatly admitted. After a brief stint at Belmont Hill, he started teaching at Milton in the fall of 2006.\n\nKassatly believes that everyone can learn mathematics, a philosophy he brings to his math classroom. “Math is misunderstood in so many ways,” he explained. “I believe in creating an inclusive environment [where students are] responsible for the success of the class, like in a sports team.” In his new role as the intramural pickleball coach, Kassatly has brought this same spirit to the court. “Pickleball has been really fun to coach this year,” he said. The game, a mix of tennis, badminton, and ping pong, is accessible to players of all skill levels. That easy access aligns with his educational philosophy of inclusion and individualized teaching.\n\nMuch like his journey to becoming a math teacher, Kassatly’s introduction to pickleball was somewhat unexpected. He first encountered the sport through his father, who played regularly with a group of retirement friends. “They were definitely way too competitive, given their modest ability,” he laughed. As a tennis player, Kassatly was initially frustrated to see “so many tennis courts being replaced by pickleball courts.” But over time, Kassatly grew to appreciate the sport and its crossover with tennis, as one's skills transfer well between tennis and pickleball. He concurs, “The crossover between pickleball and tennis is huge, as it is with squash and other racquet sports.”\n\nPickleball’s rapid rise in popularity is no surprise to Kassatly, who sees the sport’s social, easy-to-learn nature as its greatest strength. Kassatly believes that the “low barrier to entry” makes it so popular—students can pick up a paddle and start having fun right away. Compared to intramural tennis in the years before, pickleball doesn’t need the mastering of serves or hitting deep strokes, as the court is smaller and one grip can do it all. He explained that “[having fun] from the very start” makes pickleball “a social sport.” This aspect of the sport has drawn students of all abilities to the team, creating a tight-knit group that plays for the love of the game.\n\nRather than focusing on competition, Kassatly's coaching approach emphasizes fun, teamwork, and inclusivity. He recommended that students not get too competitive “because it takes some of the fun away.” He stated that “it’s optimal to be simultaneously competitive with your play but chill with your vibe. That’s what I think most of us are going for this season.” As the intramural pickleball team meets after school on Tuesdays, Wednesdays, and Thursdays, Kassatly leads students through drills, matches, and casual play. Like in his math classroom, he intends to create an environment where students feel comfortable learning at their own pace, and everyone can enjoy themselves and see their progress.\n\nThe students have responded enthusiastically to Kassatly’s call for the sport. Many have even discovered a new passion. “It’s great to see students who’ve never played before pick it up so quickly and have fun. That’s the best part,” Kassatly reacted. “There’s a lot of laughter on the court, a lot of interaction,” commented pickleball athlete Jae Son '25. “It’s a very social sport, and I think that’s why so many of us (students) are gravitating toward it.” Furthermore, Leo Xie '27 said, “I love playing tennis in the spring, and the addition of pickleball in the fall allows me to try a similar yet new and fun sport.” Looking to the future, Kassatly is excited about the growth of pickleball at Milton. He expects more cooperation with tennis teams: “I echo the sentiment of many other tennis players on and off campus, including our esteemed Varsity coaches, who believe there is a wonderful opportunity for the two sports to support each other.”"
  },
  {
    "title": "Latinos, Where Are We?",
    "author": "Gustavo dos Reis '26",
    "text": "I am a Latino Class II student from South America, specifically São Paulo, Brazil. But for 16 years these identifiers did not mean much to me. Back home, I had nothing like Hispanic/Latinx Heritage Month, and no one labeled themselves as Latinx. However, it all changed when I stepped on this campus in 2022. At Milton, because not everyone looked like me, I had no choice but to recognize my identity as a South American. And don’t get me wrong: this recognition came with lots of celebration and warm welcomes. Now, as I enter junior year, I’m not sure if this feeling persists. Yes, half of our student body is composed of people of color. Yes, our school has a Latin-American culture club. And yes, we often host Latin-American celebrations and hear from Latin-American speakers. But do we truly have Latin-American representation on campus?\n\nI know. My question contradicts all the yes-es above. But it does not come from nowhere. In the past years, every time I walked into a Latin American celebration or club meeting on campus, those rooms were relatively empty. “Where are we?” I constantly asked myself. Though I knew we existed on this campus, I slowly lost that initial attachment to the Latin-American community. For most of my second year on campus, I ignored those feelings. Instead of obsessing over that issue, I attached myself to the international community on campus. Yet, it would always come back to me, even when I felt a sense of belonging in different spaces. During international affinity meetings, the lack of Latinos in the room reminded me of our underrepresentation on campus. But what could I possibly do?\n\nIn September and October, my worries always lessened. After all, Milton celebrated Hispanic/Latinx Heritage Month with assemblies and a few events here and there. Those two months were the ones when I felt the closest to the Latinx community. Suddenly, despite our small number, we all seemed to come out of our shells and celebrate our cultures. But as soon as October ended, my feelings returned. “Where are we?” was all I asked. As a junior, I can finally say I have learned to cope with these feelings. I am sure, however, that we have not solved the issue. Every year, I still get excited for our two-month heritage celebrations. I often connect with other Latin-American and Hispanic students on campus. But it’s not enough. Because learning to cope with those feelings also meant understanding the Milton Academy context, I realized that there are not many South Americans on campus. We are underrepresented: how many Latinos make up the 50% people of color who attend our school? This year will be my third experiencing the Hispanic/Latinx Heritage Month in the states. I want to celebrate. But I also want to take this time to address our underrepresentation on campus. To my fellow Latin American students and faculty, even when we all show up, we are still missing a lot. But we must keep showing up; our unity is also our strength.\n\nTo the administration, I hope we can work together to increase the Latinx representation on campus. How can we reach more Latin American applicants? How can we collaborate with the Admissions Office? If Milton wants to pride itself on a student body with 52% people of color, we must diversify that 52%. Where do Latinos fall in that half? Why do Latinos still have to ask “Where are we?” when we enter spaces on campus? I know it’s no easy job, and I’m okay with the possibility that I might not see huge changes by the time I graduate. All I desire, however, is engagement—this time, not only from the Latin-American population on campus but also from the adult leadership. Let’s make sure that, in the near future, when a Latino on campus asks “Where are we?”, silence does not follow their question."
  },
  {
    "title": "Welcome to the First Column from the Head Monitors!",
    "author": "JP and Ari (Head Monitors)",
    "text": "Hey, everyone! Welcome to our first column, a special space for the head monitors, secretary, and the rest of the SGA to share information and communicate with you, the student body! We truly believe an informed student body is an empowered student body - we are here for you and to make sure your voices are included in our efforts. If you have any ideas or suggestions, never hesitate to reach out. You can always catch us in the halls, send us a message, or DM us.This column is your go-to place for updates, announcements, and insights into what's happening around our school. In this column, you’ll have access to Coco’s notes, and you might hear from one of the Class Representatives, or the Boarding and Day Monitors. However, no matter what, we promise it will always be well worth your time.\n\nWhat Have We Been Up To?\nOne of our major focuses right now is the ratification of the SGA constitution. We firmly believe that with a strong framework, we will serve you better and make our operations smooth for the coming generations. We mean BUSINESS; if a post falls vacant, the constitution makes it possible for the position to be filled quickly.\n\nWe've also been listening to your feedback about wanting more activities in the Stu during the school day. We hear you! First things first: the Pacman machine that premiered last Friday was a huge success. We're actively brainstorming new ideas of events and activities you'd like to see and would love your input: pep rallies or movies in the Stu —whatever! Your input means a lot, and we want to make our environment as inviting and interactive as possible.\n\nBest, JP and Ari, Head Monitors\n\nSGA meeting 9/26 Notes\n1. Incorporating Stan More Often\n• Explore ways to integrate Stan (our school mascot) into our activities more frequently.\n2. Friday Morning Music\n• Bring music to Friday mornings to enhance school spirit and create a positive atmosphere.\n3. Coco’s Corner\n• Introduce a section for publishing meeting notes, “Coco’s Corner.”\n• Each cycle, a pair of SGA members will contribute a short write-up for the column to keep the student body informed.\n4. Fall Festival\n• The SGA will endorse and hype up the Fall Festival scheduled for October 25.\n5. Freshman Representative Elections\n• Upcoming elections for freshman representatives will be taking place soon.\n• Voting Oct 11 - decision by Oct 17"
  },
  {
    "title": "You're hot!",
    "author": "Sissi Ma '26",
    "text": "ACROSS\n1 2007 #1 Alicia Keys album\n6 \"Moby-Dick\" captain\n10 Up to the task\n14 Ship's load\n15 Hammer or sickle\n16 At liberty, in Berlin\n17 With 55A, romance reality TV\n20 Hosp. areas\n21 Golden State sch.\n22 Word that always brings a smile?\n23 Dance Moms studio\n24 Oslo's river\n25 He's single; with 43A romance reality TV\n29 Laugh syllable\n32 External\n33 Gymnast Mary ___ Retton\n34 Let go\n35 Leave out\n36 Ill-suited\n38 Picnic pests\n39 Text chuckles\n40 Tater ___\n41 Sound\n42 Before, poetically\n43 Romantic saying; with 25A romance reality TV\n46 In ___ land\n47 Business attire\n48 Underage drinker's item\n51 Shakespeare, for one\n52 Oldest international sch. in Beijing\n55 With 17A, romance reality TV\n58 TV's talking horse\n59 Spa supplies\n60 When bats fly\n61 Affirmative votes\n62 Reverse\n63 You can see right through it\nDOWN\n1 Case for a dermatologist\n2 German river\n3 Annoys\n4 Ripen\n5 Made of standard units\n6 Send with an email\n7 Lanford Wilson's \"The ___ Baltimore\"\n8 \"___ b?\": \"Choose one\"\n9 Power failure\n10 Following\n11 Cracker topper\n12 Many August babies\n13 German \"a\"\n18 \"Back in Black\" band\n19 \"Moonstruck\" star\n23 Helps in a heist\n24 Cockeyed\n25 \"A Confederacy of Dunces\" author John Kennedy ___\n26 It's good for a laugh\n27 One of twelve in a Scrabble set\n28 Fill with joy\n29 Language of India\n30 \"Our Father which ___ heaven ...\"\n31 Do a lawn job\n34 \"It's not my ___!\"\n36 \"See?!\"\n37 Exploding star\n41 Putting up with\n43 Café au ___\n44 Mom's answer to \"Why?\"\n45 Ride the waves\n46 West Yorkshire city\n48 Low-cost home loan org.\n49 Well-ventilated\n50 Joint with a cap\n51 Hairless\n52 Swenson of \"Benson\"\n53 The 12 of the Pac-12: Abbr.\n54 Puts money (on)\n56 Cacophony\n57 Be under the weather"
  }
]

