{
    "11-22": [
    {
      "title": "Ritmo Leader \"Disgusted\" by \"Oversexualization\" of Pep Rally Performance",
      "author": "Shira Fish-Keitner '27, Contributing Writer",
      "text": "Gabriella Brown '25, head of Ritmo, Milton's Latinx Dance group, thinks that the Milton community has \"normalized\" both the verbal sexualization of women, as well as the blatant disrespect for a cultural dance, as illustrated at the November 8th Pep Rally.\nAccording to Remy Henderson '27, who was among the crowd of students watching the Pep Rally performance, Ritmo received multiple disrespectful and oversexualizing remarks at Ritmo's recent performance at the pep rally. The five-minute upbeat dance consisted of 20 girls performing various moves like intricate footwork, winding (derived from Jamaica) and various organized formations.\nAccording to Henderson, the \"two rowdy boys one row behind her \"were nearly begging [the girls performing in] Ritmo to keep it coming and 'don't stop.\" The boys commentary disrupted Henderson's experience, turning it into an uncomfortable one. Brown said she was \"disgusted by the community's response to a cultural performance.\" She added that, \"Back at school in New York, we have a community that embraces various cultures and celebrates one another.\" \"Nasty and surprised\" is how Brown felt after facing the chatter about the dance after the Pep Rally. While the dance sparked many debates around campus between those like Dennis Zhou '27, who argued that age of the audience was not appropriate for the specific dances performed, and those like Sasha Bahia '28 and Chloe McLaughlin '28, who believed that the dance was simply a form of expression, both students condemned the remarks that Brown, Henderson, and others felt objectified and oversexualized the dancers.\nWhen asked if she was aware of the incident, Dr. Vanessa Cohen Gibbons, Milton's Chief Equity and Inclusion Officer, said \"absolutely not...I'm sort of a few rings removed from that type of response.\" However, Cohen Gibbons understands the repercussions of such comments, stating \"I think that there is a tendency...where there's sort of like a fluctuation between objectification and judgment...when you have people who identify as girls and women. How they dress their bodies, how they move their bodies is treated somewhat as a consumable product.\"\nUpper School Principal Rachel Stone emphasized that she had not been aware of any disruptive audience behavior and she \"didn't see anybody standing up and catcalling [the dancers,\" but if specific names of students were reported, then consequences could include discussions and potential letters sent home. Beyond an immediate response, Cohen Gibbons believes that \"large-scale awareness building around how [such comments] tie in with misogyny and sexism is important, paired with interpersonal connections such as those from \"men who work in dorms talking to boys who live in dorms about language like that, or coaches on teams. As for the students impacted by the remarks, Cohen Gibbons believes that they should be assured \"that is absolutely not ok, and not a reflection of their value, or worth, or anything that they deserve.\"\nBrown stated that dancing is a cultural form of expression, and the dancers moves personified the Latinx aspect of Ritmo and were derived from traditions in Nigeria and Jamaica. By shaming the dancers, many male audience members also made fun of the cultural aspects to the dance, like winding. \"Dancing is something that should make you feel energized and happy, not nasty.\" Cohen Gibbons urges members of the community to understand \"that how different cultures, even within the United States, move and dress their bodies... is not all going to be aligned with one individual's point of view, based on where they come from.\"\nBrown considered the process for choreographing the dances at Ritmo to be a \"fun and collaborative experience\" that unites various students from different classes and allows them to express themselves fully and let loose after an exhausting academic day. She went on to talk about the long and exhausting process of creating these dances, and how much effort each dancer put into the performance. In support, Stone asserted that, \"Milton is not an institution that would censor a form of expression,\" signifying her stance that those who made inappropriate remarks were the problem, and not the dance or its choreography.\n\"Shout out to Ritmo,\" Cohen Gibbons says, \"they're incredible, they've been incredible for a long time, and they deserve nothing but the admiration of the student body and the adult population here.\""
    },
    {
      "title": "Election Response: Low Attendance at Processing Spaces",
      "author": "Eli Berk & Emilia Raviola '26, News Editors, Adair Johnson '27, News Writer",
      "text": "On Wednesday, November 6, 2024, at 4:34 a.m., Donald J. Trump won the 2024 election to become the 47th president of the United States of America. Across the nation, people rejoiced. People wept. And here, in one of the bluest counties in one of the bluest states in the nation, students visited the DEIJ office to process.\nThroughout the week, DEIJ, the History Department, and the Counseling Center offered five different dialogue spaces for civil discourse and three different processing spaces for emotional reflection. However, \"not very many people came [to the History Department spaces],\" according to History & Social Sciences Department Chair Joshua Emmott. According to Upper & Middle School Equity & Inclusion Program Manager Yann Kumin, approximately five to ten students and a similar number of adults attended each of the dialogue spaces. \"The fact that they were attended fulfills my expectation of those spaces,\" he said, explaining that neither he nor DEIJ as a whole tends to have very specific expectations of spaces such as these in terms of attendance or engagement. Upper School Principal Rachel Stone, who also held processing spaces, said \"the two spaces I offered were quiet-no students in the first one and two students in the second.\"\nEmmott expressed that he thought this phenomenon is a reflection of the speaker's method of presenting, it also reflects how the Milton community refuses to listen to speakers unless they present their ideas in a specific way that engages the students.\n\"I think students thought the spaces were unnecessary because election results are usually digested on a personal level,\" said Valerie Gu '25. For HT Xue '26 as well, \"It just didn't really occur to me to go to the spaces]. I had conversations with my friends in the dorm and elsewhere.\"\nSome on campus feel that Milton has a ways to go in terms of recognizing conservative opinions. \"There's a conversation [about] conservative voices on campus feeling like they are not able to speak out for fear of social ostracization,\" said Xue '26. \"That's a campus conversation that we should be having as well.\"\n\"Do I think Milton welcomes and encourages diverse opinions? No,\" said Performing Arts faculty member Darlene Anastas, calling the school \"a hostile place for conservatives during election cycles.\" Anastas believes that the best way to improve would be to \"provide more diverse speakers to better prepare students for ideas and concepts which may not align with the Milton majority but are widely accepted beyond our campus borders.\"\nDEIJ has held processing spaces including several following the October 7, 2023 attacks on the Nova Music Festival, surrounding the ensuing conflict, and after attorney and writer Harvey Silverglate, invited to speak at the 2022 Seminar Day, said the N-word.\n\"I think Milton's response overall has been pretty strong,\" said Rhys Adams '26, who attended multiple History dialogue spaces and one DEIJ processing space. \"The processing spaces were very abundant and very well considered,\" said Xue.\n\"We knew before the year started that the election was going to be something that our student body was going to need to or want to talk about,\" explained Director of Equity and Inclusion Dr. Melissa Roja Lawlor. \"No matter who won, there was going to be a need to process after. [There are] big feelings on both sides,\" she added. According to one of her all school emails, the processing spaces were designed to \"pause and talk about something that might be really personal\"\nThe History Department took a different approach to its election programming. \"Last spring... we spent a lot of time talking about the upcoming presidential election and how to teach the election in our classes,\" explained History and Social Sciences Department Chair Joshua Emmott. \"We thought that as a department, we should be talking about political issues... in a way that was informative.\" This thought inspired the department to create dialogue spaces; as Emmott elaborated, \"there was a lot of speculation that... it could be a couple of days after the election before we understood who the winner was... The History department thought it would be useful to have drop-in sessions.\"\nLawlor contrasted the History sessions with those run by DEIJ, explaining that emotional processing was \"different than... talk[ing] about [the] electoral college and logistics, so we separated the two spaces.\" Emmott explained how he views the History Department's role, stating that \"it's fine to freak out if your candidate doesn't win... it's also important to be able to understand exactly in a constitutional, political sense, what does a Trump victory mean for the country, for the economy, for foreign policy?\"\n\"I am grateful that Milton is so committed to building infrastructure to support community differences and needs,\" concluded Stone. \"I have been impressed with our robust programming as well as with the care and attention the faculty continue to give to our students.\""
    },
    {
      "title": "Heyburn Speaker Fails to Engage Students",
      "author": "Darby Yang '27, News Writer",
      "text": "On November 7, while some students immersed themselves in the 2024 Heyburn Speaker's lecture, many others stared aimlessly at the ACC walls, situated themselves in the gaps between bleacher rows, or even nodded off.\nThis year's speaker, Jonathan Schroeder '99, discussed how he had discovered the lost narrative of John S. Jacobs, a story which White abolitionists had once significantly altered or even silenced entirely. However, not all of the U.S. History, Class I, and Class II students present were keen on paying attention to Schroeder's lecture.\nConsequently, the event intended to pay homage to Henry R. Heyburn '39's love of history, social science, and government-wound up striking a somewhat soporific tone for some students.\n\"It made the majority of the audience fall asleep,\" observed Erin Breva '27. Head Monitor Ariam Gebresilassie '25 stated that \"after some 20 or 30 minutes in, a lot of students were kind of nodding off or going on their phones.\"\nEli Berk '26 noted the lack of student attention as well, commenting that \"the students put in no effort.\"\nSchroeder's speech contained \"interesting information, but it's a tough skill to process interesting information in a terrible package,\" Berk explained. Vivienne Mockenhaupt '27, a U.S. History student, echoed this sentiment. She conceded that, while she felt that \"[Shroeder's] content was fascinating, his speaking was less engaging than some of the other speakers we've had, which made people less inclined to actually listen.\" Mockenhaupt added that even though this phenomenon is a reflection of the speaker's method of presenting, it also reflects how the Milton community refuses to listen to speakers unless they present their ideas in a specific way that engages the students.\n\"I think there was a lack of engagement from both sides: the presenter and the audience,\" said Associate Dean of Students André Heard. \"I think we as a community have a great deal of work to do when it comes to finding the value in what's being presented and then motivating ourselves to engage with it.\"\nIn addition to the general lack of engagement, two student interviewees cited extra discontent since club blocks were canceled for the speaker.\n\"Having speakers during club blocks is very detrimental to the student club organizations,\" explained Breva. She added a plea to the administration: \"please, no more speakers during club blocks.\"\nBerk expressed a similar opinion. He believes that \"students feel that their club time is totally disrespected, and that's not a good feeling, especially when [club time is being used to go sit down in the ACC.\" As a result, he believes that going in, the students would already \"rather be somewhere else.\"\nHowever, Class I and Class II might not have needed to attend at all. In past years, only the U.S. History students were required to participate, and this year, it appears a miscommunication occurred between the faculty.\nHistory teacher and Class II Dean Joshua Furst recalled being confused about the required presence of the juniors. \"Somewhere on one of my documents that was shared with me, it indicated Class 1 and II are expected at this assembly. I verified with [Emmott]: Class II is expected at this assembly. That's what I've been told, and that's where I went.\"\nOn the other hand, Emmott explained that he was not informed that the two classes were required to go until it was too late for him to correct the situation.\nRegardless of whether the students were supposed to be there, Emmott believes there was another inherent problem with the event this year: the location. \"The ACC is a hard place for anyone to deliver a big speech,\" he explained. \"We just don't have the space that we need.\"\nHowever, while all seven students interviewed expressed negative opinions on the Heyburn Speaker, having such student criticism may be inevitable, according to Furst.\n\"To try to teach to all of you (the student body) [is] sometimes a Herculean task,\" he stated. \"Our job as teachers is to make people question, so even... [if] 99% of kids are left going 'that was silly, that was dumb, I didn't like that, but there's one kid left who's sitting there going 'but wait, I have more questions, that, to me, is a successful moment.\""
    },
    {
      "title": "Giving Thanks",
      "author": "Editorial Board",
      "text": "As we approach fall break and Thanksgiving, our thoughts turn to gratitude. Many of us crowd around a large dinner table covered in a hearty, nutritious meal and give thanks. While we may spend time with our families reflecting upon our privilege, we must also respect and value the resources provided by Milton.\nThis past Friday, November 15, the Community Engagement Board hosted the Hunger Awareness Event. At this annual event, students and faculty are asked to draw a ticket that determines their food options for lunch - 55% receive rice, representing the low income population; 30% receive rice and beans, representing the middle income population; and 15% receive the standard Forbes meal, representing the high income population. Aramark donates the approximately $2,000 it saves to Partners in Health and the Greater Boston Food Bank. On Friday morning, the Community Engagement Board detailed the purpose of the event: to encourage reflections on our privileges, and to give back to our community.\nHowever, their message was not universally internalized. Ms. Geyling-Moore, director of our Community Engagement Program, estimated that at least one hundred students opted out of taking a ticket; one hundred students significantly reduced donations to Partners in Health and the Greater Boston Food Bank. Furthermore, even those who did take tickets tended to completely disregard the event's reflective nature: openly DoorDashing Chipotle, purchasing chicken tenders from the Snack Bar, even attempting to deceive the Community Engagement Board by sneaking into the high income line, no matter what ticket they've pulled.\nFor just one day, why are we somehow unable to empathize? Why do we feel as if we're above empathy? From this bubble, are we truly too far removed from these issues that supposedly permeate our very community? The Community Engagement Board reported that the Milton Food Pantry serves 167 Milton families - is this not \"close enough to home\" to make tangible the so clearly pervasive issue of food insecurity?\nOur dismissive attitude towards the bounty of food available on campus is one of the greatest examples of our collective ignorance. We must realize that our daily access to three meals is a gift, not an inherent or universal privilege. Our dining hall supports a well-balanced, nutritious diet, for students with a wide range of dietary needs, as well as a diversity demonstrated through the vegan, vegetarian, and gluten-free options available during each meal. And, whether they prepare bulgogi, chilaquiles, or shawarma, our staff clearly aims to cultivate a menu beyond typical European-American cuisine. The range of dishes communicates care and attention from the dining hall staff to all students. It is this care that transforms our dining hall from a means to grab a meal to a vibrant place of gathering. As the Hunger Awareness Event attempted to explain, these privileges are not extended to a great part of our world.\nTo grow out of ignorance, we must first recognize our privilege. On this campus, at times we somehow struggle to appreciate its blatant abundance and excess. To achieve the ultimate challenge of simple recognition and gratitude, we must contemplate the context. However, though we can educate ourselves on other adolescents' nutritional circumstances, especially in under-privileged areas, we must follow this introspection by taking advantage of our undeniable ability to aid those inside and outside of the often detached nature of our campus. Our resolve is to achieve action that will transform mere appreciation to tangible impact. If it starts at the Milton level, with 100% participation in the Hunger Awareness Event, it must extend into things like volunteering hours at local food banks, food drives, and soup kitchens. Ultimately, it must transform personal gratitude into pervasive compassion. For, what is Thanksgiving without empathy?"
    },
    {
      "title": "New SWA Leadership Launches Wellness Initiatives",
      "author": "Gideon Weiss '28, News Writer",
      "text": "With ten new members and Jack Butterworth '26, Naya Johannessen '25, and Charlotte Weinstein '26 as new heads, the Student Wellness Association (SWA), an organization aimed at improving the physical and mental health of Milton students, has started in a new direction this year. The heads say they plan to \"lighten the year with a series of projects and events including a Gratitude Tree, a weekly newsletter, and interviews with Milton Counseling Staff.\"\nThe SWA has encouraged students to write on paper leaves, reflecting on privileges for which they are thankful and acknowledging their fellow classmates' good deeds. All of these leaves will then be hung up on a Gratitude Tree in the Student Center. \"I know that I feel good when someone acknowledges the work that I do, and hopefully this tree will help with that,\" says Weinstein. Devan Agrawal '25 is eager to create leaves as a chance to reflect. \"There is a lot to be thankful for [due to] the opportunities we are afforded,\" he commented.\nIn addition, the club produces weekly newsletters advising members of the Milton community about techniques to improve their well-being. Content of the newsletters ranges from suggestions for how to improve study habits to advice on combating cyberbullying. One recent newsletter focused on the negative effects of certain habits. In \"Screen Time Week,\" an article pointed out that excessive screen usage can \"disrupt your sleep schedule\" and \"decrease your attention time.\" The writer proposed methods for how to implement alternative behaviors. One tip was to \"set limits for yourself\" with tools such as \"Opal, Forest, or Apple's screen time settings.\"\nThe SWA both emails newsletters to students and hands them out after Upper School Meetings. Additionally, to increase engagement, the SWA often couples the newsletters with raffles containing prizes such as Amazon gift cards to anyone who can demonstrate what they learned. Jack McDonell '28 appreciated a study tip recommending that \"for every 20 minutes you spend studying, you should spend 20 seconds looking out a window... I have started using it and I think that it has improved my productivity.\"\nAnother project for the SWA this year is to make a directory for the Counseling Center and conduct informal interviews with counselors in the hope of making them more approachable to students. Counselors provide an outlet for people to discuss their problems and to be heard, a service that around half of Milton students use at some point during their school experience, according to Upper School counselor and faculty advisor John Lee. He claims that \"the secret sauce to counseling is the relationship that a counselor and students form.\" Funny, personal interviews can help create these connections and lessen the barrier between a student and counseling, he added.\nLee says that the SWA is unique in that it is student-led. Because of this, Agrawal finds wellness information coming from the SWA more relatable and easier to digest than from the Counseling Center because he and the club's members are \"all the same age going through high school.\"\nLee concludes, \"the level of commitment and work [the leaders] put into [the SWA] is what makes the difference this is an example of a group that is putting in a lot of work.\""
    },
    {
      "title": "JSU Shabbat Dinner Celebrates and Educates",
      "author": "Cynthia Lee '28, News Writer",
      "text": "On November 8, the Jewish Student Union hosted a Shabbat dinner, open to all members of the community. Shabbat, a Jewish celebration and day of rest, occurs on the seventh day of every week. Jewish people celebrate Shabbat in various ways, and a common way is to have dinner with family members or close friends. However, according to JSU head Lily Goldstone '25, \"[people] don't need to know everything about Judaism...[or even] be Jewish to celebrate Shabbat as a community.\" The JSU hosted this dinner with the goals of helping students and families to celebrate together and educating the community about this tradition.\nMany moving parts came together to make this dinner happen. Goldstone stated that \"pamphlets were made so people could follow along... and [in order to] make sure people could do the blessings.\" The DEIJ and Jewish parent affinity group also took part in the preparation: JSU head Juni Brewster '25 mentioned that the \"parent affinity group organized a lot of [the event by figuring out the structure.\" Goldstone added that \"DEIJ helped set up and find [catering), which was very helpful.\"\nJSU faculty advisor David Nurenberg stated that \"Shabbat dinner [at Milton] hasn't been hosted since at least the 1980s, so it was wonderful that we had about 50 people come.\" Goldstone expressed that \"the event went great, and we had a lot of people there, along with food services that provided a full catered meal, and everything was set up nicely. There were also some traditions for Shabbat.\" Not only did the dinner serve as a safe space for everyone to bond as a community, there were also many traditions that Jewish people shared, aiming to encourage a sense of belonging for everyone there.\nLily Goldstone '25 The Shabbat dinner aimed to teach about Jewish culture. \"It was a great way for me, as someone who is not Jewish, to learn more about Shabbat and to celebrate with mom, who is Jewish,\" shared Elly Ash '26. Brewster also stated that \"people came to the event with the right attitude, and were willing to learn about this celebration.\" Gideon Weiss '28 felt that \"the event was beautifully run. The Shabbat service touched upon the most important aspects, such as songs and prayers. Additionally, [JSU] provided brief explanations about each part of the service for anyone who didn't know.\" The event was meaningful for Jewish people within the Milton community to \"perform Shabbat traditions that [they] do every week at home with [others], according to Weiss. He believes that \"there are many people in the community that pride themselves on their Jewish identity, and... there is something so special about being together with others... and sharing... traditions.\" Parent Affinity Group Head David Goldstone elaborated: \"Shabbat is a core part of Jewish practice... and it is critical that Milton students (especially boarding students) have a way to celebrate Shabbat in a warm, social, and fun environment.\" JSU head Eliana Soiffer '25 stated that \"services, prayers, and believing in God are not the only important parts of religion to her. \"Gathering together and making friendships along with strong family bonds\" are just as important, she shared.\nOne takeaway people got from the experience, according to Brewster, was \"learning the values of community, having food together, celebrating each other, and that the sense of togetherness can be universally practiced.\" The idea of the Shabbat dinner, according to Ash, was to allow \"people [to] take away the knowledge of the traditions of Shabbat, whether it be the traditions of another Jewish family, or the traditions of a culture you are not familiar with.\" Soiffer stated that \"having Shabbat dinner is essential and brings [people together at the end of the week... [giving] people a sense of community.\" Nurenberg hopes \"that this event begins an annual tradition. Going off to boarding school shouldn't mean having to give up cultural traditions that are important to your identity, so I think the more support the school can provide for students of all cultural backgrounds to maintain their traditions, the better.\""
    },
    {
      "title": "Gotcha Aims to Build Community And School Spirit Across Classes",
      "author": "Margot Murphy-Hara '28, News Writer",
      "text": "Monday, November 18 marked the beginning of Gotcha, the campus-wide game of tag. The rules of engagement are simple: each player is assigned a target to tag, each tag leads to a new target, and the object of the game is to collect as many tags as possible. The student with the most tags on Friday wins. Though the premise of Gotcha is straightforward, its planners put careful thought into its implementation. Student leaders and school administrators revisit Gotcha rules annually: this year, head monitors Ariam Gebresilassie '25 and JP Giglio '25 worked closely with Dean of Students José Ruiz around planning and rollout. Ruiz characterized his role as ensuring that \"[the] health and safety of the student body is taken into account when establishing the rules of the game.\" The head monitors also meet with department heads to determine whether students can tag out their targets in different locations. Gotcha has multiple no-tag zones, including the street, sidewalks, classrooms, bathrooms, dorms, and the library. Off-limits locations also include the Pritzker Science Center and the FMC, a new addition to the no-tag list. Failure to comply with the rules of the game can result in disqualification of the offender. In fact, the game can be canceled completely if enough students do not adhere to the rules. Ruiz recalled, \"once in my twelve years at Milton, I have had to shut the game down early.\"\nProgramming Club's website and phone application, which assigns targets to each player, is vital to Gotcha's operation. Co-head Dione Cheung '25 described the responsibilities of Programming Club to include \"[making] sure that the website and the app....run smoothly and [fixing] a few bugs here and there.\" Though changes to the app were minimal this year, Cheung hopes in the future to \"make slight changes to streamline the tag-out process\" and to \"add some creative aspects to the app.\"\nAs in past years, students eagerly anticipated the start of Gotcha week. Molly Sheehan '25 stated, \"I think overall, Gotcha is positive. It's... a way to get to know people and other grades.\" Rhia Patel '26 fondly remembered past Gotchas, particularly \"running around and seeing [her] friends' funny costumes.\" However, she also recalled \"getting sabotaged by a classmate and being tagged out on the first day.\"\nSome teachers, too, note the game's benefits. English teacher Kristine Palmero recalls, \"one of my most cherished memories from my first year teaching here is watching my students go to great lengths to swap clothes, take long routes to get back to their dorm, or have their friends form a protective circle around them, so they could make it to a safe spot. When it's played safely and kindly, this all-school game is one of my favorite events at Milton.\" Math teacher Peter Kahn noted the energy and excitement Gotcha creates, as well as the added bonus that \"most of my students come to class early for those few days.\"\nDuring Gotcha week, some teachers and administrators worry about safety. At the start of the week, history teacher Michael Lou urged students to use caution, particularly around \"the banister at the top of the stairs in Wigglesworth, [as] it is not that tall and one can easily flip over if [their] momentum is strong enough!\" Ruiz noted that he has had to take calls \"from local members of the Milton community who call to complain about the ways our students are not respecting traffic flow.\" Kahn acknowledged ongoing efforts to prioritize safety, noting that the school has \"done a pretty good job of making it safer, especially around Centre Street.\"\nSome argue that Class IV students and those new to Milton may be at a disadvantage in the game. Julia Refai '28 said that as a freshman, she is worried about \"not knowing [her target].\" Similarly, Lou stated, \"I wish there could be a way to even out the playing field a bit to help more Class IV stay in the game longer.\" However, Gebresilassie suggested that Class IV students view Gotcha as an opportunity: \"take it as a chance to meet new people, have fun, and embrace the friendly competition. It's not something to stress over it's all about creating fun memories and enjoying this unique school-wide experience.\"\nAccording to Gebresilassie, \"what's really exciting about Gotcha is seeing everyone get involved whether it's forming alliances, outsmarting their targets, or just enjoying the energy of the game. It's a great way to bring the Milton community together, connect across grades, and build school spirit.\""
    },
    {
      "title": "Six Students Tackle Tough Math at Harvard/MIT Tournament",
      "author": "Anaïs Bricout '26, News Writer",
      "text": "On November 9, shortly after getting off the waitlist, six Milton Academy students attended the Harvard/MIT Math Tournament hosted at Harvard University. In the team round, Milton placed 50th out of around 120 teams. The tournament lasted one day but will also take place at MIT on a separate day this coming February. Established in 1998, this competition provides middle and high school students across the globe with an opportunity to expand their understanding and deepen their passion for math.\nDevan Agrawal '25, captain of the math team and head of the Math Club, joined the club in his freshman year and has been engaged ever since. He stated that HMMT was a \"fun opportunity to take a day to see really hard math problems.\" To Agrawal, the tournament was especially interesting for its range and its depth; the fact that people got to \"fly in from all across the world,\" like one team from Poland, made it such a \"cool tournament.\" Similarly, despite the fact that \"[he] [didn't] think [he] personally [was] the strongest in competition math, it was a super fun experience\" for Eli Berk '26, one of the competitors. He highlighted that \"everyone was super excited to be there.\"\nThere were a total of four rounds: two individual rounds, one team round in which the Milton team of six students worked together on one set of problems, and the final round, called the Guts round. The Guts round was structured with sets of three problems; once a team submitted one set, they would receive the next three problems for twelve sets. \"That [round] [was] about strategy of speed versus accuracy,\" Agrawal explained. He emphasized that, over time, the problems \"[got] harder and worth more...so you want to get to the last ones but not overly rush.\" Berk detailed the experience as well: it was \"scored live in front of [us], and once [we] turn[ed] in a set of questions, [we] [couldn't] go back.\" His strategy was \"to do them all and make sure [he was] comfortable with [his] answer.\"\nBerk is \"personally... proud\" of Milton's 50th place finish in the team round, given that HMMT was a \"super tough competition [with] super difficult questions.\" Also, he underscored that, in the Guts round, Milton tied one team from Nobles and beat the other, which is \"what [he] care[s] about.\" According to Kitty Lai '26, the team \"was not expecting anything, so [attending the tournament] was just for fun.\" She added, \"most of the questions were hard, [but] there were easy ones,\" which she linked to an amelioration of disappointment.\nAlthough Lai describes herself as \"not a very math contest person,\" she nevertheless found that it was \"such an honor to [have been] competing with [her teammates].\" At the end of the day, \"they taught me a lot during the contest, and they were really supportive,\" she said. Furthermore, she called the tournament \"kind of stressful\" but overall \"so much better than she initially thought it would be.\"\nBerk observed that HMMT, as a tournament, is \"really the only thing like it,\" and he would \"definitely do it again\" as it was a \"super cool experience.\" Indeed, Lai also remarked that this competition \"changed [her] mindset.\" At first, \"I kind of rejected the idea of joining. I'll definitely go next time, but I'll know to do more preparation beforehand to do my best in the contest,\" she stated."
    },
    {
      "title": "Education Thrives Through Technology",
      "author": "Charles He '26, Opinion Writer",
      "text": "As education continually evolves, technology has become an integral part of our daily lives. Thus, I've been thinking a lot about what technology has done for education, and I genuinely believe that it has made learning more convenient and interactive. Take the introduction of smartboards, for example. They have revolutionized teaching by allowing teachers to show and map out 3D models of math equations, historical sites in history, and cell biology, all of which they can turn, flip, and rotate in real time. This visual and interactive approach makes complex concepts much easier for students to understand, instead of their trying to comprehend sloppy, quickly drawn diagrams on a chalkboard.\nOf course, there are risks associated with incorporating technology into the classroom. Some students can and often do get distracted by games or social media if the teacher isn't directly looking at their screens behind them. But I believe that the benefits far outweigh the risks. Technology serves as a powerful tool for students who are passionate about learning; after all, it's all about the student's desire to learn that propels them forward. Others may try to move or motivate you, but in the end, the distance you traveled will only be as far as the steps you took yourself. No amount of technology-or lack thereof-can change a student's innate motivation. Thus, those who are eager to learn will use these tools to propel their learning, while those who aren't will eventually get sidetracked regardless of the resources available.\nBut at a school like Milton, I believe that most students recognize the incredible opportunities they're given opportunities that many other kids around the world can't even imagine to exist. This awareness creates a learning environment where students are more likely to use technology responsibly and effectively. With specific tools like Kahoot, for example, the entire class can come together and create study guides and quizzes, whether it's for biology or history. This collaboration that technology brings also creates social bonds between students and makes them more likely to hold each other accountable with responsible use of technology, especially if the teacher oversees the whole thing. Another case of effective technology use is in subjects like English. Collaborative documents can be a gamechanger. Imagine an entire class contributing to an essay or study guide: diverse ideas flow all across the page. Yes, of course there will be discrepancies in the amount of work each student contributes that's almost inevitable in any large-scale group projects. But the end goal is to elevate everyone's understanding and performance; those who are less engaged might initially be \"dragged along\" by the group, but witnessing their peers' dedication can motivate them to step up and do their part. It's like seeing someone achieve something remarkable on social media-it can motivate others to pursue their own goals.\nOf course, not all technology is equally beneficial in the classrooms. Devices like smartphones are definitely more of a distraction than a learning tool (hence why phone hotels or baskets exist). The key point is finding a balance that maximizes the advantages that technology brings while minimizing the potential for distraction. After all, technology doesn't just make learning easier; it amplifies our existing abilities, and, in some ways, our true nature. Just like power, which either reveals the best or the worst in people. Thus, simply having technology in the classroom isn't enough. At Milton, we have a unique opportunity to set an example of how to effectively integrate these tools into our learning environment to make technology even more beneficial. There are specific strategies we can and need to implement to find that balance.\nOne way is by providing training sessions for both teachers and students annually on how to use educational technologies, whether it is apps or websites. This will ensure that everyone is on the same page and can make the most out of all the tools available. These training sessions will be especially important for technologies like AI. Demystifying AI would allow us to use it effectively rather than fear it. By understanding its capabilities and limitations, we can leverage AI tools for personalized learning experiences, such as adaptive learning programs that will adjust based on how you're learning, or even AI-driven programs that provide instant feedback on assignments. The possibilities are endless.\nLastly, integrating technology into our classrooms is not just a luxury-it's a necessity if we want to keep up with the outside world. And here at Milton, we have a student body that's eager to learn and make the most of all the opportunities presented. So why fear it? If we embrace technology, the only thing that'll be holding us back is our imagination."
    },
    {
      "title": "Stop Replacing Club Blocks",
      "author": "Mason Porter '26, Opinion Writer",
      "text": "For the past two weeks, Club Blocks 2 and 3 have not met due to conflicting programming. For students involved in clubs, this time is crucial for making progress and building a community of club members. For students without commitments during Club Blocks 2 and 3, this time is free to get academic work done. While most clubs are set to meet once a week, time throughout the year is limited-therefore every allotted meeting time is precious to the development and running of the club. In my experience with clubs, I find that you tend to get out what you put in. Having been part of both very and slightly-less active clubs, I believe the defining characteristic of a club's involvement is the amount of time spent together.\nCo-head of Entrepreneurship Club Axel Portnoy '25 expresses his high ambitions for the year met with difficulty due to the lack of meeting time: \"The possibility of creating a DECA branch at Milton was a possibility at the beginning of the year,\" Portnoy reflects, \"but that opportunity began to close since the funding would require more time and organization than given.\" With Fall and Winter breaks on the horizon, Club Blocks 2 and 3 have only four meetings left in 2024. I am a part of the club as well, serving as a board member of the Entrepreneurship Club, and have observed the shift from the ambitious outlook for the year during first club meetings to now still being in early phases of those goals. It has also been hard to recruit and engage new club members since the meeting times have been so inconsistent. Balancing board meetings and new member meetings-both pivotal to making progress as a club-has been difficult. The hour-long Upper School Programming stands equally important to the hour-long period for Club Block 2 and 3, yet one should not take priority over the other. Attending All School Programming usually means sitting in one place and being an attentive audience for an hour. I believe that certain programming and speakers that take place during USP block are critical to the unique education that Milton offers. At the same time, I think that Club Block is an important time for students to engage in the community and put their said unique education into work. I strongly believe that Club Block time should be protected and not replaced. I notice that when there is only one hour long speaker or presentation in a week, students have better focus than when when there is an additional one added.\nThe inconsistent club schedule this year affects new students, particularly freshman hoping to get involved. Isabella Vander Elst '28 says that she finds the fluctuating schedule around club blocks very difficult. She speaks to her own challenge with trying to be a part of clubs and groups of people on campus as directly correlated to the schedule changes. Getting involved early is an important part to a successful start to being a student at Milton-not only is it important for the current club leaders to meet in order to make progress, but these clubs are also not possible without underclassmen involvement as future club leaders. Jessie Shi '28 speaks of her initial experience with joining clubs and groups that meet during the Club Block 2 and 3 period as \"fairly negative.\"\nClub blocks need to be prioritized throughout the rest of the year to enable students to reach their full potential through collaboration and community involvement."
    },
    {
      "title": "Economy, Economy, Economy: Why do Americans Care about the Economy More than any Other Issue?",
      "author": "Anton Badushov '26, Opinion Writer",
      "text": "The economy ranked as the most important issue concerning voters in the 2024 election, according to NBC, Gallup, and CBS News. With many other pressing matters regarding healthcare access, unemployment scares, and gun laws, to name a few, why do citizens care about their bread costing a little extra? For the average American, the economy shapes more than grocery prices; it impacts job opportunities and wages, drives public policies defining social norms, and affects inflation and taxes. When the cost of essentials rises, its impact ripples across all levels of society, altering how people work, save, and plan for the future. Even beyond personal finances, the state of the economy affects the national conversation on what policies are right and wrong, what institutions are trusted, and the confidence in one's country. See, the economy is essentially a network of relationships built on mutual expectations; every time you interact with another person, you practice trust. This trust ensures the survival of institutions and relationships. Education happens because students trust their teachers, businesses function because employees trust their bosses, and the government works only when people trust it.\nLook at the Great Depression; not just the market's performance but also a widespread loss of trust sent the economy plummeting. When investors feared that the market would collapse, they rushed to withdraw all their money, which in turn furthered the crash. Similarly, during the 2008 financial crisis, as banks and lenders failed, Americans lost trust in major financial institutions, leading to massive bailouts and sweeping reforms to restore confidence in the system. Today, with popular trust in government at near-historic lows, according to the Pew Research Center, it is no wonder why the economy is on voters' minds. During worse economic times, American trust in the government has been shown to plummet. Amid the period in the 1970s known as \"stagflation,\" where both high inflation and uneven economic growth were present, Americans saw a dramatic drop in their trust in government. This sentiment is projected today when Americans doubt that their elected leaders can manage economic challenges like inflation, rising interest rates, and wage stagnation. For voters, concerns over inflation and cost of living are not just a statistic but a real harbinger of stress in their lives. In 2000, according to the New York Times, the price of eggs was $1.75 (adjusted for inflation); in 2024, that cost has jumped to over $5.00 in some areas, according to the United Nations' World Population Review. This difference might seem small, but for a single mother struggling to make ends meet, it can make the difference between fresh food and week-old leftovers for dinner or nothing at all.\nThis paycheck-to-paycheck living that many Americans find themselves in isn't the American Dream. The American Dream promises that regardless of your identity or socioeconomic status, you can succeed in a society that offers chances for upward mobility. However, economic stresses have been running those chances dry. According to the University of Oxford's Our World in Data project, over 20% of the nation's net income is earned by (if income)/ held by (if wealth) the top 1%, and the bottom 50% only holds around 8%. This economic disparity between the rich and the poor is continuing to be exacerbated year after year, and is the main cause of the death of the American Dream. The belief that one can move up the socioeconomic ladder is no longer apparent in American society. The income inequality of the top 1% is prime evidence of the destruction of the American Dream, leading Americans to obsess over these economic problems. The feeling that the system is \"unfair\" amplifies voter concern about economic issues. The American Dream, a harbinger of hope for many being torn down, is the ultimate straw that Americans need to force a change in the economy.\nUltimately, the economy matters to voters because it is foundational to nearly every aspect of life. While issues like healthcare, climate change, and social justice should seem to be prioritized over economic concerns, the reality is that the economy determines people's ability to care about these other issues. When people feel financially secure, they have more mental and emotional capacity to fight other social issues. For many Americans, a stable and prosperous economy represents more than just money; it reflects the promise of a better life and a future worth fighting for."
    },
    {
      "title": "What is Behind Social Groups?",
      "author": "Elizabeth de Ramel '26, Opinion Writer",
      "text": "Does your social group depend on the sport you choose? The brand you wear? Even the color of your skin? I have sensed an unspoken divide that splits students into certain groups, epitomized by the social norms that are central to our student center, that is so normalized, that we seldom devote thought to it. While it isn't something that is explicitly stated in our student handbook, anyone who spends time on campus knows that this divide exists. I can't help but wonder about the elements that \"dictate\" these social norms. But when you stop and look a bit closer, the patterns are clear.\nAlthough I've been at this school for only three years, I've noticed that while academics are certainly important, our social identity seems to be just as crucial. While renowned for its prestigious status, this school also holds a unique social reputation. For instance, the phrase DSG \"Day Student Girls/Boys\", more commonly shortened to \"DSG\" or \"DSB,\" is ubiquitous. According to Urban Dictionary, an informal online dictionary, this term is often used to describe students who are \"generally obnoxious... and fabulously attractive,\" a label that's said to be \"really only heard at or around Milton Academy.\" This definition from 2005 highlights the way social identities contribute to the dynamics of school culture, stereotypes, and humor. Given this definition was posted nearly two decades ago, I wanted to explore whether this still holds true for others. Lila Cobb '25 states: \"I think [the label] DSG was more prominent in the past, but recently, not so much.\" She suggests that while the DSG term is still recognized, Milton students no longer use it as commonly as they used to.\nDSG is one of the many prominent \"groups\" at Milton. But what, exactly, brings them together? Boarder Qu'ran Mcneil '26 remarked that \"the majority of friend groups are defined by race, revealing the role of racial identity in influencing social circles. Indeed, shared culture and heritage can incite many conversations and strengthen existing bonds. Especially for international boarders, these relationships can alleviate homesickness and provide a nice taste of home.\nBut race seems not to be the only ball in the court, with Cobb, a senior boarding student highlighting another dynamic, stating: \"Sports has a lot of influence... you end up spending a lot of time with those people... it gives you an immediate common interest.\" This common interest not only fosters close connections where athletes train, compete, and socialize daily but also naturally creates a social circle. Day student Larissa Rubiez '26 sums her perceived factors as \"race... sports... and social class,\" adding the latter. Thus, the development of these groups can be due to shared experiences, cultural backgrounds, and even societal norms, all of which foster an easier environment for students to connect with others.\nLike many schools, the social landscape here is shaped by several factors that students thoughtlessly navigate daily. I am still left wondering: are our social groups as evident at other reputable schools? Or is it just as specific, as institutional, as Urban Dictionary labeled it? Could these cliques and divisions that seem to define our social experience be a product of Milton's own particular blend of culture and history, or is this complex web of connections something that exists in every high-achieving curriculum? This unspoken divide that exists on campus, whether it stems from cultural experiences, or common interests, influences where students feel and belong. Perhaps these social dynamics are a natural consequence of adolescence itself-an attempt to find identity and belonging in an environment that overflows with competition and expectation."
    },
    {
      "title": "Stop! Take That Phone Out of the Trash...",
      "author": "Elizabeth Sim '27, Opinion Writer",
      "text": "Milton claims to recycle its electronic waste responsibly through various organizations. Academy Technology Services (ATS) enlists a recycling center called Data Recycling to pick up damaged or end-of-life Milton-owned equipment. Furthermore, a truck from the Junkluggers, a sustainable junk removal company, arrives on campus once a year during Earth Week to collect electronics from students, faculty, and staff. Last year, Junkluggers left the school with nearly an entire truckload of electronics. However, students still must be more mindful with their electronic waste disposal.\nIn a survey of 64 students, 60% of the 25 students who reported previously discarded their devices had thrown them in bins meant for general waste, recycling, or trash. However, electronic waste, or e-waste for short, does not belong in regular bins and causes serious consequences if disposed of improperly.\nIf a student throws away their phone along with plastic wrappers and food scraps, the phone will end up in the landfill instead of a responsible recycling center. Putting a device in a regular recycling bin is no better, if not worse: e-waste and other recycling waste such as plastic bottles and cans undergo different recycling processes. If an electronic device hides among other recyclable trash in the bin, the entire bag of recyclables will have to join the landfill. According to the World Health Organization (WHO), e-waste releases numerous toxic substances such as mercury and arsenic. These chemicals not only contaminate the site but also spread to nearby communities. Consequently, people living in these communities are put at risk of asthma; and exposure to air contaminants puts pregnant women at risk of stillbirth.\nFor students on campus, one excellent way to responsibly dispose of e-waste is to keep any unwanted equipment until April, when the Junkluggers truck comes to collect people's electronics during Earth Week. The company then sorts through and processes the waste. Although the event proved to be successful last year, Sustainability Coordinator Linnea Engstrom believes that \"on campus, we don't collect enough to fill up an entire truck. Much of the e-waste the truck picks up comes from Milton townspeople-not just members of Milton Academy.\"\nIf a student needs to dispose of their device immediately and cannot wait around, they should find a center that properly recycles e-waste: for instance, the Best Buy website reports that most of its stores can recycle up to three items daily per household, and Goodwill lists many home electronics, including computers, that they accept in usable condition. Students should do their research carefully: according to Electronic Recyclers International, some waste companies will end up shipping them to dumps in developing countries like Ghana, Pakistan, and Mexico, where people can make money by burning or taking apart the devices. E-waste threatens workers who eventually handle them, leading to detrimental health problems the WHO also explains that the pervasive contaminants disrupt children's nervous system growth. Ecowatch reports that Junkluggers, the company which Milton partners with annually for Earth Week, takes responsible e-waste handling one step further by prioritizing donating usable devices before recycling the rest-donating repurposes one's e-waste without the risk of ending up in developing countries instead.\nSome argue that the profits of e-waste processing industries in these countries outweigh their cost; workers will benefit financially, so companies should continue to send their e-waste over. However, workers' exposure to harsh chemicals pose threats to their health, especially in children, whose bodies are still developing. We need to understand that our irresponsible decisions power this harmful industry, intentionally or not. In our position of privilege, we cannot neglect the livelihood of those half the world away.\nJust because Earth Week occurs in April does not mean that we should hold off our sustainable endeavors until then. Store your e-waste until Earth Week, or donate it to a trusted center acting otherwise promotes further environmental injustice."
    },
    {
      "title": "Pep Rally Precedes Strong Performance on Nobles Day",
      "author": "Ren Hirose '28, Sports Writer",
      "text": "The Nobles Day Pep Rally on Friday, November 8, demonstrated Milton's strong school spirit and pride, uniting students, faculty, and families alike. Over 1,000 people attended the clamorous event in the ACC, prompting an undefeated day for Milton varsity sports at Nobles the following day, which only fueled the enthusiasm for the fall sports season. The thunderous rally included music, dancing, and exciting games, which fired up the rowdy crowd. Ime Ebong '28 shared, \"Ritmo was definitely my favorite part of [the rally].\" The Ritmo performance was a vital part of the rally, showing off Milton's impressive prowess in dancing and athletics, leaving everyone in awe.\nThe rally also included a rock paper scissors tournament played by Lower School students. The Upper School played as well, adding to the festive atmosphere. Following the rock paper scissors tournament, the excited crowd reacted strongly to the video featuring the Milton Mustang and the Nobles Bulldog, with the cheering and booing echoing throughout the ACC, creating a lively backdrop.\nFinally, the confetti cannon was possibly the highlight of the rally, blasting particles of blue and orange high into the top of the ACC as the cheer squad pranced around the floor joyfully and music blasted through the speakers. The confetti showered the gathering in school spirit as the crowd waved their pom-poms and cheered for their athletes playing the next day, rallying together and creating a special day for Milton sports. I found that the rally brought the Milton community much closer to wholeheartedly celebrating the athletic achievement of all the fall teams heading into their final games of the season. Head of School Dr. Alixe Callen '88 reported that \"we have never seen such success at a Nobles Day\" More importantly, however, Callen appreciated how the event presented an \"opportunity to come together as a whole school.\"\nThe strong athletic performance on Saturday was likely directly connected to the Friday rally, as the energy was palpable. Grant Kim '28 mentioned that Boys' Cross Country was \"fired up\" after the pep rally, leading to solid team spirit; Kim also noted that even members of the team who would not be running at their NEPSTA meet made the three-hour drive to support their peers. Back in Dedham, Osiris Niven '28 considered the sideline of the football game \"electric\" and believed that \"it was one of the loudest games of the season.\" This connection between the pep rally and the teams' motivation on Saturday underscores the importance of school spirit and support for student-athletes.\nThe revamped and improved Cheer Squad, decorated head-to-toe in vibrant blue and orange, added much-needed energy and life to the event compared to previous years. The Squad mainly planned the event, galvanized enthusiasm, and put on an engaging atmosphere for students to build off of in their performances against Nobles.\nDuring the rally, I felt some discontent regarding the rock-paper-scissors tournament due to its focus on Lower School student participation and a lack of opportunity for Upper School students to engage. Daniyal Mian '28 stated that \"the Upper Schoolers should get to participate in the games next time.\"\nOverall, I found that the rally undoubtedly powerful, and I believe there was a strong connection between the undefeated performance on Nobles Day and the pep rally. Looking forward with anticipation to next time, I want to see more participation from the Upper School and a build-up of energy, continuing on the momentum of this remarkable tradition."
    },
    {
      "title": "Ritmo Dazzles with Rhythm and Confidence",
      "author": "Raphael Rufino '27, A&E Writer",
      "text": "The dance club, Ritmo, led by Gabby Brown '25 and Bree Legrand '25, continues to leave the community speechless with their elaborate choreography, raw confidence, and close bonds. Although the group first performed in late September for the Latinx and Hispanic Heritage Month Celebration Assembly, the group debuted their new members at the Pep Rally on November 8. Ritmo began their rehearsals for this performance in early October, which included choreographing, practicing twice a week, and replaying the music to further feel the beats and rhythm. For choreography, co-heads Brown and Legrand oversee the creation of the dances. Legrand explains, “I usually start over the summer with picking my songs and trying to figure out a movement to it.” She adds, “I did the first song, Gabby did the second song, and then we split up the third song.” For the rest of the group, the main concern is learning and memorizing the choreography. Christina King '27, a member of Ritmo, mentions it usually takes “about two weeks” for the rest of the team to learn a dance. King continues, “Practices usually start with some music and we vibe. Then we let [Brown and Legrand] dance, then [the team] does it, and we just keep doing it until our time is up.” Another member, Indra Lee '27, elaborates, “If you have questions, you can always ask. [Legrand and Brown] always repeat different moves that you missed.” While nearing a performance, however, the team adds additional practice to gain confidence and full fluidity with the choreography. Legrand explains, “Towards performance time, we do ‘clean up’ for two hours as opposed to our one-hour practice. Then we make sure to drill that music.”\nAlthough Ritmo might be a dance group, its members speak of benefits beyond learning the art itself. Victoria Rivera '27 remarks on her growth while in the group, explaining, “I feel like not only have I learned to be confident and to express myself, but also I've just learned so many new things about dance itself, the actual culture, and the history.” When asked about a mission statement, Legrand responded, “My goal is to get people to be more confident in themselves and to be able to express themselves freely without thinking about what other people are thinking.” By understanding how to move your body and become more familiar with it, the dancers evidently express their growth in confidence and self-esteem. Ritmo ensures the lessons learned from the group can expand beyond their dances. Pati Pogorzelska '26 explains, “I think it's so fun just being on stage because I'm both expressing myself and in a way, feeling more and more comfortable in my own body with each move I make.” Although they have already performed twice this year, Ritmo continues to transform as a group. After auditions, three new Class IV students joined the group—Amanne Dixon '28, Tigui Bah '28, and Audrey Prempeh '28—and made their debut on the team at the Pep Rally. Dixon explains, “It was a little scary because you're performing in front of a bunch of people that you don't know. But it was fun,” she adds, “There's a lot of laughing.” The Milton community enthusiastically embraces Ritmo’s performances. Blake Stenta '27 explains, “Everyone just gets so hyped and it becomes a highlight of the assembly.” Madeline Wu '27 adds, “I think that they have so much individuality and confidence in their dancing, and that energy palpitates throughout the crowd when they perform.” Ritmo is currently working on their performance for the K-12 Black History Month Assembly in February."
    },
    {
      "title": "Nesto Gallery Exhibition Archiometries Explores Abstraction and Reality",
      "author": "Zifu Song ’27, A&E Writer",
      "text": "On October 22 the Nesto Gallery announced the opening of the series “Archiometries” by Santiago Hernandez, a Cuban-born, Boston-based artist. He holds a BFA from the School of Visual Arts in New York and an MFA from the University of South Florida. Hernandez has exhibited his work nationally and internationally. Art in America, the Boston Globe, and El Nuevo Herald have reviewed his work; his art has also been featured in New American Paintings, a highly regarded art publication. He also received funding from the Pollock Krasner and Massachusetts Cultural Council grants. In addition to creating his art, he educates youth at the Lesley School of Art & Design and Massachusetts College of Art & Design.\nThe Archiometries series marks an evolutionary turning point in Hernandez’s work and style. Prior to the release of this series, Hernandez’s work focused on abstract-architecture-inspired art for fifteen years. However, his new series displayed paintings that reference specific works of modern and postmodern architecture, such as those of Frank Lloyd Wright, Tadao Ando, Zaha Hadid and Rem Koolhaas. Hernandez extracts the essence of source images and illustrates their underlying geometric and abstract structures. In addition to being a visual artist, Hernandez is also a musician. The Archiometries series has allowed him to synthesize his architectural art studies with his fascination for music through vibrantly colored works that represent the emotions conveyed by music.\nVisual arts student and photographer Andre Leung ‘25 expressed interest in the painting “Pirelli,” stating it resonated with him as he ‘‘liked the symmetry and more restrained use of colors similar to [his] preferences when taking photos artistically.” He also liked the gradient of the shadows in the painting, as it served as an overwhelming element yet added to the composition of lines and shapes. Similarly, Emona Jagaselvan ‘25 was impressed by the unique perspective in the artworks “The Guggenheim” and “Pirelli,” stating that they were so realistic almost as if they were photographs.\nA comment by Terence Lu ‘25 reveals an insight to Hernandez’s art style. He expressed affection for the contrast between simplicity and complexity as well as the mixture of abstract shapes and organized lines in the painting of MFA Boston. Hernandez utilizes simple shapes and arranges them in a seemingly unrelated and complex way. However, once the viewer takes a step back, the iconic structures of buildings magically appear in sight. This characteristic is prominent in almost every artwork of Hernandez. Overall, Sophie Gvenetadze ‘28 puts it well: colors in paintings like “The Guggenheim” blend well together and the center creates an optical illusion–the works are beautiful and satisfying to look at. This satisfaction and mesmerizing property embodies the musical element of Hernandez’s paintings. Good music often brings pleasure to the listener and extracts them from the real world temporarily, into the dreamy world of melody.\nMilton Academy students have expressed their gratitude to Hernandez for his sharing of this exhibition. In the visiting booklet, many people wrote warm compliments in the “comments” column. The “Archiometries” series combines abstraction and realistic depictions of architecture, some of which are familiar to Boston locals. As Walter Pater famously observed, “All art constantly aspires towards the condition of music.” Hernandez’s use of fusion masterfully symbolizes the imagery melodies hold."
    },
    {
      "title": "Winter Dance Concert Kicks Off Audition Week",
      "author": "Mira Lu '27, A&E Writer",
      "text": "During the week of November 11, director Shae Forest, a member of the Performing Arts department, led auditions for the Winter Dance Concert. This production, with performance scheduled for early March, will feature 14 dances led by 20 choreographers from Classes I and II, along with contributions from the Advanced Dance: Choreo Class and Ms. Forest herself. The performances will showcase a variety of styles, including hip-hop, contemporary jazz, Arabic belly dance, Ballroom, Indian dance, Chinese dance, and many more.\nAuditions took place on November 11 and 12. Students were assigned audition numbers and performed in small groups for video recording. Ms. Forest explained, “[the students] learn a minute-long contemporary modern combination which has basic dance steps but opportunity for them to improvise and show their style.” Callbacks “on Wednesday the 13 and Thursday the 14” focused on specific styles. Choreographers observed the callbacks and from there finalized their casting preferences from there.”\nIn order to get the choreographer position, students went through an application process in October. Applicants filled out a Google form detailing the type and style of dance they were choreographing, the number of dancers they were looking to cast, their music and sound, lighting, costumes, props, and storyline. They also submitted a detailed description of their choreography from beginning to end. Between October 31 and November 1, auditioning choreographers presented their work in a one-on-one meeting with Ms. Forest. Although only one minute was required, Louisa Corbett ‘26 noted that she, and probably most people who got the choreographer position, came “over prepared” and showed about “two minutes of choreo.” Breah Legrand ‘25 recalled writing “over 700 words” for the question “What type of dance are you creating and why?” Legrand said she was “really excited to talk about [her] idea” and writing 700 words “didn't feel too taxing because writing about something [she is] passionate about, such as dancing, feels so natural.”\nCorbett and Flossie Grant ‘25 are co-choreographing a modern/lyrical/contemporary dance with balletic roots, danced to the song “Orange Juice” by Noah Kahan. Corbett explained their dance is “going to be a small group of dancers with a background in modern/lyrical movement, and we're going to be exploring the theme of rediscovering yourself.” Corbett furthered that their dance was inspired by the challenges and stresses of high school and the college admissions process which “can make us lose sight of the things we love.”\nClaudia Krishnan ‘25 and Rhia Patel ‘26 are choreographing Indian dance blending Bharatnatyam, Kathak, and Bollywood styles. Krishnan explained, “[the dance] focuses on different elements of nature and the passage of time, with a focus on female empowerment.” Both choreographers have over a decade of experience in classical Indian dance and aim to “teach people different forms of dance from India and have fun,” explained Patel. Legrand is choreographing a hip-hop/Afrobeats Caribbean fusion dance, celebrating early 2000s clubbing culture. “These [are the] styles I grew up with and love the most,” she said. Inspired by media discussions on the decline of clubbing culture, she aims to reawaken its energy and vibrancy. “The whole point of the dance is to have fun and let the audience see that,” she emphasized. As a second-year choreographer, Legrand seeks to challenge herself with more intricate choreography and unusual ideas.\nElly Ash ‘26 and Amara Prather ‘26 are choreographing a tap dance to the songs 24k Magic by Bruno Mars and 777 by Silk Sonic. The dance is inspired by Vegas and casino vibes and promises high energy and excitement. Ash, who has been tap dancing for several years, expressed her desire to keep the tradition alive in the concert. Reflecting on her experience as a freshman in the Winter Dance Concert, Ash shared, “I was in the tap dance my freshman year and was sad there wasn’t one last year, so I’m glad to bring it back!”\nRehearsals will begin on Tuesday, December 3, right after Thanksgiving break. Most dances meet once a week ranging from 90 minutes to two hours, with each dance’s having about ten rehearsals. Forest anticipates an amazing show in early March. She remarked, “it will be great, the energy is so high and [everyone is] excited, from [the]…choreographers [to the] dancers.”"
    },
    {
      "title": "Ms. Pac-Man Transforms Student Center",
      "author": "Ella Cammack '26, A&E Editor",
      "text": "This fall, students have been congregating in and around Student Activities Director Kelly Reiser’s office due to the appearance of arcade-like video game machines. These additions quickly proved themselves to be among the most exciting attractions in the Stu. The buzz began when Ms. Reiser purchased a Ms. Pac-Man arcade machine last year during a Black Friday sale. While the machine initially went unnoticed by many students, Ms. Reiser noted that she had “sent an email and posted on social media about the game.”\nThe Ms. Pac-Man arcade machine, which also features classic games like Galaga and Dig-Dug, is not the only gaming option Ms. Reiser has provided. In her office, she also set up SAA’s Nintendo Switch, which offers popular games such as NBA 2K, Mario Kart, and Smash Bros. The space now encourages students to try both old-school and modern games in their free time.\nLast year, when she purchased Ms. Pac-Man, Ms. Reiser kept the machine in her office so that it would not get broken, limiting its exposure to students. This fall, however, she decided to move the game outside her office, and the response from students was immediate. Students passing by couldn’t help but stop by and try their hand at the retro game. Carly Kahn ‘26, one student who tried the Ms. Pac-Man, shared her enthusiasm: “I thought it was super fun!” She explained, “I think this is a great addition to the Stu because it provides a new activity, especially when there aren’t many other people [around] during my free period and I don’t have any other work to do.”\nAfter exposing Ms. Pac-Man to the Stu’s bustling atmosphere, however, “someone broke the top of it,” explained Ms. Reiser. To avoid a similar situation, she keeps the Nintendo in her office for students to play in a more controlled environment. Ms. Reiser stated, “Students are welcome to come play. Selfishly, I enjoy students using the activities office as a hangout space, too.”\nWhile Ms. Reiser initially publicized Ms. Pac-Man last year, this fall’s collaboration with the Student Government Association (SGA) has made it more visible. Ms. Pac-Man's central location has drawn in more students passing by to stop and give the games a try. While the addition of Ms. Pac-Man and the Nintendo have created excitement, not all students find the retro games easy to master. Mary Quatrale ‘26 gave Ms. Pac-Man a try but found it tricky. She shared “I tried the game once and stopped after one attempt because it was so hard to understand and play.” Similarly, Oliver Hirschfeld ‘26 noted, “I wish there were better instructions on how to play them.” For students accustomed to modern games, the old-school games can serve as an unexpected challenge. Despite this, Ms. Pac-Man still attracts students eager to test their skills. For some, the appeal lies in competing for high scores displayed on the leaderboard, a feature that adds an extra layer of motivation. David Lee ‘25 remarked, “I think the leaderboard and having the scores up on the television is really fun.” The games also create a sense of comradery and community. Lee noted that he has ‘‘heard certain groups of people congregating around [the video games] having a really good time.” Additionally, Rowan Cain ‘25 added, “It’s cool to see students from all different grades and social circles playing together and cheering each other on!”"
    },
    {
      "title": "Winter Forecasts: Excitement Builds for Upcoming Sports Season",
      "author": "Claire Liu '28, Sports Writer",
      "text": "Winter approaches with the much-anticipated new sports season and a long list of winter sports teams, each with their own goals and expectations. With Boys’ Basketball, Girls’ Basketball, Boys’ Hockey, Girls’ Hockey, Skiing, Boys’ Squash, Girls’ Squash, Boys’ Swimming, Girls’ Swimming, to Wrestling, the winter brings an abundance of opportunities for students to explore and pursue their interests.\nMembers of the Boys’ Basketball team, each with their own goals and motivations, strive to build off their previous performances. For example, Tatsuya Seto ‘28, although injured, hopes to advance his basketball skills. Prior to this year, he has played only with his father.\nGirls’ Basketball is also preparing for the winter season, having held tryouts the past two weeks. Many students are working their hardest to have a chance to compete at the varsity level. During tryouts, Girls’ Basketball Coach Daniel Norton states that he searches for players who “compete tirelessly.” Norton wants players to put their best effort into the game while being a positive and supportive member of the community. This season, Girls’ Basketball aims to win more than half of their games and to be “highly competitive in the extremely talented ISL basketball league.”\nThe extraordinary hockey teams both compete within the higher bracket of ISL hockey—for hockey teams, the ISL is split into two, differently skilled ‘leagues.’ This season, Boys' Hockey will work to create an enjoyable environment for the players and a place where the players can learn important life lessons. When asked about how the team will build off of last year’s performance, Coach James Gaudet said: “While there are some core team values we keep consistent from one year to the next, each team develops [its] own identity.” Through building that identity, Gaudet strives to also focus on representation, not just for the team, but also for Milton Academy.\nReturning upperclassmen of the Girls’ Hockey team Ruth Chen ‘26 and McKenna Ruland ‘25 are excited to meet and connect with new players. When asked what goals they are setting for the new hockey season, Chen stated, “I'd like to end the season with more points than last year, and hopefully a plus/minus score in the positives.” Alternatively, Ruland hopes to “develop as a player and win games with my team.”\nSkiing has brought home many awards in the past few years. And so, this year, players are anticipating the start of the skiing season. For example, Peter Cohan ‘28 has been skiing for thirteen years and racing for eight years; he’s setting his skiing goals high this year, hoping to “ultimately become a better skier, and get a shot at racing at NEPSACs!” The Skiing team creates an environment where coaches are focused on working with experienced skiers to improve and beginners to develop new skills.\nWhat Wrestling lacks in participants, it aims to make up for with effort and commitment. Players are excited about the wrestling season, even if it is their first time. Armand Matijasevic ‘28 started wrestling last winter and has stuck with it ever since. This year, he hopes to win more than half his matches and looks forward to competing with his friends.\nAdditionally, Varsity Squash teams aim to win the ISL division and qualify for Nationals in the 1st division this season. With many new players joining the team, Squash Coach Morgan Poor looks to improve “game management, stroke production, and shot accuracy.” Although this year, Squash lost many of last year’s seniors, Poor hopes that incoming players will raise the playing level even higher.\nVarsity Swim won last year’s ISL championship, setting the bar high for this year’s swimmers. Many returning upperclassmen, such as Emma-Rose Zilla ‘26, enter the swim season with high-set goals. Zilla, who has been swimming since she was four, stated, “I'm hoping to make finals in my individual events at our end-of-the-season Division I New Englands meet in March.” With new additions to the team, Zilla believes that the team will be successful this year, hopefully even winning the ISL championship.\nAs the winter season continues to crawl closer, Milton’s student-athletes are hoping to build off of last year’s performances to propel them into another successful season."
    },
    {
      "title": "Three Teams Advance to Playoffs",
      "author": "Lachlan Quinn ‘26, Sports Writer",
      "text": "This year, both girls’ and boys’ varsity squads made unbelievable runs to New England Preparatory School Athletic Conference (NEPSAC) playoffs, and in these past few, final weeks of fall sports, the energy on athletic fields was turned up.\nFirst off, Varsity Field Hockey (MAFH) had a record-breaking season. The team ended the regular season with a 1-0 win on Nobles Day, finishing with a 10-2 win-loss record, one of Field Hockey’s strongest ever regular season performances. The must-win game on Nobles Day sparked excitement across campus, and the victory sent the girls to NEPSAC playoffs for the first time since 2011. After Nobles Day on November 9, the team marked Wednesday, November 13 on their calendars: that was the day they were scheduled to play the 1-seeded Andover, a team with the strong reputation as “the best in the league,” according to several MAFH members. Heading into Wednesday’s game, Varsity Field Hockey was seeded 8, the last of the eight teams in playoffs. The team knew their first playoff game would set them against a tough opponent.\nMary Quatrale ‘26 spoke about the preparation MAFH took to be ready for the game. “[Because of daylight savings, my teammates and I,” she said, “took all we could out of the daylight on the turf, [adjusting] our formation to fit Andover.” The girls practiced hard Monday and Tuesday; however, the Wednesday playoff game ended up being the team’s last for the season: MAFH lost 2-0 to Andover. That being said, the team’s historic performance speaks to the field hockey program’s growth under Head Coach Kelcie Finn.\nGirls’ Varsity Soccer (GVS) also advanced to NEPSAC playoffs; the team hadn’t made it past regular season play since 2016. This year, Wolfpack was intent on making a playoff push, after winning only 50% of its games in 2023. In 2024, the team went 6-3-3 within the ISL and 9-4-3 overall, and, similarly to MAFH, clinched their seat in the playoffs with a win against Nobles on Nobles Day. GVS beat out the Bulldogs 2-1 to advance as the number 8-seeded team to NEPSAC playoffs.\nReagan Vaughan ‘26 said that “this run to the playoffs was not unexpected [because] this goal was set for [the team] early in the season.” So, as the girls prepared for their game against 1-seeded Worcester Academy on Wednesday, November 13, they were delighted but not shocked, and they knew they had hard work ahead of them: just weeks previously, GVS lost to Worcester Academy 2-0. Vaughan also emphasized the team’s need to not have a “would’ve should’ve could’ve season” and how the girls collectively were “so grateful to have the chance to keep [their] season going… with one another.” Despite that excitement, however, Girls’ Varsity Soccer lost 2-0 to Worcester Academy, ending their play for the season.\nFinally, Boys’ Varsity Soccer (BVS) also advanced to NEPSAC playoffs, having finished first in the ISL for the third year in a row with a 14-0-1 record in league play. BVS, like GVS and MAFH, defeated Nobles on Nobles Day, rounding out the team’s regular season with a win.\nUnder the guidance of Head Coach Chris Kane, Boys’ Varsity Soccer was unequivocally a powerhouse this year, having gone undefeated and tying only one game in the ISL. Entering NEPSAC playoffs on Wednesday, November 13, Samba was the number one seed.\nThe key to this domination, according to Silas Lawrence ‘25 was their “senior class [who had] already been to two NEPSAC finals and [knew] what it takes to succeed in the playoffs and endure the stress [that comes along with it].” In the first round of playoffs, Samba had a dominant show against 8-seeded Buckingham Brown & Nichols (BB&N), beating them 4-1 and sending Boys’ Varsity Soccer to the NEPSAC semifinals. Both the quarterfinal against BB&N and semifinal against 4-seeded Loomis Chaffee School were hosted at Milton Academy, played on the school’s Berylson turf. For the semifinal game, the administration pulled out the stops, offering viewers refreshments like hot chocolate.\nBVS pulled out a win against Loomis on Saturday, despite being locked in a 1-1 tie. After a tense penalty shootout, which Samba won 4-2, the boys advanced to the NEPSAC finals. The NEPSAC championship was hosted this year by Choate, where Boys’ Varsity Soccer faced off against 3-seeded Taft, a prep school in Connecticut. Scoring early in the game, Josh Partal ‘25 set Milton ahead until Taft evened out the score in the second half. Though Samba was favored to repeat its 2023 ISL championship victory, the boys ultimately walked away defeated, losing to Taft 2-1. Though the team was disappointed by the outcome, Samba’s 18-2-2 overall record speaks to the players’ incredible performance all season long."
    },
    {
      "title": "Varsity Teams Sweep on Nobles Day",
      "author": "Jordan Munsey ‘26, Sports Writer",
      "text": "Every November, Milton Academy and Nobles and Greenough School face off against one another to carry on the tradition of one of the longest high school rivalries in the United States. Dating back to 1886 when the two schools battled each other in a football game, Milton-Nobles day has persisted over centuries and continues to unite the schools in a day of friendly competition, team culture, and astounding athletic prowess. This year, however, proved not much of a rivalry: the Milton Mustangs swept Nobles Day, winning all Varsity games, with sub-varsity teams tying and losing only one.\nBoys’ Varsity Soccer (BVS) won decisively, beating Nobles, second in the ISL, 5-0, with five different seniors scoring each of the five goals in their final ISL matchup of their Milton careers. Boys’ Varsity Soccer had already clinched the ISL title the week prior with a win against Brooks, but the team’s decisive win against Nobles solidified their spot as the top team in the Independent School League. The 5-0 beatdown was more decisive than last year’s game where Nobles’s Boys’ Varsity Soccer came within inches of beating Milton soccer in a narrow 2-1 Milton win. Mason Comeau ‘25, a three year varsity starter on BVS said, “the win against Nobles set us up well to perform in the playoffs as team confidence and camaraderie were at an all time high after the game.”\nAdditionally, the Boys’ Junior Varsity Soccer also beat Nobles 5-0. On the team, Daud Major ‘28 scored two goals for the Mustangs. When asked about his performance, Major said “my main goal whenever I’m on the field is to score, and that’s what I was looking to do.”\nOff the soccer field, Varsity Football also won handily, prevailing 7-0 over Nobles. This 2024 victory marks the third year in a row that Varsity Football has defeated the Bulldogs on Nobles Day. Jack Reardon ‘26, who has witnessed all three wins first hand from the sideline, questioned if it was still a rivalry. “The pure dominance by Milton athletics this year,” he said, “and more specifically the [Milton] football team the past three years, makes me wonder if the Milton-Nobles rivalry still even exists.”\nMilton’s winning streak did not stop there. Both defeating Nobles on their respective pitches, Varsity Field Hockey and Girls’ Varsity Soccer also clinched berths to the NEPSAC class A tournaments, with Varsity Field Hockey qualifying for the first time in 14 years after a 1-0 win over Nobles. “It was an unreal game,” said Field Hockey player Julia Baldwin ‘26 when asked about the win. She continued, saying that “the whole team was electric through the bench and onto the field. It was definitely a hard fought win but [it was] so rewarding.”\nOn top of Field Hockey’s win, the Girls’ Varsity Soccer, also known as Wolfpack, defeated Nobles 2-1. That win marks Wolfpack’s first victory over Nobles in six years. Charlie Banbury ‘26 shared that “what makes [the] Nobles game special was how we [Wolfpack] knew that this game might be our last game ever with our graduating seniors, so everyone chose to play for each other one last time.” Wolfpack’s win earned them the 8 seed in the 2024 NEPSAC Class A tournament.\nMilton-Nobles Day is not only a time for students to compete. Every year, Milton and Nobles Boys’ Soccer alumni compete in a match, battling for a revered trophy. With alumni ranging from class of ‘86 to class of ‘22 in this year’s game, the Alumni game served as a beautiful way to unite all generations of both Milton and Nobles athletics on one field once again.\nBut significantly, Nobles Day does not only unite athletes on opposite sides of the pitch; the day also brings together spectators. Brandon West ‘26, who attended Nobles Day this year, mentioned “loving” coming to “support [his] buddies” on this vibrant day, “watching then play in such high stakes games” and cheering amidst fellow Mustangs decked in orange and blue.\nAs for Nobles, the Bulldogs’ best hope is to look forward to the winter season’s Nobles Day, where sports such as basketball, hockey, and squash will face off. Milton, however, will look to capitalize on its momentum leading up to the winter Nobles Day, and continue their dominant 2024-2025 campaign."
    },
    {
      "title": "The Hypocrisy that Dictates Our Social Lives: Relationships between Black Women and Predominantly White Institutions",
      "author": "Breah Legrand ‘25, Voices of Milton Contributing Writer",
      "text": "As a black woman, attending predominantly white institutions (PWIs) for the entirety of my primary and secondary education has warped my view of desirability. I believe the lengths black women have to go in these spaces to feel desired and sought after are drastically different than our white female counterparts. Black women’s apparent lack of desirability stems from the stigma surrounding black women being “loud and obnoxious”. Even if I am being “loud” with my predominantly black friend group, it’s still not an uncommon occurrence to be having a fun time with your friends and get a little rowdy. There is some hypocrisy with this sentiment because when we are having fun, it’s viewed in a negative light, but when white women do it, it’s seen as “cute” and they have the excuse of “Oh, they’re just having fun.” This also shows how our system at PWIs is very flawed; the most beautiful black woman can be pined after, but at the end of the day, a white woman will be chosen over her. Don’t mistake this as a diss towards white women, but more so a criticism of how they will be chosen over black women because of these stigmas that surround us.\nOver the years, I have noticed how so many students care about how they present themselves, but I realized many try to suppress their authenticity because they think they are “doing too much.” I find this ironic because for an institution that prides itself on the motto “Dare to be True,” wouldn't this directly oppose our mission statement? As someone who used to be introverted and not as outgoing, I acknowledge the difficulty of breaking out of your shell. What I do say is unacceptable is judging others for being more outspoken and confident in themselves as a reflection of your insecurity. I believe Ritmo is a common area where this idea of confidence and “doing too much” intersects. Sure, we know that whining in front of kids is not exactly appropriate, but even in other performances when there are no kids present, I do often hear students saying, “They’re doing a lot right now”, etc, etc. There also tends to be more of a cultural divide when it comes to supporting students in the community in more artistic areas of performance or activities. You can see a lot of women of color in the stands cheering, as some white women do too, but the black women are judged for being too loud and supportive, which is also ironic considering we are in a gym.\nAs head monitor Ariam Gebresillasie ‘25 illustrates perfectly, “As black women, we are already judged so heavily, and as a result, I think we often don't care about what we look like in terms of what the conventional societal standards that are already set to make us look bad.” Students here are generally and considerably concerned about their image, and this is what I love about the POC community, especially black women here. They are not afraid to do something outside of the “norm” and let it stop them because it’s considered socially unacceptable.\nAnother thing I also recognized was a recurring theme with some black men: the internalization of race and misogyny towards girls of their race. Some will refuse to date black women for some prejudiced views they hold of them, but let’s face the facts: one or both of your parents are black, your grandparent(s) are black, but either way, your lineage is black. I’ve spoken with many people about this topic, and we believe that this hatred of black women stems from hatred of the self. When it comes to being involved in romantic relationships, I hate having to consider the fact of “Do they even like black girls?”. There are even some black girls at Milton who have experienced this directly: a friend of mine was interested in this guy and was hurt to learn that he didn’t like black girls. Eventually, I mostly gave up expecting a sliver of a romantic relationship at Milton.\nThis is not me begging for black women to be considered for more romantic relationships like our white counterparts, but more so, a wake-up call to the people who have internalized prejudice towards black women to think about where those ideals stem from. You may disagree, but as someone who sees and lives this experience as a black woman, many other black women here and in other PWIs will agree with me. It would be nice to have some kind of attention, but I am totally fine with where I am. Hopefully, in the future, our society will defeat this hurdle of internalized prejudice and judgment towards black women and begin to act more like a community."
    },
    {
      "title": "Coco’s Corner",
      "author": "Maddie and Hugh (Sophomore Class Reps)",
      "text": "Hi everyone! It's the sophomore class reps, Maddie and Hugh! We are so thrilled to be hosting this week's Coco's Corner! We began our year by conducting an application process for our class council and choosing several representatives to put more student voices behind our events. We have brought some fun to class meetings with events like student music performances and games to get to get to know our class deans. Two weeks ago, we held Milton's first MOCO (Milton Homecoming), an amalgamation of efforts from our class deans, dance committee, and class council. After listening to our class's comments about last year’s freshman dance and talking to the previous sophomore class reps, we landed on something like a classic homecoming dance with a masquerade theme. To spice things up, we also launched MocoMatch and created an Instagram account for proposals. Both of these elements greatly heightened the general excitement surrounding our event. MocoMatch, created by Hugh, was an online website that randomly paired students. After receiving their partner, everyone had to take a photo as a pair, preferably at MOCO. Our class deans are going to award a prize to the pair with the best photo. As for the proposals, we featured 15 on Instagram, but many more people participated in MOCO. We were so pleased with the turnout and overall result. We hope everyone who attended thoroughly enjoyed their night!\nAs for upcoming plans, we are currently planning an appreciation class meeting. We want our class to recognize people who they feel indebted to and grateful for. We will then dedicate a class meeting to creating cards for those they appreciate. Hugh and I will then distribute the cards throughout the Milton community. Through this activity, we hope that our class will recognize and form a greater appreciation for those who help them at Milton. Furthermore, through this act of gratitude, they may gain a greater sense of community and fulfillment at Milton. As for the recipients, we just want them to know how much they mean to our class, and how grateful we are for their presence. Another project we are currently working on is distributing class hoodies. Last year, our former class reps began this project, but unfortunately could not continue it. Hugh and I already have the design (shoutout Raphy!!) and are working with the administration to send out orders!\nClass Council: Harris, Preston, Harper, Indra, Gisele, Natalia, Ben\nFeel free to reach out to any of these students for questions or concerns!\nP.S. Please tell me that a Class III student won Gotcha (written on Nov 16)."
    }
  ]
}
