[
  {
    "title": "Trump Won the Election. What Happens Next?",
    "author": "Senior Editorial Board",
    "text": "After 12 hours of counting votes, November 5th's Election Day decreed the winner of the United States' 47th Presidential Election as Former President Donald Trump. Runner-up and current Vice President Kamala Harris lost the election at 44 electoral votes away from the 270 threshold. As the U.S. approaches the Presidential Inauguration on January 20th, Americans must begin. to imagine what the next four years under a Trump-Vance administration may entail. We, the Editorial Board, will outline the prevalent economic, legislative, and social agendas of the succeeding president. Economics: The election of a Republican president enables the implementation of new economic policies that may contrast from Biden's, In a speech at the Economic Club of New York on September 5th, Trump responded to concerns regarding inflation by highlighting that clude: extending his 2017 his economic plans \"will tax cuts, adding cuts in the rapidly defeat inflation, corporate tax, and exempt- quickly bring down prices, and reignite explosive cial security from federal economic growth.\" More taxes. Hoping to encourage specifically, Trump, as ex- U.S. manufacturing, Trump pressed throughout his has proposed a 10% to 20% campaign, intends to tar- universal tariff on imports get gas prices. Analysts, with levies of at least 60% however, claim that plans on Chinese goods. The Tax will not achieve this goal; Foundation estimates that a these prices are largely out 10% universal tariff would of his hands. Trump also raise $2 trillion in revenue has his sights on tax cuts for the federal government and tariffs. While the full from 2025 through 2034, extent and feasibility of the and a 20% tariff would raise latter remains uncertain, $3.3 trillion. However, it some circulating plans in is estimated that households would pay an average of somewhere between $2,600 to $4,000 extra on consumer goods yearly because of these tarrifs. Taking into account the tax cut extension, analysts expect that Trump's tax plan will raise the national debt an estimated $7.75 trillion through 2035, twice that of Harris's proposed plan. Reproductive Rights: While Vice President Kamala Harris enshrined abortion rights and reproductive freedom at the heart of her campaign, Trump has not provided a clear stance regarding the subject. Although he took to his social media platform Truth Social to claim credit for \"[being able to kill Roe v. Wade, Trump softened his position as the election neared, particularly after his running mate, current Vice President elect JD Vance, garnered negative attention in regard to his anti-abortion rhetoric. Leading up to election day, Trump insisted that his \"administration will be great for women and their reproductive rights; however, when asked whether or not he would veto a national abortion ban, he repeatedly sidelined the question. Finally, in October, he made a social media post declaring that he would not \"support a federal abortion ban, under any circumstances.\" However, given Trump's wavering stances on abortion, the safety of reproductive rights is not guaranteed. One of the National Right to Life Committee's highly prioritized agenda items is the enforcement of the 1873 Comstock Act, a federal law that works to prohibit the mailing of anything associated with abortion, most notably including medical equipment used during abortions and contraceptives. Roe v. Wade opened the law up to debate in the 1970s but never formally repealed it. With Roe CONTINUED FROM PAGE 1 now gone, many conservatives see Trump's presidency as the perfect vehicle to restrict abortion nationwide, especially as such an agenda would not require a new federal law. Jonathan Mitchell, the legal spearhead of the 2021 Texas law that banned abortion in the state, told the New York Times that \"we don't need a federal abortion ban when we have Comstock on the books.\" Mitchell even went as far as to urge anti-abortion groups to \"keep their mouths shut as much as possible until the election\" regarding this agenda. Like his proceedings surrounding questions of a national abortion ban, Trump continuously avoided taking a firm stance regarding the Comstock Act, but, in August, he finally said that he would not use the statute to ban abortion drugs in the mail. However, many people in his close circle, including JD Vance, have, on record, urged the opposite. Additionally, Trump could restrict reproductive rights by appointing anti-abortion leaders to key agencies like the U.S Food Drug Association (FDA) and Department of Justice (DOJ). In October, three Republican attorneys general filed a law suit against the FDA to heavily limit access to Mifepristone, one of two drugs used to conduct abortions. While the Supreme Court disregarded a similar complaint during the summer, these attorney generals hope they will find more success, arguing that the FDA has violated the Comstock Act by permitting these pills to be mailed. While, in 2022, the Biden DOJ ruled that the statute does not criminalize this behavior if the sender lacks unlawful intent, the Trump DOJ could interpret the law differently. In his first presidential term, Trump appointed anti-abortion judge Matthew Kacsmaryk to a federal court in Texas, and Kacsmaryk greenlit the now overturned complaint that the FDA should restrict access to mifepristone. Moreover, the anti-abortion movement has been clear in their long-term goal to establish \"fetal personhood,\" endowing fetuses, embryos, and fertilized eggs with full human rights. Thus while Trump may insist that he will protect reproductive rights, his anti-abortion judicial picks and their plans to codify a fetal personhood standard could do the exact opposite, leading to not only the complete ban of abortion but also of birth control and in vitro fertilization. Environment: The election of Donald Trump poses a major threat to movements to combat climate change. As a part of his \"Day 1\" plan, Trump has outlined his intentions to \"drill, baby, drill,\" a punchy phrase he used for his objective to increase oil drilling. Additionally, during his speech after getting elected, Trump explained that \"we have more liquid gold than any country in the world\" when referring to potential domestic oil drilling. Trump is committed to deregulating oil drilling to maximize production. However, the environmental cost of this plan may outweigh its speculated benefits. Oil drilling is one of the leading causes of climate change as it releases pollutants into the atmosphere and greatly damages the ecosystem where the drilling takes place. Trump claims that lifting the environmental regulations of oil companies will lower gas prices. However, climate and energy analysts such as Maxine Joselow from the Washington Post detail that the price of gas is most heavily influenced by the coalition of oil-producing corporations. The U.S. government itself doesn't have control over the cost of gas. Thus, the problem lies in the dependence on the fossil fuel industry, not the regulations on oil corporations. Moreover, Trump has also described his plans to reverse pre-existing environmental policies. Specifically, in his October New York Rally, Trump referred to Biden's Inflation Reduction Act (IRA) policy as the \"green new scam,\" and later detailed his desire to \"terminate\" it. The IRA, one of the largest pieces of federal legislation that addresses climate change, spells out environmental regulations and benefit systems to prioritize the reduction of carbon emissions while also reducing inflation. Additionally, Trump threatens the Environmental Protection Agency (EPA); the Trump Administration specifically targeted EPA during its last term. Within four years, the executive branch rolled back 98 environmental policies. Although some of these policies were reinstated under the Biden Administration, Trump's continuous prioritization of the fossil fuel industry jeopardizes these regulations. Moreover, a recent EPA rule instituted in April forces power plants that generate electricity through burning coal to reduce their carbon emissions by 90% in the next 8 years. This effective regulation could immensely benefit the environment. However, the Republican party has specifically filed against this regulation. With Trump elected, the Justice Department is unlikely to defend it. Throughout Trump's political career, he has frequently declared that he does not even believe in climate change."
  },
  {
    "title": "Students React to October 22 Israel-Palestine Panel",
    "author": "Amy Khaing '27, News Writer",
    "text": "On Tuesday, October 22, all all Upper School students gathered in the ACC for \"The Prospects for Peace in the Middle East\" about the ongoing conflict in that region, The DEIJ office organized ized the panel, which featured Ghaith al-Omari, a former executive director of the American Task Force on Palestine and former member of the Palestinian Authority, and Ambassador Dennis Ross, a William Davidson Distinguished Fellow at the Washington Institute for Near East Policy. Policy. Deepak Malhotra P '26 '27, an author and professor at Harvard Business School, moderated the discussion. have a solid foundation to understand the events.\" Overall, she said, the goal for these panels was for \"students to hear multi-ple voices and perspec- While Rhys Adams 26 ers agreed on a 60-70% tives,\" and the selection \"had a very good time,\" likelihood. The media- This panel was the second part of a series focused on the conflict between Israel of panelists \"was made he expressed his con- tor, however, held a low- and Hamas, a conflict which by a committee of Mil- cern about the speaker er estimate of 30-35%. has recently expanded to ton faculty, staff, parents, selection, since he be Malhotra considered a include other parties and students, and administra- lieves both panelists are conflict resolution \"still theaters. Earlier this month, tors.\" For Elizabeth Sim 27, biased due to \"the nature possible to achieve,\" but moderators from the Public Issues Board hosted \"An Malhotra's psychology of their jobs as former stated that it \"will require Overview of the Ongoing ice-breaker left an impres- diplomats in America.\" a lot of hard work and a Crisis in the Middle East.\" sion. She was surprised Additionally, he men number of things to go Director of Equity and Inclusion Melissa Lawlor explained that this initial panel, hosted October 9, \"was actually part of the programmatic rollout... it was mandatory so [students] can to know \"how people are more inclined to stick to their own beliefs instead of listening to others' per spectives.\" Cynthia Lee '28 appreciated the speakers' ability \"to share their\" CONTINUED FROM PAGE 1 the timeliness of conflict resolution will largely \"depend on what countries get involved.\" The panel has sparked ongoing discussions across campus. Math teacher and SAMENA advisor Michael Kassatly said that though he \"generally doesn't find people in this country to be well-informed on global issues,\" he believes that \"Milton students know far more than the average American student on this conflict.\" While Lawlor states that the DEIJ office is making efforts \"to engage students as critical thinkers,\" several students have called for improvements. The panelists answered only a few student questions due to limited time, but Mariana dos Santos '25 felt that \"an extended Q&A would [have been] nice.\" Kassatly agrees, as he \"personally [gets] frustrated when there isn't enough time to answer amazing questions by the student body.\" Bain Coyne 26 proposed another potential improvement, suggesting that \"these important conversations [should be held] in areas where students can pay attention,\" and called for a location besides the ACC. Gustavo dos Reis '26 thinks the school will benefit from \"a diverse pool of speakers who talk about different topics\" so \"students get a better overview of world issues rather than just ones. that directly relate to the U.S.\" After receiving the feedback, Lawlor noted that the organizers \"did hold an extended Q&A for the panel in the FMC. She said the DEIJ office \"[tried] to have one at every event when possible,\" but they \"often have to work around the speakers' schedules.\" Considering the location choice, Lawlor \"completely agrees that the ACC is tough to listen\" in-however, she also mentioned that \"it is the only space on campus that fits the entire student body and Milton does not have \"a the ater that could hold 1000 people.\" Thus, if the DEIJ \"were to hold [the pan el] anywhere else, [they] would have to choose who could attend.\" In response to the critique of biases in panelists, Lawlor asserts that \"the interpretation of the pro-Israel bias is [that] student's opinion; if that is what they took away, that is their takeaway.\" Editorial note: While the three all-school panels featured American and Palestinian speakers, no Israeli speakers were included in the DEIJ's programming. The Jewish Student Union did bring an Israeli survivor of the October 7 attacks to speak for an optional presentation in the Goodwin Room that was attended by about 50 students."
  },
  {
    "title": "Confronting our Political Blind Spots After the Election",
    "author": "Editorial Board",
    "text": "Returning to campus after the night of the election, we found ourselves in conversations of disappointment, yes, but also of surprise. Naturally, a Harris-Walz win was not guaranteed, as complaints of the current Biden administration's policies sullied the Harris name to many, but many of us expected the race to be nevertheless a close one. Yet Trump began with an early lead and ended the race with 295 electoral votes, far surpassing the 270 votes required to win the election. Notably, Trump also received the support of around 50.8% of voters, making him the first Republican to win the popular vote since 2004. Despite how arguably expected the election results came out to be, it's undeniable that shock is what we feel before the uncertainty of what's to come in the next four years. Our progressive Milton bubble quickly, harshly, burst. What perpetuates the existence of this bubble? Why do students who come from all reaches of the world fall victim to distorted perspectives of the rest of society? We believe there are three main reasons that create this mirage. The first being that we, as a student body, are simply not politically engaged. Our main political clubs lean liberal without conservative counterparts. Student perspectives become based solely on one-half of the political world. Furthermore, with Democratic opinions frequenting above Republican ones in Upper School announcements and speakers, students who do have opposing viewpoints may view their opinions as \"against the grain\" and therefore controversial. Without proper political representation in public settings, we as an institution- create an echo chamber for one side of American politics, resulting in skewed and perhaps out-of-touch perceptions of the U.S. political state. mala is brat.\" This seemingly organic correlation between the Vice President and a niche joke among Gen Z catalyzed strong support for Harris among younger social media users. More analytically, this trend serves as an example of how social media- for good or bad-influences our perceptions of political candidates, without our cognizance of their policies. Furthermore, while the positive comments and support that Harris' content was receiving may have supported the perception that America was overwhelming in support for the Vice President, such unanimity in beliefs may only exist within the highly curated, algorithmic spaces of social media. Within our campus, social media disconnects our understanding of the outer Milton political state. Dr. Lawlor, amongst others, frequently stresses the importance of listening for the sake of listening, of addressing and silencing our biases, of leaning in with an open mind, even if just momentarily. Yet, our behavior seldom measures up. On Thursday, November 10th, the Heyburn lecture which replaced Club Blocks 2 and 3 featured quite preposterous assembly etiquette. In the bleachers, shuffles of whispering students and clamors of dropping phones peppered Jonathan Schroeder '99's hour-long speech. It seems that despite impassioned harps and flowery emails from disappointed (history) teachers, as a student body we still lack simple skills of respect and empathy-skills essential toward not only USPs but also political education. We did not want to listen, and we didn't give him the time of day. We cannot treat politics in the same manner. This attitude that we are \"above\" devoting our attention to someone-regardless of their beliefs or allure-cannot move us forward. We can lob insults at those in opposition to our political stanc- We must also acknowledge how social media feeds into our polities, or simply choose to ignore their cal misperceptions. If you spend as much time on TikTok as many of us, you've most likely witnessed the wave of \"Kamala brat Summer\" followed by a surge of \"trendy\" content pushed out by her official account @kamalahq. The phenomenon began when English singer-songwriter Charlie XCX who released the viral album, brat, this June, tweeted \"Kara rhetoric, but at the end of the day, as \"crazy,\" as we may deem individuals' beliefs, they too hold political power. To view our opponents as below us is a disservice to ourselves and our causes."
  },
  {
    "title": "SAA Launches First Annual Fall Festival",
    "author": "Gustavo dos Reis '26, News Writer",
    "text": "Fall Festival took place from 7-10pm on October 25, 2024; the Student Activities Association's event, the first of its kind, included fall-themed food and activities, such as the Giant Mechanical Pumpkin and lots of apple cider donuts. \"The event went so well!\" said Rhia Patel 26, an SAA board member. \"There was a great turn-out (Director of Student Activities Kelly Reiser estimated that 250 students attended), and students of all different grade levels came. There was an endless amount of activities, and the vibe was so great.\" Though the Fall Festival happened for the first time this year, members of the Student Activities Association have been considering this event since last year. Maya Hindawi '26, another representative on the SAA board, explained that \"[the SAA] started off with the usual Halloween dance and then realized that the effort [they] usually put into the Halloween dance does not always pay off\" This year, however, instead of throwing what they thought would end up a largely empty Halloween party, the SAA organized the new event. Vennie Xiao 26, who attended the event, agreed with Patel. \"It was so fun. The food was delicious, and the activities were great. SAA definitely surprised me with this one.\" If Xiao 26 could change something about the event, however, \"[she] would move it earlier in the day.\" \"I thought the [Fall Festival] was great. I mean, there were tons of people there and fun activities. There was also a balanced amount of upperclassmen and underclassmen,\" Reiser shared. been more interesting.\" According to Tsang, \"the most fun activity was the Mechanical Pumpkin ride. Even so, who likes riding a pumpkin?\" Anthony Wu 27 agreed with Tsang. \"All of the kids who showed up made the atmosphere better, but the activities of the event could [have been more varied,\" added Wu. Kairo Diaz-Archilla Not every student enjoyed the event, however. 28, on the other hand, To Preston Tsang '27, for thought \"it was really fun, instance, the event had \"a and one] could tell how great atmosphere because much effort was put into of the amount of people hosting the event, espe- who showed up... [but] cially from Ms. Reiser and the activities could [have the SAA representatives.\" To Diaz-Archilla, \"the Fall Festival had the same energy as the Quadival.\" The ity niors.\" planning, creating fliers, and advertising. Additionally, the Milton Art Club helped with things like the photo stand,\" stated Patel, describing the process behind organizing the Fall Festival. The planning of the actual structure of the event involved first creating a table-placement map. Then, SAA representatives were assigned to a specific table and ran the activities of their specific table Andre Leung 25 throughout the event. only downside, according to him, was the \"lack of senior presence at the event.\" He believes that it is now SAA's responsibility to \"better integrate se- Head Monitor Ariam Gebresilassie 25 shared her opinions as well: \"I think student turnout has improved; SAA has done ful, Patel pointed out that a really good job at cater- \"to keep running these ing to what the students events definitely requires respond to rather than a ton of student body in- forcing the same tired volvement.\" event ideas.\" \"The few weeks leading up to the event, the whole board got involved with Following the Fall Festival, Reiser and SAA representatives met to evaluate the quality of the event. Though the board found small changes that they want to make to the event, the Fall Festival will return next year. Although she deemed the Fall Festival success-"
  },
  {
    "title": "Moco Aims to Spark a New Era of Engagement in Class III",
    "author": "Dilan Payne '27, News Writer",
    "text": "On Friday, November 1, Class III students gathered in Ware's Goodwin Room for the first-ever \"Moco,\" a reimagined sophomore class dance designed to foster unity and promote school spirit. Class III Representative Madeleine Wu estimated that 75-80 students attended. Some attending students felt that the event successfully created a lively environment and laid the groundwork for greater engagement among the sophomore class in school events. Sophomore Class Dean Molly Swain explained that, from the deans' perspective, \"the class reps did the legwork.\" Typically, class representatives and deans find themselves defaulting to a Winter Ball-this year, however, Wu and her counterpart Hugh Kramer '27 \"truly invested,\" according to Swain, beginning preparations as early as the first week of school to ensure the dance would take place in November, a time Swain described as \"celebratory.\" For Wu and Kramer, the vision was clear from the outset: they wanted a homecoming-a familiar concept that they felt would undeniably spark excitement. \"We wanted it to be something people knew,\" explained Wu, referring to their rebranding effort aimed at boosting student engagement. The other to interact,\" Kram- representatives initially wanted to call the dance a homecoming, a familiar label for high school dances, but the admin- istration did not allow this. Kramer stated that \"they wanted to distance themselves from an ex cessive drinking culture associated with college homecomings.\" Instead, they dubbed the event \"Moco,\" a combination of \"Milton\" and \"hoco,\" a common shortening of \"homecoming.\" However, the class representatives' efforts extended beyond this rebranding, incorporating interactive elements in an attempt to excite more sophomores. Kramer explained that \"[he and Wu] want to create a more cohesive com- munity. We all have our separate friend groups, and hear the terms DSG and DSB being thrown around.\" But in attempts to \"get people who normally don't talk to each er and Wu devised personalized website, a mocomatch.com,\" which paired students at random and challenged each duo to take a photo together and submit it to the representatives for a prize. \"It was never a match.com or a dating app,\" Kramer clarified. \"It was just about about having a good time together.\" In planning Kramer hoped to address what they perceive as a trend in dance at tendance. \"Traditionally, presented at the begin- most dances are some ning of the year, which thing that only partic- explained that \"around ular friend groups were fifty percent of our stu- going to,\" Kramer added. dents say we have school We were really trying spirit, and the other fifty to integrate the grade the grade percent say we don't. I think the ones who say we don't have school spirit are the ones"
  },
  {
    "title": "Forbes Lunch Crowd",
    "author": "Unknown",
    "text": "Lunch at the Forbes Dining Hall is a pillar of school life for students. With a wide array of hot serving areas spread out issues that Forbes Din- food options, a salad bar, a on the ground of the din ing Hall suffers from due dessert section, and more, ing hall takes up a great to congestion and crowd the average Miltonian has amount of space, indirect management, but it re- access to a multitude of ly shepards travelers into mains to be seen if any delicious meals. Enjoying different, clearly defined direct action will be tak- such meals, however, can be lines for check-in booths to en. a challenge characterized save time and prevent large by long, winding, and un swells of people from form- monitored lines. Students ing. It is important to note circulating the serving ar- Forbes can also address that these vertical options eas in haphazard, unde- the congestion by adding would most likely only fined directions, creates an crowd control stanchions work with lower-demand overall sense of chaos. This and retractable rope barri- fruit and vegetable options congestion and disorder ers. The problem with most which do not necessarily can make it challenging for schools is that they provide not in a manner that leads to through en route to dif- students to get the food they only one location for hot even more crowding (such ferent food options. There want and have enough time meals, leading to long serv- as placing the salad bar be- would be certain breaks in to eat it. Currently, all ing lines. If students had ac- hind cafeteria tables that are the barriers to allow stu- the areas to get food are lo- cess to hot meals from differ- not easily navigable). Forbes dents to get out of line if cated in the same general lo- ent serving areas, whether it can implement a they chose and to enable cation (excluding the dessert be a window or a bar, shorter pathway that encircles the students to walk through bar), causing traffic for stu- and faster lines are inevita- dining hall itself, allowing longer lines that could lead dents trying to move to var- ble in that respect, Forbes students to branch off the to blockages. In addition, Forbes ious serving locations. The first critical step to is already moving in the designated path for some would benefit from imple- improving congestion in the right direction by hosting options and rejoin further menting vertical serving dining hall is maintaining a three hot food stations dai- along. Clearly defined entry infrastructure. Having stable system to manage stu- ly for hungry students and and exit points can be added serving areas spread out dents circulating in the area. staff so students have no difficul- ty getting in and out of line. To do this, it may be necessary to reorganize the serv- A similar plan is executed ing areas to get food are lo- in airports, which slow cated in the same general lo- ly shepards travelers into cation (excluding the dessert different, clearly defined bar), causing traffic for stu- lines for check-in booths to dents trying to move to var- save time and prevent large ious serving locations."
  },
  {
    "title": "Athletes Discuss Equity at Changemakers Conference",
    "author": "Tiffany Jin '28, News Writer",
    "text": "On Monday, October 21, twelve Milton students attended the third annual ISL Changemakers Conference on Racial Equity and Justice, hosted by Lawrence Academy. According to Director of Equity and Inclusion Melissa Lawlor, the ISL Changemakers Conference, which originated at Milton aimed to bridge the..."
  },
  {
    "title": "End the Ineffective Policy of Freshman Study Hall and Maximize Quiet Hours",
    "author": "Mike Gao '28, Opinion Writer",
    "text": "The tradition of study hall has been around nearly for as long as boarders can remember, dictating that under classmen boarders spend 7:30 PM to 9:30 PM on weeknights studying in their dorms. With an aim of fostering healthy studying habits, most dorms require freshmen to study in the common healthy study habits for room together; sophomores are given slightly more freedom, and junior and senior students can study anywhere they want. Despite its tradition and healthy intention, I believe the study hall policy is ineffective and demands changes. The execution of study hall fails to address the diverse heavily on self-disci- pline, which group study could undermine. This overly-regulated envi- ronment can diminish productivity and enthu- siasm for learning. I be- lieve students develop better study habits when they can choose locations that align with their per- sonal preferences. This way, freshmen can learn to exercise self-restraint and discipline, fostering The ultimate truth about this election is that there were only ever two candidates that could possibly win the presidency. This has been an unfortunate truth for Green Party candidate Jill Stein, who has never held an elected office higher than a town meeting representative in the Boston suburb of Lexington, Massachusetts. In addition, she ran-and lost-twice for Massachusetts Gov- ernor before running for president-and losing-twice for president. While she has yet to hold a notable elected position, some Democrats still... On one hand, celebrities' large platforms reach millions, an impact that amplifies political mes- sages and encourages voter participation-especially among younger voters who might not othing to sell [them out,\" now supports Trump. erwise engage in the election. On the other hand, celebrities endorsements can contribute to po- litical ignorance: often, they base their endorse ments on personal opinions and biases rather than informed, factual understandings of the po- litical landscape. Though celebrities can contrib- ute uniquely to political discourse, it's important to remember that they are only one person: their influence should not overshadow the informed, fact-based decision-making necessary to maintain democracy. Vivek Ramaswamy, who Xed on January 12, 2021 that \"what Trump did [the previous] week was... downright abhorrent,\" now says that Trump will \"unite this country.\" These politicians drastic changes in sentiment re- flect unignorable power-grabbing. It should be hard to believe that these politicians prioritize our best interests if they make massive flip- flops when it benefits them."
  },
  {
    "title": "Late Policy Needs a Grace Period",
    "author": "Ryan Reddy '28, Opinion Writer",
    "text": "\"Five lates is a detention.\" At first, this rule seems to pose no prob lems, until you check your schedule, only to realize you have language first period... on the oth er side of campus. Getting a tardy is one of the worst feelings, especial Late Policy Needs a Grace Period teachers are understand- Furthermore, fewer de signed for minor delays of standard tardy mark to en- sure that the grace period is treated as a privilege, not a ing, others strictly enforce tentions would contribute only one or two minutes. the rule, making an already to a more positive school Most teachers begin class challenging situation worse. climate, where students feel with announcements, a This variance demonstrates supported rather than con- warm-up, or a few minutes In short, a standardized the need for a simple, effec- tive solution: a standardized grace period. stantly punished for small of general review, so a short setbacks. By allowing a delay would not signifi- small buffer for uncontrol cantly disrupt the learning lable delays, students can process. Students using this Establishing a one-to- two-minute grace period feel more comfortable and small buffer would know in the student handbook less anxious about getting to they're being granted a favor would promote fairness and class. A grace period would and would likely enter the address the issues of tardi- also help students make the classroom respectfully, with ness more effectively. First, mental transition from rush- minimal disturbance. ly when one knows they an official grace period ing through the hallways to could have made it on would establish a consistent sitting down and engaging time with just a few ex- policy across all subjects in class. A slight decrease in Another potential con cern is that students might abuse the grace period, using tra minutes. It feels even and classrooms, eliminating pressure every single morn it regularly rather than only worse when tardies are the stress of varying teacher ing can lead to a healthier, when truly necessary. While beyond the student's con- expectations and creating more balanced school expe- it is reasonable to consid trol, like a broken alarm a fairer environment for all rience overall, allowing stu- er this possibility, there are clock or unexpected students. Students would no dents to have some flexibil practical countermeasures traffic. Landon Muzquiz longer need to worry about ity in their already full class that Milton can adopt in '28 recalls being late to which teacher is more le morning, and my teach- grace period would also en er marked me late, even courage better time manage though it was only two ment by allowing students minutes.\" Inconsistencies to focus on learning these in teachers responses skills without the immediate to tardiness only add to threat of detention for mi this stress; while some nor delays. schedules. Critics might argue that allowing a grace period could disrupt classes. They might say that if a student walks in late, they will dis order to prevent abuse. For instance, the grace period could be limited to a cer- tain number of uses per se- mester, with the attendance system automatically track- ing and deducting these in- stances. If a student reaches tract the other students who are already settled in and learning. However, this ar the maximum number of gument is flawed-a grace grace periods, any further period is specifically de- tardiness would result in a right to consistently be late. grace period would not only make tardiness poli- cies fairer but would also provide a structured, sup- portive environment where students can learn and grow. Allowing for minor, uncontrollable delays and acknowledging the realities of students' lives without compromising school ex- pectations would create a smoother start to the school day, help students manage their time, and reduce un- necessary stress. Ultimately, this small adjustment in the handbook would lead to a healthier school atmo- sphere where students feel better supported."
  },
  {
    "title": "Hot Takes",
    "author": "Editorial Board",
    "text": "Brady: I am the leader of the trio Rebekah: Capris and loafers are IN Isa: Flip flops: Free the dogs Char: People who back into parking spots are the scum of the earth Seyla: Regular tastes better than Diet Coke M James: bringing a water bottle with a straw to school is kinda weird Onur: jorts are ugly Gus: Put ALL the pineapple on my pizza GETS ITS WINGS"
  },
  {
    "title": "Beats per Measure",
    "author": "Unknown",
    "text": "Tired of Love - Penelope Road The Man Who Can’t Be Moved - The Script Headlock - Imogen Heap APT - ROSÉ Mantra - Jennie That’s So True - Gracie Abrams evermore - Taylor Swift Sweater Weather - The Neighborhood About You - The 1975 Evangeline - Cocteau Twins Cherry Pie - Sade Sticky - Tyler, the Creator Tears in Brasil - Piero Piccioni Please Don’t Make Me Cry - Lianne La Havas Bad Company - Yazmin Lacey Measures Up Doesn’t Measure Up Milton Nobles… Post-November 1 Weekend Editing apps on Halloween night - boo! Personal Narratives Personal Statements Angry lil history teacher >____< Furst glaring @ freshies SPOTLESS senior section Dirty stu… (we’re with you Mr. Furst) Ms. Reiser’s pug (new school mascot!) Stan the Stang IGF and beetle horns (sexy male) The Root effect"
  },
  {
    "title": "Varsity Football",
    "author": "Devan Kathiresan '26, Sports Writer",
    "text": "Like every year, Varsity Football entered the season with high expectations. After finishing last year’s season with a 4-4 win–loss record, the team was looking to make a big jump toward victory this season. However, after being riddled with injuries, the team has had to make slight adjustments to their game to continue winning. In Week 3 against St. Sebastian’s, the Mustangs lost their starting quarterback and team captain Qu’ran (Q) Mcneil ‘26 to a clavicle injury—essentially, a broken collarbone—that damaged team morale. Star wide receiver Kash Kelly ‘26 stated that, “[Q’s injury] was a huge loss for the team.” He continued, “the team knew if we wanted to succeed, a bunch of guys would have to step up.” According to Kelly, the team never lost faith despite the injuries many players encountered. Kelly also mentioned that McNeil’s injury didn’t stop him from help..."
  },
  {
    "title": "Girls' Cross Country Steals Boys' Shopping Cart",
    "author": "Ania Robinson '26, Sports Writer",
    "text": "On Friday, October 25, 2024, Girls’ Cross Country carried out an elaborate heist, stealing Boys’ Cross Country’s shopping cart for the first time in over four years The cart, full of cross country memorabilia, gets pushed around campus ev-ery Friday as the boys, also toting a billowing white flag, run blasting music. In-grained in Cross Country tradition is the girls’ weekly attempts to steal either the cart or the flag. Only, on Oc-tober 25, the girls succeed-ed. This Fall, the girls stole both the flag and the shop-ping cart—two objects that runner Emilia Raviola ‘26 stated are “cherished items for the boys.” Molly Shee-han ‘25, one of the girls’ captains, relayed that more than a decade ago “the boys found a shopping cart. Since then,” she continued, “[the upperclassmen girls] always tell the freshmen to get boys’ locker-room code the first week of practice” to try and steal the cart. Sheehan explained that this October’s robbery was the first successful one in all four of the years she has been on the team. Patrycja Pogor-zelska ‘26, another member of Girls’ Cross Country, says..."
  },
  {
    "title": "Crossword",
    "author": "Sissi Ma '26",
    "text": "It's Nobles Weekend! ACROSS 1 Get ____ for Nobles Weekend! 6 Where Samba and Wolfpack play 7..."
  },
  {
    "title": "What each department did on halloweekend and their Halloween costumes:",
    "author": "Unknown",
    "text": "English Costume: Karl Marx, but with a mini skirt…? Plans: - Start student recs - reading student essays and throwing them into the campfire…what does it matter… - threw a mega (blunder) party….brought up the imaginary relationship to your real conditions of existence History Costume: Sultry Salem Witches… Plans: - phones off, party on! - Carve out electoral prediction maps on pumpkins - Watching Rhys Adams ‘26 election predictions on Instagram live - Create manifesto for the next phone that falls in assembly Science Costume: Breaking Bad Plans: - Added extra kick to Halloween candy - Open (to everything) lab Languages Costume: Nurse Plans:"
  }
]
