{
  "11-8": [
    {
      "title": "Trump Won the Election. What Happens Next?",
      "author": "Senior Editorial Board",
      "text": "After 12 hours of counting votes, November 5th's Election Day decreed the winner of the United States' 47th Presidential Election as Former President Donald Trump. [cite: 2] Runner-up and current Vice President Kamala Harris lost the election at 44 electoral votes away from the 270 threshold. [cite: 3] As the U.S. approaches the Presidential Inauguration on January 20th, Americans must begin to imagine what the next four years under a Trump-Vance administration may entail. [cite: 4, 5] We, the Editorial Board, will outline the prevalent economic, legislative, and social agendas of the succeeding president. [cite: 6] Economics: The election of a Republican president enables the implementation of new economic policies that may contrast from Biden's. [cite: 7] In a speech at the Economic Club of New York on September 5th, Trump responded to concerns regarding inflation by highlighting that his economic plans “will rapidly defeat inflation, quickly bring down prices, and reignite explosive economic growth.” [cite: 7] Specifically, Trump, as expressed throughout his campaign, intends to target gas prices. [cite: 8] Analysts, however, claim that plans will not achieve this goal; these prices are largely out of his hands. [cite: 9, 10] Trump also has his sights on tax cuts and tariffs. [cite: 11] While the full extent and feasibility of the latter remains uncertain, some circulating plans include: extending his 2017 tax cuts, adding cuts in the corporate tax, and exempting tipped income and social security from federal taxes. [cite: 7, 12] Hoping to encourage U.S. manufacturing, Trump has proposed a 10% to 20% universal tariff on imports with levies of at least 60% on Chinese goods. [cite: 8, 9] The Tax Foundation estimates that a 10% universal tariff would raise $2 trillion in revenue for the federal government from 2025 through 2034, and a 20% tariff would raise $3.3 trillion. [cite: 12] However, it is estimated that households would pay an average of somewhere between $2,600 to $4,000 extra on consumer goods yearly because of these tariffs. [cite: 13] Taking into account the tax cut extension, analysts expect that Trump's tax plan will raise the national debt an estimated $7.75 trillion through 2035, twice that of Harris's proposed plan. [cite: 14] Reproductive Rights: While Vice President Kamala Harris enshrined abortion rights and reproductive freedom at the heart of her campaign, Trump has not provided a clear stance regarding the subject. [cite: 15] Although he took to his social media platform Truth Social to claim credit for “[being able to] kill Roe v. Wade,” Trump softened his position as the election neared, particularly after his running mate, current Vice President elect JD Vance, garnered negative attention in regard to his anti-abortion rhetoric. [cite: 16] Leading up to election day, Trump insisted that his “administration will be great for women and their reproductive rights;” [cite: 16] however, when asked whether or not he would veto a national abortion ban, he repeatedly sidelined the question. [cite: 17] Finally, in October, he made a social media post declaring that he would not “support a federal abortion ban, under any circumstances.” [cite: 18] However, given Trump's wavering stances on abortion, the safety of reproductive rights is not guaranteed. [cite: 19] One of the National Right to Life Committee's highly prioritized agenda items is the enforcement of the 1873 Comstock Act, a federal law that works to prohibit the mailing of anything associated with abortion, most notably including medical equipment used during abortions and contraceptives. [cite: 20] Roe v. Wade opened the law up to debate in the 1970s but never formally repealed it. [cite: 21] With Roe now gone, many conservatives see Trump's presidency as the perfect vehicle to restrict abortion nationwide, especially as such an agenda would not require a new federal law. [cite: 53, 54] Jonathan Mitchell, the legal spearhead of the 2021 Texas law that banned abortion in the state, told the New York Times that “we don't need a federal abortion ban when we have Comstock on the books.” [cite: 54] Mitchell even went as far as to urge anti-abortion groups to “keep their mouths shut as much as possible until the election” regarding this agenda. [cite: 54] Like his proceedings surrounding questions of a national abortion ban, Trump continuously avoided taking a firm stance regarding the Comstock Act, but, in August, he finally said that he would not use the statute to ban abortion drugs in the mail. [cite: 54] However, many people in his close circle, including JD Vance, have, on record, urged the opposite. [cite: 55] Additionally, Trump could restrict reproductive rights by appointing anti-abortion leaders to key agencies like the U.S Food Drug Association (FDA) and Department of Justice (DOJ). [cite: 56, 60] In October, three Republican attorneys general filed a lawsuit against the FDA to heavily limit access to Mifepristone, one of two drugs used to conduct abortions. [cite: 60] While the Supreme Court disregarded a similar complaint during the summer, these attorney generals hope they will find more success, arguing that the FDA has violated the Comstock Act by permitting these pills to be mailed. [cite: 60] While, in 2022, the Biden DOJ ruled that the statute does not criminalize this behavior if the sender lacks unlawful intent, the Trump DOJ could interpret the law differently. [cite: 61] In his first presidential term, Trump appointed anti-abortion judge Matthew Kacsmaryk to a federal court in Texas, and Kacsmaryk greenlit the now overturned complaint that the FDA should restrict access to mifepristone. [cite: 61] Moreover, the anti-abortion movement has been clear in their long-term goal to establish “fetal personhood,” endowing fetuses, embryos, and fertilized eggs with full human rights. [cite: 471] Thus while Trump may insist that he will protect reproductive rights, his anti-abortion judicial picks and their plans to codify a fetal personhood standard could do the exact opposite, leading to not only the complete ban of abortion but also of birth control and in vitro fertilization. [cite: 472] Environment: The election of Donald Trump poses a major threat to movements to combat climate change. [cite: 473] As a part of his “Day 1” plan, Trump has outlined his intentions to “drill, baby, drill,” a punchy phrase he used for his objective to increase oil drilling. [cite: 474] Additionally, during his speech after getting elected, Trump explained that “we have more liquid gold than any country in the world” when referring to potential domestic oil drilling. [cite: 475] Trump is committed to deregulating oil drilling to maximize production. [cite: 476] However, the environmental cost of this plan may outweigh its speculated benefits. [cite: 477] Oil drilling is one of the leading causes of climate change as it releases pollutants into the atmosphere and greatly damages the ecosystem where the drilling takes place. [cite: 478] Trump claims that lifting the environmental regulations of oil companies will lower gas prices. [cite: 479] However, climate and energy analysts such as Maxine Joselow from the Washington Post detail that the price of gas is most heavily influenced by the coalition of oil-producing corporations. [cite: 480] The U.S. government itself doesn't have control over the cost of gas. [cite: 481] Thus, the problem lies in the dependence on the fossil fuel industry, not the regulations on oil corporations. [cite: 482] Moreover, Trump has also described his plans to reverse pre-existing environmental policies. [cite: 483] Specifically, in his October New York Rally, Trump referred to Biden's Inflation Reduction Act (IRA) policy as the “green new scam,” and later detailed his desire to “terminate” it. [cite: 484] The IRA, one of the largest pieces of federal legislation that addresses climate change, spells out environmental regulations and benefit systems to prioritize the reduction of carbon emissions while also reducing inflation. [cite: 485] Additionally, Trump threatens the Environmental Protection Agency (EPA); the Trump Administration specifically targeted EPA during its last term. [cite: 486] Within four years, the executive branch rolled back 98 environmental policies that included numerous air quality, water pollution, toxic chemicals, and greenhouse gas emission regulations. [cite: 487, 497] Although some of these policies were reinstated under the Biden Administration, Trump's continuous prioritization of the fossil fuel industry jeopardizes these regulations. [cite: 498] Moreover, a recent EPA rule instituted in April forces power plants that generate electricity through burning coal to reduce their carbon emissions by 90% in the next 8 years. [cite: 499] This effective regulation could immensely benefit the environment. [cite: 500] However, the Republican party has specifically filed against this regulation. [cite: 501] With Trump elected, the Justice Department is unlikely to defend it. [cite: 502] Throughout Trump's political career, he has frequently declared that he does not even believe in climate change. [cite: 503]"
    },
    {
      "title": "Students React to October 22 Israel-Palestine Panel",
      "author": "Amy Khaing '27 News Writer",
      "text": "On Tuesday, October 22, all Upper School students gathered in the ACC for “The Prospects for Peace in the Middle East” about the ongoing conflict in that region. [cite: 22] The DEIJ office organized the panel, which featured Ghaith al-Omari, a former executive director of the American Task Force on Palestine and former member of the Palestinian Authority, and Ambassador Dennis Ross, a William Davidson Distinguished Fellow at the Washington Institute for Near East Policy. [cite: 22, 23] Deepak Malhotra P '26 '27, an author and professor at Harvard Business School, moderated the discussion. [cite: 23] This panel was the second part of a series focused on the conflict between Israel and Hamas, a conflict which has recently expanded to include other parties and theaters. [cite: 25, 26] Earlier this month, moderators from the Public Issues Board hosted “An Overview of the Ongoing Crisis in the Middle East.” [cite: 27] Director of Equity and Inclusion Melissa Lawlor explained that this initial panel, hosted October 9, “was actually part of the programmatic rollout… it was mandatory so [students] can have a solid foundation to understand the events.” [cite: 24, 27] Overall, she said, the goal for these panels was for “students to hear multiple voices and perspectives,” and the selection of panelists “was made by a committee of Milton faculty, staff, parents, students, and administrators.” [cite: 25, 26, 27] For Elizabeth Sim '27, Malhotra's psychology ice-breaker left an impression. [cite: 27] She was surprised to know “how people are more inclined to stick to their own beliefs instead of listening to others' perspectives.” [cite: 27] Cynthia Lee '28 appreciated the speakers' ability “to share their opinions without jumping to conclusions,” [cite: 24, 28] and Amelia Joseph '28 enjoyed how “the mediator didn't have a strong bias.” [cite: 24] While Rhys Adams '26 “had a very good time,” he expressed his concern about the speaker selection, since he believes both panelists are biased due to “the nature of their jobs as former diplomats in America.” [cite: 25, 26] Additionally, he mentioned that they are part of a “largely pro-Israel think tank,” but he also acknowledged that the bias might be simply a “function of being in America.” [cite: 28] During the panel, Malhotra asked al-Omari and Ross whether they believed the conflict could be resolved within ten years. [cite: 24, 25] The two speakers agreed on a 60-70% likelihood. [cite: 25] The mediator, however, held a lower estimate of 30-35%. [cite: 25] Malhotra considered a conflict resolution “still possible to achieve,” but stated that it “will require a lot of hard work and a number of things to go right.” [cite: 26, 27] Adams' estimate is even lower, “a 20% chance, as he believes there is a potential for massive displacement of people in the West Bank and Gaza.” [cite: 28] Joseph thinks the timeliness of conflict resolution will largely “depend on what countries get involved.” [cite: 56] The panel has sparked ongoing discussions across campus. [cite: 57] Math teacher and SAMENA advisor Michael Kassatly said that though he “generally doesn't find people in this country to be well-informed on global issues,” he believes that “Milton students know far more than the average American student on this conflict.” [cite: 57] While Lawlor states that the DEIJ office is making efforts “to engage students as critical thinkers,” several students have called for improvements. [cite: 58] The panelists answered only a few student questions due to limited time, but Mariana dos Santos '25 felt that “an extended Q&A would [have been] nice.” [cite: 59] Kassatly agrees, as he “personally [gets] frustrated when there isn't enough time to answer amazing questions by the student body.” [cite: 60] Bain Coyne '26 proposed another potential improvement, suggesting that “these important conversations [should be held] in areas where students can pay attention,” and called for a location besides the ACC. [cite: 488, 492] Gustavo dos Reis '26 thinks the school will benefit from “a diverse pool of speakers who talk about different topics” so “students get a better overview of world issues rather than just ones that directly relate to the U.S.” [cite: 488, 489, 493] After receiving the feedback, Lawlor noted that the organizers “did hold an extended Q&A for the panel in the FMC.” [cite: 489, 490, 493] She said the DEIJ office “[tried] to have one at every event when possible,” but they “often have to work around the speakers' schedules.” [cite: 490, 493] Considering the location choice, Lawlor “completely agrees that the ACC is tough to listen” in; however, she also mentioned that “it is the only space on campus that fits the entire student body and Milton does not have “a theater that could hold 1000 people.” [cite: 491, 494] Thus, if the DEIJ “were to hold [the panel] anywhere else, [they] would have to choose who could attend.” [cite: 495, 505] In response to the critique of biases in panelists, Lawlor asserts that “the interpretation of the pro-Israel bias is [that] student's opinion; if that is what they took away, that is their takeaway.” [cite: 492, 496, 506] Editorial note: While the three all-school panels featured American and Palestinian speakers, no Israeli speakers were included in the DEIJ's programming. [cite: 492, 497, 507] The Jewish Student Union did bring an Israeli survivor of the October 7th attacks to speak for an optional presentation in the Goodwin Room that was attended by about 50 students. [cite: 492, 504, 508]"
    },
    {
      "title": "Confronting our Political Blind Spots After the Election",
      "author": "Eli Berk '26, Seline Shahzad '26, and Emilia Raviola '26 Section Editors",
      "text": "Returning to campus after the night of the election, we found ourselves in conversations of disappointment, yes, but also of surprise. [cite: 33] Naturally, a Harris-Walz win was not guaranteed, as complaints of the current Biden administration's policies sullied the Harris name to many, but many of us expected the race to be nevertheless a close one. [cite: 34] Yet Trump began with an early lead and ended the race with 295 electoral votes, far surpassing the 270 votes required to win the election. [cite: 35] Notably, Trump also received the support of around 50.8% of voters, making him the first Republican to win the popular vote since 2004. [cite: 36] Despite how arguably expected the election results came out to be, it's undeniable that shock is what we feel before the uncertainty of what's to come in the next four years. [cite: 36] Our progressive Milton bubble quickly, harshly, burst. [cite: 37] What perpetuates the existence of this bubble? [cite: 37] Why do students who come from all reaches of the world fall victim to distorted perspectives of the rest of society? [cite: 38] We believe there are three main reasons that create this mirage. [cite: 39] The first being that we, as a student body, are simply not politically engaged. [cite: 40] Our main political clubs lean liberal without conservative counterparts. [cite: 41] Student perspectives become based solely on one-half of the political world. [cite: 41] Furthermore, with Democratic opinions frequenting above Republican ones in Upper School announcements and speakers, students who do have opposing viewpoints may view their opinions as “against the grain” and therefore controversial. [cite: 42] Without proper political representation in public settings, we—as an institution—create an echo chamber for one side of American politics, resulting in skewed and perhaps out-of-touch perceptions of the U.S. political state. [cite: 43] We must also acknowledge how social media feeds into our political misperceptions. [cite: 51] If you spend as much time on TikTok as many of us, you've most likely witnessed the wave of “Kamala brat Summer” followed by a surge of “trendy” content pushed out by her official account @kamalahq. [cite: 52] The phenomenon began when English singer-songwriter Charlie XCX, who released the viral album, brat, this June, tweeted “Kamala is brat.” [cite: 53] This seemingly organic correlation between the Vice President and a niche joke among Gen Z catalyzed strong support for Harris among younger social media users. [cite: 44] More analytically, this trend serves as an example of how social media—for good or bad—influences our perceptions of political candidates, without our cognizance of their policies. [cite: 44] Furthermore, while the positive comments and support that Harris' content was receiving may have supported the perception that America was overwhelming in support for the Vice President, such unanimity in beliefs may only exist within the highly curated, algorithmic spaces of social media. [cite: 44, 45] Within our campus, social media disconnects our understanding of the outer Milton political state. [cite: 45] Dr. Lawlor, amongst others, frequently stresses the importance of listening for the sake of listening, of addressing and silencing our biases, of leaning in with an open mind, even if just momentarily. [cite: 45] Yet, our behavior seldom measures up. [cite: 45] On Thursday, November 10th, the Heyburn lecture which replaced Club Blocks 2 and 3 featured quite preposterous assembly etiquette. [cite: 46] In the bleachers, shuffles of whispering students and clamors of dropping phones peppered Jonathan Schroeder '99's hour-long speech. [cite: 47] It seems that despite impassioned harps and flowery emails from disappointed (history) teachers, as a student body we still lack simple skills of respect and empathy—skills essential toward not only USPs but also political education. [cite: 48] We did not want to listen, and we didn't give him the time of day. [cite: 49] We cannot treat politics in the same manner. [cite: 50] This attitude that we are “above” devoting our attention to someone—regardless of their beliefs or allure—cannot move us forward. [cite: 50] We can lob insults at those in opposition to our political stance, or simply choose to ignore their rhetoric, but at the end of the day, as “crazy,” as we may deem individuals' beliefs, they too hold political power. [cite: 51, 53] To view our opponents as below us is a disservice to ourselves and our causes. [cite: 53]"
    },
    {
      "title": "SAA Launches First Annual Fall Festival",
      "author": "Gustavo dos Reis '26 News Writer",
      "text": "Fall Festival took place from 7-10pm on October 25, 2024; [cite: 509] the Student Activities Association's event, the first of its kind, included fall-themed food and activities, such as the Giant Mechanical Pumpkin and lots of apple cider donuts. [cite: 510] “The event went so well!” said Rhia Patel '26, an SAA board member. [cite: 511] “There was a great turnout (Director of Student Activities Kelly Reiser estimated that 250 students attended), and students of all different grade levels came. [cite: 512] There was an endless amount of activities, and the vibe was so great.” [cite: 512] Though the Fall Festival happened for the first time this year, members of the Student Activities Association have been considering this event since last year. [cite: 513] Maya Hindawi '26, another representative on the SAA board, explained that “[the SAA] started off with the usual Halloween dance and then realized that the effort [they] usually put into the Halloween dance does not always pay off.” [cite: 514] This year, however, instead of throwing what they thought would end up a largely empty Halloween party, the SAA organized the new event. [cite: 514] Vennie Xiao '26, who attended the event, agreed with Patel. [cite: 515] “It was so fun. The food was delicious, and the activities were great. SAA definitely surprised me with this one.” [cite: 516] If Xiao '26 could change something about the event, however, “[she] would move it earlier in the day.” [cite: 517] “I thought the [Fall Festival] was great. [cite: 518] I mean, there were tons of people there and fun activities. [cite: 518] There was also a balanced amount of upperclassmen and underclassmen,” Reiser shared. [cite: 518] Not every student enjoyed the event, however. [cite: 521] To Preston Tsang '27, for instance, the event had “a great atmosphere because of the amount of people who showed up… [but] the activities could [have] been more interesting.” [cite: 521] According to Tsang, “the most fun activity was the Mechanical Pumpkin ride. [cite: 519] Even so, who likes riding a pumpkin?” [cite: 520] Anthony Wu '27 agreed with Tsang. [cite: 520] “All of the kids who showed up made the atmosphere better, but the activities of the event could [have been] more varied,” added Wu. [cite: 520] Kairo Diaz-Archilla '28, on the other hand, thought “it was really fun, and [one] could tell how much effort was put into hosting the event, especially from Ms. Reiser and the SAA representatives.” [cite: 521] To Diaz-Archilla, “the Fall Festival had the same energy as the Quadival.” [cite: 522] The only downside, according to him, was the “lack of senior presence at the event.” [cite: 525] He believes that it is now SAA's responsibility to “better integrate seniors.” [cite: 526] Head Monitor Ariam Gebresilassie '25 shared her opinions as well: “I think student turnout has improved; [cite: 527] SAA has done a really good job at catering to what the students respond to rather than forcing the same tired event ideas.” [cite: 528] “The few weeks leading up to the event, the whole board got involved with planning, creating fliers, and advertising. [cite: 522] Additionally, the Milton Art Club helped with things like the photo stand,” stated Patel, describing the process behind organizing the Fall Festival. [cite: 522] The planning of the actual structure of the event involved first creating a table-placement map. [cite: 523] Then, SAA representatives were assigned to a specific table and ran the activities of their specific table throughout the event. [cite: 524] Following the Fall Festival, Reiser and SAA representatives met to evaluate the quality of the event. [cite: 526] Though the board found small changes that they want to make to the event, the Fall Festival will return next year. [cite: 527] Although she deemed the Fall Festival successful, Patel pointed out that “to keep running these events definitely requires a ton of student body involvement.” [cite: 528]"
    },
    {
      "title": "Moco Aims to Spark a New Era of Engagement in Class III",
      "author": "Dilan Payne '27 News Writer",
      "text": "On Friday, November 1, Class III students gathered in Ware's Goodwin Room for the first-ever “Moco,” a reimagined sophomore class dance designed to foster unity and promote school spirit. [cite: 529] Class III Representative Madeleine Wu estimated that 75-80 students attended. [cite: 530] Some attending students felt that the event successfully created a lively environment and laid the groundwork for greater engagement among the sophomore class in school events. [cite: 531] Sophomore Class Dean Molly Swain explained that, from the deans' perspective, “the class reps did the legwork.” [cite: 532] Typically, class representatives and deans find themselves defaulting to a Winter Ball—this year, however, Wu and her counterpart Hugh Kramer '27 “truly invested,” according to Swain, beginning preparations as early as the first week of school to ensure the dance would take place in November, a time Swain described as “celebratory.” [cite: 533] For Wu and Kramer, the vision was clear from the outset: they wanted a homecoming—a familiar concept that they felt would undeniably spark excitement. [cite: 534] “We wanted it to be something people knew,” explained Wu, referring to their rebranding effort aimed at boosting student engagement. [cite: 535] The representatives initially wanted to call the dance a homecoming, a familiar label for high school dances, but the administration did not allow this. [cite: 538] Kramer stated that “they wanted to distance themselves from an excessive drinking culture associated with college homecomings.” [cite: 539] Instead, they dubbed the event “Moco,” a combination of “Milton” and “hoco,” a common shortening of “homecoming.” [cite: 535, 540] However, the class representatives' efforts extended beyond this rebranding, incorporating interactive elements in an attempt to excite more sophomores. [cite: 536] Kramer explained that “[he and Wu] want to create a more cohesive community. [cite: 537] We all have our separate friend groups, and hear the terms DSG and DSB being thrown around.” [cite: 537] But in attempts to “get people who normally don't talk to each other to interact,” Kramer and Wu devised a personalized website, “mocomatch.com,” which paired students at random and challenged each duo to take a photo together and submit it to the representatives for a prize. [cite: 540] “It was never a match.com or a dating app,” Kramer clarified. [cite: 540] “It was just about having a good time together.” [cite: 540] In planning Moco, Wu and Kramer hoped to address what they perceive as a trend in dance attendance. [cite: 540] “Traditionally, most dances are something that only particular friend groups were going to,” Kramer added. [cite: 541] “We were really trying to integrate the grade through this event.” [cite: 542] For those who attended, the atmosphere in Goodwin Room was energetic. [cite: 543] While the turnout didn't fill the room, Kramer assured attendees that they “didn't need a full room to have fun.” [cite: 544] According to Dylan Cafferty '27, a Class III class council member, Moco was “far better than last year's dance.” [cite: 545] Kramer and Wu agreed they were “really happy with the way it turned out.” [cite: 545] Yet Kramer reflected that “it would have been a better time with even more people showing up.” [cite: 546] With Halloween weekend, games, and team dinners competing for attention, Goodwin Room was not filled to capacity. [cite: 546] Kramer recalled an SGA slideshow presented at the beginning of the year, which explained that “around fifty percent of our students say we have school spirit, and the other fifty percent say we don't. [cite: 541, 542] I think the ones who say we don't have school spirit are the ones who don't make an effort to show up to events like these.” [cite: 542] “We are hoping that Moco is just the start,” said Kramer. [cite: 546] “It's about showing up for each other and making these events something everyone looks forward to, which will only happen with more attendance.” [cite: 546] As he finished reflecting on the night, Kramer walked away repeating a phrase he hopes will become a guiding principle for Class III: “Showing up is nice. [cite: 547] Showing up is nice. Showing up is nice.” [cite: 547]"
    },
    {
      "title": "Forbes Can Improve Lunch Crowd Management",
      "author": "Daniyal Mian '28 Opinion Writer",
      "text": "Lunch at the Forbes Dining Hall is a pillar of school life for students. [cite: 140] With a wide array of hot food options, a salad bar, a dessert section, and more, the average Miltonian has access to a multitude of delicious meals. [cite: 142] Enjoying such meals, however, can be a challenge characterized by long, winding, and unmonitored lines. [cite: 143] Students circulating the serving areas in haphazard, undefined directions, creates an overall sense of chaos. [cite: 151] This congestion and disorder can make it challenging for students to get the food they want and have enough time to eat it. [cite: 153] Currently, all the areas to get food are located in the same general location (excluding the dessert bar), causing traffic for students trying to move to various stations for meals. [cite: 155] To address this, different options could be strategically moved to separate areas, but not in a manner that leads to even more crowding (such as placing the salad bar behind cafeteria tables that are not easily navigable). [cite: 549] Forbes can implement a shorter pathway that encircles the dining hall itself, allowing students to branch off the designated path for some options and rejoin further along. [cite: 145] Clearly defined entry and exit points can be added to allow students to get out of line if they chose and to enable students to walk through longer lines that could lead to blockages. [cite: 143, 149] The first critical step to improving congestion in the dining hall is maintaining a stable system to manage students circulating in the area. [cite: 151] To do this, it may be necessary to reorganize the serving locations. [cite: 155] A similar plan is executed in airports, which slowly shepherds travelers into different, clearly defined lines for check-in booths to save time and prevent large swells of people from forming. [cite: 154] Forbes can also address the congestion by adding crowd control stanchions and retractable rope barriers, used to manage large crowds at museums or airports, creating specified lanes for students to walk through en route to different food options. [cite: 550] In addition, Forbes would benefit from implementing vertical serving infrastructure. [cite: 147] Having serving areas spread out on the ground of the dining hall takes up a great amount of space, indirectly creating difficult navigation. [cite: 148, 150] Vertical alternatives would fill less space while still allowing students to collect their food. [cite: 148] Though, it is important to note that these vertical options would most likely only work with lower-demand fruit and vegetable options that do not need to be replaced regularly. [cite: 148, 550] Finally, Milton might consider creating a third lunch period. [cite: 140, 551] To do so, the earliest lunch could be moved forward to make time for the new third lunch, and the late lunch would start later than it currently does—the details, however, would have to be decided by the administration. [cite: 140, 141, 144] It is clear that Milton has numerous options available to address the issues that Forbes Dining Hall suffers from due to congestion and crowd overall management, but it remains to be seen if any direct action will be taken. [cite: 145, 152] Issues with cafeteria crowd management are not limited to Milton Academy itself, luckily for Milton students, however, Forbes has much untapped potential for improvements that can make lunches much more enjoyable for everyone. [cite: 154, 156, 549]"
    },
    {
      "title": "End the Ineffective Policy of Freshman Study Hall and Maximizé Quiet Hours",
      "author": "Mike Gao '28 Opinion Writer",
      "text": "I believe students develop better study habits when they can choose locations that align with their personal preferences. [cite: 201] This way, freshmen can learn to exercise self-discipline, which group study could undermine. [cite: 200, 202] This overly-regulated environment can diminish productivity and enthusiasm for learning. [cite: 200] While it is reasonable to consider this possibility, there are practical countermeasures that Milton can adopt in order to prevent abuse. [cite: 294] For instance, the grace period could be limited to a certain number of uses per semester, with the attendance system automatically tracking and deducting these instances. [cite: 295] If a student reaches the maximum number of grace periods, any further tardiness would result in a right to consistently be late. [cite: 297] A grace period would not only make tardiness policies fairer but would also provide a structured, supportive environment where students can learn and grow. [cite: 298] Allowing for minor, uncontrollable delays and acknowledging the realities of students' lives without compromising school expectations would create a smoother start to the school day, help students manage their time, and reduce unnecessary stress. [cite: 299] Ultimately, this small adjustment in the handbook would lead to a healthier school atmosphere where students feel better supported. [cite: 300]"
    },
    {
      "title": "Athletes Discuss Equity at Changemakers Conference",
      "author": "Tiffany Jin '28 News Writer",
      "text": "On Monday, October 21, twelve Milton students attended the third annual ISL Changemakers Conference on Racial Equity and Justice, hosted by Lawrence Academy. [cite: 156] According to Director of Equity and Inclusion Melissa Lawlor, the ISL Changemakers Conference, which originated at Milton aimed to bridge the gap between athletics and DEIJ initiatives, enabling student-athletes to foster conversations and effect change within the Independent School League (ISL). [cite: 157] Lawlor highlighted the conference's purpose, stating that “it's really about harnessing the power and leveraging the social capital of our athletes to lead the work of raising aware—...” [cite: 158]"
    },
    {
      "title": "Forbes Recycling Pilot Does Not Yet Live Up to Its Potential",
      "author": "Solomon Fleiss '28 Opinion Writer",
      "text": "Forbes Dining Hall, in partnership with Aramark, introduced a pilot program on October 22 to reduce the volume of single-use containers on campus through reusable eco-friendly carryout containers. [cite: 253] For reference,..." [cite: 254]
    },
    {
      "title": "Varsity Football Comes Up Short on Season",
      "author": "Devan Kathiresan ‘26 Sports Writer",
      "text": "Like every year, Varsity Football entered the season with high expectations. [cite: 303, 304] After finishing last year's season with a 4-4 win–loss record, the team was looking to make a big jump toward victory this season. [cite: 305] However, after being... [cite: 306] end of the season with sadness, football kicker Tom Breeze '25 is “handling [his last season] pretty well.” [cite: 346] He continued, “Milton keeps you busy, so moving on after the season will be met with academic demands” that will keep him from getting too sentimental. [cite: 347] Also turning their focus onward are Josh Partal '25 and Silas Lawrence '25, both of whom are committed to collegiate soccer—at Stanford University and Trinity College, respectively. [cite: 349] Jennifer Li '26 commented, reflecting her belief that “when students commit to collegiate sports, it helps keep them focused on a positive future, rather than mourn past seasons lost.” [cite: 350] That is not to say, however, that introspective athletes like Sheehan aren't excited for the future. [cite: 351] “Yes, it'll be sad to leave behind the team community,” said Sheehan, “...” [cite: 352]
"
    },
    {
      "title": "Cross Country Steals the Cart",
      "author": "Ania Robinson ‘26 Sports Writer",
      "text": "On Friday, October 25, 2024, Girls’ Cross Country carried out an elaborate heist, stealing Boys’ Cross Country’s shopping cart for the first time in over four years. [cite: 366] The cart, full of cross country memorabilia, gets pushed around campus every Friday as the boys, also toting a billowing white flag, run blasting music. [cite: 367] In-grained in Cross Country tradition is the girls' weekly attempts to steal either the cart or the flag. [cite: 368] Only, on October 25, the girls succeeded. [cite: 369] This Fall, the girls stole both the flag and the shopping cart—two objects that runner Emilia Raviola '26 stated are “cherished items for the boys.” [cite: 369] Molly Sheehan '25, one of the girls’ captains, relayed that more than a decade ago “the boys found a shopping cart. [cite: 370] Since then,” she continued, “[the upperclassmen girls] always tell the freshmen to get boys’ locker-room code the first week of practice” to try and steal the cart. [cite: 370] Sheehan explained that this October's robbery was the first successful one in all four of the years she has been on the team. [cite: 371] Patrycja Pogorzelska '26, another member of Girls’ Cross Country, says that “I heard it's a rare occurrence.” [cite: 372] None of the boys on the Cross Country team could remember a time that the cart had been successfully stolen while they were at Milton. [cite: 373]"
    }
  ]
}