[
  {
    "title": "TEDx MiltonAcademy Amplifies Student Voices",
    "author": "Dilan Payne '27 News Writer",
    "text": "On December 12, Milton Academy's Thacher Room welcomed a line up of five speakers as TEDxMilton Academy hosted another evening of student-led talks. [cite: 454, 455] The TEDx event, featuring five speakers-including four students aimed to spark deep discussions and meaningful connections among the community, all while addressing topics ranging from healthcare inequity to the neurological power of music. [cite: 455, 456, 458] TEDX, a grassroots initiative created to fulfill TED's overall mission to research and discover \"ideas worth spreading,\" brings the spirit of TED to local communities around the globe. [cite: 456] TEDx hosts over 3000 events annually. [cite: 456] Rhia Patel 26, one of the speakers, has advocated for menstrual equity since middle school, working with local student-led coalitions that inspired her to investigate public health issues impacting young girls. [cite: 454] Spreading her knowledge to the greater Milton community, Rhia drew upon her advocacy work with Free Period Talk, an interscholastic coalition, in her speech. [cite: 455, 456] Yet, Patel noted that \"TEDx is really different from what I have previously done with student-led advocacy.\" [cite: 457] Patel planned to discuss grassroots \"the educational aspect as well as my own story with menstrual advocacy, rather than others' stories.\" [cite: 458] When first applying to Milton, Patel learned about the 2022 TEDx event while reading through the talks. [cite: 459] \"I thought it was really cool that students can have the opportunity to share their experiences and things that matter to them,\" she stated. [cite: 460] Yet she hesitated, unsure of her ability to follow in those students' footsteps. [cite: 461] After applying with a one-page outline of her speech and low expectations, Patel was accepted by the co-heads of TEDx to speak on women's and girls' healthcare and education. [cite: 462] Stepping outside of Milton's critical writing style, Patel instead approached her passion with a deeply personal and reflective lens, utilizing the TEDx platform to share her journey through advocacy and call the greater community to action. [cite: 463] Hoping her speech will \"have a positive impact,\" Patel aimed to spark dialogue around girls' healthcare education. [cite: 464, 524] \"I hope people will recognize that there are certain issues, especially in girls' healthcare education, that are not new, but rather, ignored.\" [cite: 525] For Devan Agrawal '25, TEDx provides a platform to connect his personal experiences with Alzheimer's Disease to music, exploring the intersection of the two and the ways in which music is a powerful tool for memory and healing. [cite: 526] In his talk, \"Echoes of a Melody: Music's Power to Treat Alzheimer's Disease,\" Agrawal planned to share how music allowed his grandmother to reconnect with memories lost to Alzheimer's. [cite: 527] Music \"acts as a universal language for humanity,\" he explained. [cite: 528] \"It's hard wired into our DNA.\" [cite: 528] Blending personal anecdotes with scientific insight, Agrawal illustrated music's power not only to rekindle forgotten memories but also to serve as a preventative tool against cognitive decline. [cite: 529] Urging audience members to \"consider creating a soundtrack for [their] lives,\" Agrawal hoped to help others preserve important memories while fostering connections to family and friends. [cite: 530] Additional speakers included Ryan Farokhzad 25, who presented on innovative disease therapies; [cite: 531] Simon Farruqui '25, who delved into computational politics; [cite: 532, 538] and Spanish teacher Marisela Funes, who shared her reflections on living \"in the in-between.\" [cite: 539] Each talk promised to blend research and personal experience, remaining true to the TEDx spirit of sparking discussion and connection. [cite: 540] Some speeches had the intention not only of informing but also of inspiring action. [cite: 541] Patel, for instance, hoped her talk resonated with young girls in the audience. [cite: 542] \"I want them to feel like they don't have to be ashamed to talk about menstruation, and that they can do anything in the world- no one should tell them they can't.\" [cite: 543] She hoped her speech would encourage her audience not only to recognize systemic inequities but also to respond to them. [cite: 544] Agrawal echoed similar sentiments, hoping his talk will \"encourage people to see music's power in a new light.\" [cite: 545] As a roaring final applause filled the Thacher Room, TEDxMiltonAcademy hoped to remind its audience of the transformative power of sharing stories. [cite: 546] Whether through Patel's call for menstrual education and equality or Agrawal's harmonious blend of memory and music, the event, following TEDx's mission, aimed to ignite curiosity, foster connection, and inspire action, while attempting to prove that often, the most profound change can begin with a single voice. [cite: 547] Editor's Note: This story was written and edited before the event on Thursday evening. [cite: 548]"
  },
  {
    "title": "Quiz Bowl Team Qualifies for WGBH Quiz Show",
    "author": "Tiffany Jin '28 News Writer",
    "text": "On Sunday, November 17, the Quiz Bowl Team achieved a significant milestone by qualifying for the WGBH High School Quiz Show. [cite: 464] Now in its sixteenth season, the show is an award-winning single-elimination academic team competition for Massachusetts high school students. [cite: 465] Milton secured one of the two wildcards, reserved for the two highest-ranked teams that haven't participated in the past five years and did not qualify with one of the fifteen highest scores. [cite: 466] The team will now face Deerfield Academy in the season's first televised episode, competing for the sixteenth and final position on the official tournament bracket. [cite: 467] The episode will feature four rounds of gameplay-Toss-Up, Head-to-Head, Category, and Lightning-and is set to film on January 25. [cite: 468] It will be uploaded on the High School Quiz Show YouTube channel on February 8. [cite: 468] If the team progresses, more episodes will be filmed on February 2, and they will air gradually. [cite: 468] The Milton team, composed of four primary team members and two alternates, was formed after consideration of club attendance and seniority. [cite: 469] Primary team members are Eli Berk '26, Alex Sherman '27, Simon Picotte 25, and Nam Nguyen '25. [cite: 470, 532] Alternates are Rhys Adams 26 and Solomon Fleiss 28. [cite: 533] Fleiss shared his motivation for joining: \"I have always had an interest in random facts and trivia, and the Quiz Bowl seemed like the perfect place to execute these passions.\" [cite: 533] Captains Berk and Picotte initially struggled to navigate the club application process and secure faculty permission last year. [cite: 534] Ultimately, the group moved forward as a \"team\" rather than a \"club.\" [cite: 535] Although their first year of competition ended without qualification, the experience proved valuable. [cite: 536] This year, the team began meeting every week since the start of school. [cite: 537] Practices were structured to sharpen their knowledge in key categories, including Math, Science, History, Geography, Literature, The Arts, Current Events, Civics, Sports, and Pop Culture. [cite: 553] \"At first, I was unsure of what we were going to do as alternates,\" Fleiss admitted, \"but it's actually very engaging to be an alternate-they still let you run through all the questions.\" [cite: 554] The qualification test consisted of five questions in each of the ten categories above to be answered in 45 minutes as a team. [cite: 555] \"The time [wasn't] really a pressure,\" Berk explained. [cite: 556] \"The thing with Quiz Bowl is either you know it or you don't. [cite: 556] There were no deductions for wrong answers so sometimes we just had to make up a guess and hope it's right.\" [cite: 556] Having participated in last year's qualification process, Picotte noted that the team felt more prepared this time around. [cite: 557] However, confidence wavered after the test, \"Walking out, I remember not feeling too confident\" Berk recalled. [cite: 558] Fleiss added, \"[Qualifying] was such exciting news, it was really an unexpected surprise to all of us.\" [cite: 559] Librarian Beth Reardon, who has prior experience coaching Quiz Bowl and was once a contestant on Jeopardy!, offered unique insights into the value of such competitions. [cite: 560] \"It's a really different activity\" she explained. [cite: 561] \"It's fun to execute the knowledge you've gained in the classroom which might not be used in your everyday life. [cite: 561] Stepping outside your box and going on TV is a big deal. [cite: 561] [When I was on Jeopardy], the lights and TV cameras were intimidating, but I kept thinking, I could win this whole thing.\" [cite: 561] Science teacher Joanna Latham, the faculty sponsor of the team, expressed her pride in the captains' efforts. [cite: 562] \"[Qualifying was] so exciting! [cite: 563] Eli and Simon had this vision, passion, and excitement... [cite: 563] They've come so far from the initial kernel of an idea.\" [cite: 564] Looking ahead, Berk and Picotte hope to expand and formalize the team for the future years. [cite: 565] \"We really think that there are a lot of talented people at Milton who would be really good at [Quiz Bowl],\" Picotte said, \"We encourage everyone to give it a try. [cite: 566] The more people that are excited about Quiz Bowl, the more competitive our team can be.\" [cite: 566, 567] Latham echoed this sentiment, stating that \"the high-stakes experience of being in a competition like this that's televised is so valuable. [cite: 567] Being able to dig into something, pursue it with passion, and then just take it to this next level is where the fun comes from.\" [cite: 567]"
  },
  {
    "title": "Winter Assembly Ditches \"Religious Undertones,\" Rebrands to \"Community\"",
    "author": "Raphael Rufino '27 A&E Writer",
    "text": "The Winter assembly on Thursday, December 19th, 2024 will host multiple performances, including high school Orchestra and Jazz groups, middle school Glee Club, and the highly anticipated third grade and senior year \"lifer\" Collaborative Song. [cite: 470] The staple performance returns this year-however, it will look different. [cite: 471] The previous song, \"Children, GO Where I Send Thee,\" by Kenny Rogers contained many Christmas connotations, drawing from both the Old and New Testaments. [cite: 471] It highlights key biblical figures and events, such as the birth of Jesus in Bethlehem, Paul and Silas' missionary work, and the Hebrew children in the fiery furnace. [cite: 472] Due to these references, the administration removed the song, along with every other religious song historically performed at the assembly. [cite: 473] Manager of Events Cory Butler explains, \"We're focusing on community building.\" [cite: 477] She and Head of School Alixe Callen understand that religious songs signify an important part of the school's past. [cite: 478] However, the administration is trying to steer the Winter Assembly away from the religious undertones which spraked frustration with the Rogers song reflects. [cite: 479] Instead, Butler is introducing a new plan, saying that she \"[emailed] the lifers at the beginning of September; [these students] will now be choosing their own song, and get to pick what represents that moment for. [cite: 474] This year, the third graders and lifers will sing \"We Are Going To Be Friends,\" by the White Stripes. [cite: 475] Along with the \"lifer\" song, the winter assembly contains various performances including, the Orchestra, led by Music Department Chair Adrian Anantawan, which plans on performing pieces by Duke Ellington, a 1950's Jazz Composer, and a piece called \"New World Symphony,\" composed by 19th Century Bohemian composer Antonín Dvořák. [cite: 476, 477, 478] Cello player and orchestra participant, Chisom Unamka 27 \"find[s] it interesting why an orchestra is playing a jazz piece,\" expressing her fondness for another Dvořák piece, stating that \"it's one of [their] favorites.\" [cite: 478, 479] Each year, boarders celebrate the holiday season by caroling around campus, visiting each dorm to spread holiday cheer and sing traditional Christmas carols. [cite: 477] However, the removal of \"Children, Go Where I Send Thee\" from the Winter Assembly spraked frustration with lifers such as Max Donovan 25, Amelia Stenta '25, and Tatum Schoettle '26. [cite: 479, 480] Donovan shared his disappointment, stating, \"it's unfair how the boarders are able to sing Christmas carols to each other, while the lifers are prohibited from similar holiday festivities.\" [cite: 476] Donovan also noted his family's discontent with the change: \"my parents, having invested so much in the Milton community over the years, were extremely disappointed to hear that neither my brother nor I would be able to participate in the Milton holiday tradition.\" [cite: 477, 478] Jessie Ward 25 and Rowan Cain 25 believe the decision to remove the song should have been put to a vote by the student body and other community members attending the assembly. [cite: 481, 482] Along with the orchestra, jazz groups led by Jazz Teacher Jared Sims also plan on performing. [cite: 549] Middle School Digital Media and Film and Middle School Speech Coach Yoshi Makishima wrote the script for the Middle School MCs. [cite: 549, 563] While the assembly historically mainly focused on the holidays, Maksishma explains the new direction, \"We are clearly trying to be more inclusive, trying to move away from the assumption that everyone who attends this institution is coming from a Christian background.\" [cite: 563] She adds, \"The people who are part of our Milton community extend much broader beyond that.\" [cite: 563] While writing the script, Makishima shares her goals, \"to not mention red and green, to not mention Santa, but also do mention togetherness, do mention hope, do mention the idea of light and dark.\" [cite: 564]"
  },
  {
    "title": "How to Talk to Your Senior Friends About College",
    "author": "Rebekah M Fabella '25, Onur Gurol '25, Emily Ma '25, James McEvoy '25, Char Mone '25 (Senior Editors)",
    "text": "Enter the fateful malaise of mid-December- stroll through the top of the Stu and see seniors crowded around computers, frantically checking for news. [cite: 487] The tension is nearly tangible, though we can certainly celebrate and support the seniors in our lives. [cite: 488] While it can be exciting to learn about your friends' future aspirations and plans, we, as Senior Editors, want to introduce you to some different personalities you might encounter in the senior class: i) The Apathetic; [cite: 489] ii) The Pessimist; iii) The Optimist; iv) The Arrogant; v) The Superstitious. [cite: 490] We call the first of our characters the Apathetic because they claim to \"not care\" about college results. [cite: 491] When you ask your senior friends, \"How're you feeling as your decisions are soon going to be rolling out?\" [cite: 492] and they sidestep the conversation or claim that they don't really care, you might guess that they represent the Apathetic applicant at that moment. [cite: 493] In the slurry of emotions conjured by the college process, students often resort to apathy as a means of avoiding difficult feelings and thoughts. [cite: 494] When you observe this behavior in your friends, reassure them that the spectrum of their feelings good, bad, and everything in between is genuine and often more beneficial to express than repress. [cite: 495] Next, we have our \"Negative Nancy\" of the group or, as we dub them, the Pessimist. [cite: 496] These students have convinced themselves that they will be denied from their top colleges, most likely in an effort to dull the sting of rejection. [cite: 497] As said by Zendaya in Spiderman: No Way Home, \"expect disappointment and you'll never be disappointed.\" [cite: 498] While we might be able to understand the appeal of this method, this pessimism is likely a front. [cite: 499] So, although it may seem impossible to reassure the Pessimist, just know that they, too, are dealing with the universal hope and anxiety of many other seniors. [cite: 500] Now, be extra cautious with this next specimen, as too much motivation could lead to hazardous confidence and too little could result in a harsh faceplant of reality. [cite: 501] The Arrogant approaches college conversations with a unique eagerness and certainty that they will get into their colleges, particularly their first choices (or, the schools their parents donated a building to). [cite: 502] While this confidence would otherwise be a good trait while navigating the uncertainty of the process, it can get out of hand when it starts to discourage others and consumes their life. [cite: 503] An important distinction from the Arrogant is the rarer, but more refreshing Optimist. [cite: 504] Optimists do not necessarily think that they will get into the colleges they applied to, but rather hold on to the hope that everything will ultimately work out or \"everything happens for a reason.\" [cite: 505] They possess a healthy level of confidence that their effort will take them in the right direction. [cite: 506] While this friend may not need as much reassurance (or therapy) as other applicants, your support and encouragement will always be appreciated. [cite: 507] Here struts the Superstitious applicant. [cite: 508] Oh, how stressed they look, longing for control beyond their reach. [cite: 508] Whilst venturing down a rabbit hole of everything that could go disastrously wrong - like the possibility that their admissions officer is hangry while reading their application - they are busy searching for angel numbers and ladybugs. [cite: 509] This student wants to get into their prospective school so deeply that they are looking for any way to ensure a positive outcome. [cite: 510] Even though your Superstitious friend may seem delusional or crazy in their methods, attempt to understand why their coping mechanisms might support them in this frenzied time. [cite: 511] Allow them to feel like they have this sliver of control. [cite: 512] While we have provided you with simple, face-value definitions, it is more likely that most seniors will be a mix of all of these characters throughout the college process. [cite: 513] Shifts in emotions and feelings are normal. [cite: 514] So, as a friend of a senior who is going through the process, you do not know where everyone will be at a given moment, but you also do not need to know! [cite: 514] Be supportive, but not delusional. [cite: 515] Be positive, but not unrealistically so. [cite: 515] Definitely don't try to convince them that the whole process is a hopeless hoax, but acknowledge why you, and your senior friends may begin to believe it to be. [cite: 516] Beneath the range of wildly different pre-decision facades lies a communal lack of control. [cite: 517] Seniors have put years of work into their clubs, classes, and sports, and yet, are awarded minutes of an admission officer's time. [cite: 518] As our efforts in highschool are so intrinsically tied to who we are, and the things that we love, the possibility of a college rejection can begin to feel like a rejection of our person. [cite: 519] Non-seniors, you have seen these students in their zones, seen them become leaders, and it can be confusing to see those that you look up to begin to doubt themselves. [cite: 520] So how do you reassure your friends, when you too are not sure of their outcomes? [cite: 521] You've gotten to know them beyond the confinements of a 7-page application. [cite: 522] Keep treating them like you always have-as a friend, not just an applicant. [cite: 523]"
  },
  {
    "title": "Boarders Anticipate Boarder Dinner, Suggest Changes",
    "author": "Teresa Li '26 News Writer",
    "text": "Each year on the day before everyone departs for winter break-December 18 this year the administration hosts a dinner for all boarders to gather, celebrate, and enjoy some good food. [cite: 568] David Lee '25, one of the boarding monitors, explains, \"Boarder Dinner involves a ton of collaboration with not just the students but also various Milton staff members [including the administration and Aramark].\" [cite: 569] An event that has existed for decades, Boarder Dinner is welcomed with many positive anticipations from students. [cite: 575] \"I like that the entire boarding community comes together for the event, and I enjoy the performances as well,\" said Elizabeth Sim 27. [cite: 575] Agreeing with Sim, Lee said that he \"think[s] Boarder Dinner is a fantastic bonding opportunity for the boarding community [and] it's a wonderful way to transition into Winter Break, [serving] as a good celebration of the halfway point to our year.\" [cite: 569] On the other hand, Valerie Gu 25 enjoys Boarder Dinner because she \"likes getting to dress formal with [her] friends and also being able to connect with the entire boarding community.\" [cite: 570] Similarly, Yu, who is a day student, views Boarder Dinner as a great opportunity to strengthen bonds with the people in your dorm but also to see other people from other dorms too.\" [cite: 574] Speaking particularly for this year's Boarder Dinner, Lee revealed that the \"menu is, in my opinion, the best we've had since I was a new student.\" [cite: 577] Much like previous years, this year's Boarder Dinner will include \"opening speeches from the boarding monitors, Ms. Stone, and Dr. Callen; [cite: 576] a cappella performances; and then a buffet-style meal.\" [cite: 576] All four cappella groups (EP!C, Resonate, Miltones, and Octet) will be performing at the event. [cite: 576] For example, Resonate will be singing \"Greedy\" by Ariana Grande because \"they wanted a more upbeat song to suit Boarder Dinner,\" according to Resonate member Anders Yu '28. [cite: 570, 576] On the other hand, Miltones and EPIC decided to go down a more traditional route, choosing to contribute to the festive spirit by performing \"All I Want for Christmas Is You\" by Mariah Carey. [cite: 570] However, in contrast to Gu's support of formal dressing, Sim thinks that the formality impedes success since \"it [will be] cold, and a lot of us [will] have flights to catch.\" [cite: 571] Therefore, she stated that \"dressing up for the occasion will only make a lot of us colder and more burdened.\" [cite: 571] Furthermore, Sim claimed that \"Boarder Dinner shouldn't be mandatory for students who need to catch a flight that night\" given the busy time for travelling. [cite: 572] Gu noted that Boarder Dinner \"could have better food\" and \"should not be taking place in the RSG.\" [cite: 572] Rather, she suggested holding the event \"in the ACC or [Goodwin] Room in Ware.\" [cite: 573] Sim believes the purpose of boarder dinner is \"to bring the boarding community together and let us celebrate Christmas together since a lot of us don't have the chance to celebrate with family.\" [cite: 574] Yu concluded that \"Boarder Dinner is an amazing way for boarders from different houses to connect.\" [cite: 574] Gu echoed this purpose of connection as well, claiming that it is \"well-fulfilled\" through this event. [cite: 575] Conversely, although Sim encouraged having \"performances, [which] help fulfill the purpose [of Boarder Dinner] and bring a sense of togetherness to the community,\" she argued against the formality of the event as it \"separates the community.\" [cite: 573]"
  },
  {
    "title": "International Students Spend Break Studying, Wishing for More Time",
    "author": "Amy Khaing '27 News Writer",
    "text": "As Thanksgiving break began on November 23, international students navigated a mix of choices, one of which was the decision of whether to return home or stay close to Milton. [cite: 577] Also, while most students reported taking time during the break to relax, almost half of the students surveyed reported spending some portion of the break studying. [cite: 577, 579] About half of international boarders surveyed went home during the break. [cite: 578] Of the 25 international students who answered a TMM survey, representing approximately 20% of all international students, the majority shared the experience of taking time during the break to relax. [cite: 578] Anthony Wu 27, a boarder from Hungary, \"hung out with friends.\" [cite: 578] Yoyo Qiu '27 \"watched a lot of movies\" and \"went to a lot of good restaurants,\" while Amelia Joseph '28, a boarder from Saudi Arabia, \"met up with old friends\" and \"spent time with family.\" [cite: 578] Still, 48% of the students surveyed spent time studying. [cite: 579] For instance, though Tobias Kim '27 had \"some good Korean food\" and \"watched a lot of movies,\" he also \"worked on some Latin.\" [cite: 580] Kailin Shi '25 \"considered staying in Boston,\" but ultimately decided to go back to Hong Kong to \"better focus on college.\" [cite: 581] Personal circumstances like travel logistics, family plans, and affordability led to a wide range of travel experiences over the ten-day break. [cite: 582] A majority of those who returned home expressed satisfaction with their relaxing time spent, while those who stayed voiced concerns about why they chose to remain in the U.S. [cite: 583] 56% of the students surveyed returned home during Fall Break. [cite: 584] Homesickness represented a leading influence for their travel. [cite: 585] \"I miss the food and the culture,\" expressed Wu. [cite: 585] Qiu decided to go home to China so she could \"meet her family.\" [cite: 586] Kim, conversely, spent the break with his friend close to Milton. [cite: 590] However, he \"didn't really check out the city\" and spent most of the \"time staying at the guest room.\" [cite: 591] \"Around Thanksgiving and all the holidays in the U.S., flight prices go up... it's so hard to make plans without compromising class time,\" said Seline Shahzad 26. [cite: 592] Jennifer Li 26 added that \"Thanksgiving, which is very specific to the US, doesn't coincide with a lot of my holidays back home [in Hong Kong], so even if I went back, my parents would be working and my friends would be at school.\" [cite: 583, 593] The 44% of international students surveyed who remained in the States shared some different experiences and opinions. [cite: 587] Several international students criticized the break's length and timing. [cite: 589] Andria Laitadze '26 thought that \"the break was too short to travel such a long distance [to Georgia], and Yurang Peng 28 agreed it was not \"worth international travel.\" [cite: 590, 591] Additionally, students from further countries like Mira Lu '27, from Hong Kong, didn't \"find it necessary to go back for Thanksgiving since she had to \"spend two days total traveling\" and \"adjusting to jet lag.\" [cite: 593] Similarly, fighting jet lag can take up to 3 days for Li: \"that's one third of my break spent sleeping through the day... not exactly a curse, but break is valuable time.\" [cite: 594] Peng asked to \"make one of the breaks longer, like four weeks instead of... two.\" [cite: 588] Darby Yang 27 thinks \"the period between Thanksgiving and Christmas is kind of awkward.\" [cite: 587] She also noticed that since \"the time between breaks is too short...teachers are cramming everything in.\" [cite: 589] On the contrary, Qiu believes \"the [school] weeks in between [are] good\" since they \"[give] time to prepare for finals.\" [cite: 589] Shi added that, above all, the fall break was well timed: \"It was really when I needed a break.\" [cite: 593]"
  },
  {
    "title": "Gotcha By the Numbers",
    "author": "Eli Berk '26 News Editor",
    "text": "Thank you to Devan Agrawal '25 of Programming Club for providing data. [cite: 595] Surviving Players Had 5.9 Times More Tags/Player. [cite: 595] Half of Tags Come From 7.7% of Players. [cite: 596] Tags/Player 28% Higher for Day Students. [cite: 595] Day Students Got More Tags than Boarders Every Day. [cite: 595] Of 12 People with 9+ Tags, Only One is a Boarder. [cite: 595] Class I Had 89% More Tags/Player than Class IV. [cite: 595]"
  },
  {
    "title": "January Exams Undermine Academic Intent and Mental Health",
    "author": "Solomon Fleiss '28 Opinion Writer",
    "text": "Heading into Thanksgiving break, I faced a mad dash of tests, papers, and lab reports. [cite: 597] I returned with a turkey-filled stomach and with assessments planned in every academic subject in the week leading up to winter break. [cite: 597] Now, looking ahead to 2025 and the official assessment week, I cannot help but ask: why are midterms in January? [cite: 598] Teachers already plan two waves of assessments leading up to these holiday breaks. [cite: 599] Wouldn't it make more sense for midterms to happen in December? [cite: 600] Why do we have to go into break with a stressed mindset? [cite: 601] That seems to undermine the objective of vacation. [cite: 601] Currently, midterm exams are scheduled in the middle of the academic school year after Martin Luther King Jr. Day. [cite: 602] Most classes have a two-hour assessment, and this year the final assessment is scheduled for Monday, January 27 with classes resuming on Friday, January 31. [cite: 603] Students are given just enough time between the end of assessments and the start of the new semester to clean out their binders, get a haircut, and binge one season of their favorite Netflix series. [cite: 603] The placement of exams in January is not the case at many similar, nearby academic institutions. [cite: 604] For context, while Nobles, Roxbury Latin, and BB&N roughly begin and end their academic years on similar schedules to us in September and June, they have finals in December. [cite: 605] In 2009, even Harvard switched to exams in December after 100 years on a January schedule. [cite: 606] Exams are an integral piece of the Milton learning model. [cite: 607] They allow students to prepare and show cumulative knowledge of a subject. [cite: 608] January exams align well with semester-long classes; they also mirror the larger projects and papers that tend to dominate May. [cite: 609] History teacher Michael Lou reflected on the schedule and structure: \"\" [cite: 610]"
  },
  {
    "title": "Sleep Deprivation",
    "author": "Ryan Reddy '28 Opinion Writer",
    "text": "Amidst our extensive academic and athletic curriculum, sleep may be the least of our worries. [cite: 168] Whether it's cramming for an exam the night before or working on a lab report due the next day, many Milton students have had to \"crunch\" assignments. [cite: 169] Thus, for many, late nights have become the norm, with homework and screen time eating into precious hours that should instead be spent resting. [cite: 170] Alarmingly, this practice is often celebrated as a sign of hard work and dedication to academics. [cite: 171] However, these seemingly harmless habits define the silent epidemic that millions of teens face: sleep deprivation. [cite: 172] Not getting enough sleep isn't just about feeling groggy or unfocused the next day. [cite: 173] In actuality, the consequences can affect nearly every aspect of a student's life. [cite: 174] Sleep is essential for memory consolidation. [cite: 191] Without sleep, students may ironically struggle to retain the very information they stayed up late trying to learn. [cite: 191] The National Library of Medicine, run by the United States government, emphasizes the severity of this issue, stating that \"subjects were tested after 35 hours of sleep deprivation; memory performance was approximately two letter grades (19%) worse when compared to the non-sleep-deprived subjects. [cite: 192] This difference did not seem to be due to alertness.\" [cite: 192] In essence, while students may sacrifice sleep for hopes of improving their academic outcomes, they often do the opposite by impairing their ability to absorb and recall information. [cite: 193] The detrimental effects of sleep deprivation do not stop at memory. [cite: 194] Chronic lack of sleep also affects decision-making and focus. [cite: 195] A tired brain struggles to process information effectively, leading to slower reaction times and an increased likelihood of mistakes. [cite: 195] This struggle can affect academic performance, extracurricular activities, and even basic daily tasks. [cite: 196] Beyond academics, sleep is critical for emotional and physical regulation. [cite: 197] Sleep-deprived students are more prone to mood swings, irritability, and anxiety; [cite: 198] thus, they struggle with the already-stressful demands of high school. [cite: 199] Studies from the National Library of Medicine have shown that lack of sleep amplifies emotional responses, making minor setbacks feel like insurmountable challenges. [cite: 200] Despite the challenges of balancing a packed schedule, there are practical steps that students can take to prioritize sleep. [cite: 215] But, we first need to identify the major causes of sleep deprivation. [cite: 216] One major culprit is the excessive use of electronics. [cite: 217] Smartphones, tablets, and laptops emit blue light, which suppresses melatonin production. [cite: 218] The lack of melatonin makes it much harder to fall asleep. [cite: 219] Students can combat this increased difficulty by setting strict limits on screen time, especially in the hour before bed. [cite: 220] Another cause of lack of sleep is poor time management. [cite: 221] If a teenager is expected to get adequate sleep and they procrastinate to the last minute, sufficient sleep is unobtainable. [cite: 222] Planning ahead and breaking tasks into smaller chunks can prevent this dangerous last-minute cramming, reducing the need for late-night study sessions. [cite: 223, 268] And lastly, we can establish a consistent sleep schedule, even on weekends. [cite: 269] A consistent sleep schedule helps regulate the body's internal clock, making it easier to fall asleep and wake up naturally. [cite: 270] Ultimately, sleep deprivation is not a problem that should be ignored, especially in this high school environment. [cite: 271, 285] It is a hidden barrier to students' success, health, and happiness. [cite: 272, 286] By acknowledging its impact and by adopting better habits, students can reclaim the rest they need to thrive. [cite: 287] Sleep is not a luxury-it's a necessity, and prioritizing it is one of the most important steps a high school student can take towards a healthier and more balanced life. [cite: 288]"
  },
  {
    "title": "Is Black Friday Treasure or Trap?",
    "author": "Zifu Song '27 A&E Writer",
    "text": "Black Friday, recognizing Thanksgiving holiday ing that the sales often encourage consumers to buy items they might not usually consider. [cite: 224] As Ben Wang 27 observes, for many name brands, Black Friday is a \"chance for [them] to sell past products so that they can get and to celebrate this cherished holiday. [cite: 225] At the same Businesses would want to time, companies with hold clearance sales for renowned global brands many different products: pitch their Black Friday ones that have not sold deals to consumers. [cite: 226] These well, models with less promotions often boast popular color schemes, eye-catching discounts, or designs that are about sometimes so steep they to be discontinued. [cite: 239] Most seem almost too good of the time, however, the to be true. [cite: 239] While many main purpose of these shoppers take advantage sales is to clear the storage room of old stock to of these sales and praise businesses for offering make room for new products. [cite: 240] Ben also points out significant savings, others that not every item gets a remain skeptical: do they discount, especially popular ones newly released. [cite: 240] Still, for shoppers less exist to trick consumers into spending more money than they need to? [cite: 240] Voices from sharp-eyed concerned with trends or seeking classic items that shoppers and vigilant members of the Milton don't change often, Black community shed light on Friday can provide substantial savings. [cite: 241] Profit is not the only this debate. [cite: 241] Milton students who participate in Thanksgiving driver behind Black Friday. [cite: 242] The fact that these shopping have strong opinions about deals align with the suggests that they might be a way for brands to express their gratitude to their loyal customers. [cite: 242] Considering that Black Friday is so close to Christmas, people can conveniently do all their holiday shopping under discounts. [cite: 243] Dennis Zhou 27 aptly puts it: \"Thanksgiving gifts to add to the holiday spirit.\" [cite: 244] Understanding the motivations behind \"shopping holidays\" is valuable, but mastering the art of holiday shopping is equally important. [cite: 245] Getting the most out of these deals is simpler than it seems. [cite: 246] Ben Wang 27 emphasizes that \"If you make the right decision during Black Friday, you can get a good discount.\" [cite: 247, 262] Jason Louie 25 believes that \"as consumers we also have responsibility to go about Black Friday rationally.\" [cite: 262] Instead of buying impulsively and regretting those decisions, suggestions and strategies can be followed-the community provides some. [cite: 262] Ethan Tsang 27, although not an avid shopper himself, observes that some people save their money throughout the year, and shop all their desired items during Black Friday. [cite: 263] For those seeking a less extreme approach, Jason Louie 25 suggests that if there are less urgent purchases you have throughout the year, you can wait until Black Friday to realize that wish. [cite: 263] For example, if he needs a winter coat in the fall, he notes the item but waits until Black Friday to buy it, maximizing savings. [cite: 263] Wang also advises prioritizing quality over quantity. [cite: 264] He recommends saving money to buy a high-end item at a decent discount. [cite: 264] Buying less items prevents shoppers from drowning in the sea of receipts and reduces the risk of losing track of their realistic needs. [cite: 265] In addition, the percentage of discounts for more expensive items are usually higher than cheap items, which may accumulate to more savings. [cite: 266] The perspectives shared by my peers reflect the diverse attitudes toward Black Friday shopping. [cite: 267] Some see it as an opportunity to snag great deals, while others approach it with caution, ensuring their purchases align with genuine needs. [cite: 289] Personally, I believe that the true value of Black Friday lies in thoughtful planning-identifying what you truly need and staying disciplined. [cite: 290] In the end, Black Friday can be both a trap and a treasure, depending on how we approach it. [cite: 291] In the end, Black Friday is a complex tradition-a blend of corporate strategy, consumer behavior, and holiday spirit. [cite: 292]"
  },
  {
    "title": "Is \"Modern\" Art Still Art?",
    "author": "Adrienne Webb ‘26 A&E Writer",
    "text": "trying to produce novelty.’’ [cite: 299, 317] As more and more artistic ideas are repeated, it is natural for artists to begin creating simplistic works and slap on an arbitrary meaning, especially if it sells. [cite: 299, 317] Seline Shahzad ’26, a performing arts student, notes that ‘‘$6.24 million is a lot of money which could be going toward a number of positive causes. [cite: 300, 318] For someone with a scope of influence as great as Sun's to spend this amount on a banana is absurd. [cite: 301, 319] Of course, each person should be able to choose what to do with their money, I just find this choice to be disheartening when it comes to the way the affluent use their platforms.’’ [cite: 302, 320] Whether this piece has changed art history for better or for worse is up for interpretation. [cite: 302, 320] So, would you spend 7 figures on a banana? [cite: 303, 321] Is \"Modern\" Art Still Art? [cite: 303, 321]"
  },
  {
    "title": "No Snow? No Problem: Varsity Skiing Excels Off the Slopes",
    "author": "Avaneesh Siruvuri ‘26 Sports Writer",
    "text": "What makes a ski team without snow? [cite: 335, 353] For Varsity Skiing, that question is not merely hypothetical: for most skiing practices until mid-January, the slopes at Blue Hills are bare. [cite: 336, 354] In the face of warmer winters, Varsity Skiing has adapted, and their amazing versatility demonstrates that dedicated athletes don’t need perfect conditions to thrive. [cite: 337, 355] The absence of snow hasn't slowed them down; instead, the skiers focus on what they can control, turning the campus into their training ground. [cite: 338, 356] During the preseason— which lasts until the team has regular snow at Blue Hills around January—Varsity Skiing athletes gather four days a week not on the slopes, but across campus for workouts dubbed “drylands.” [cite: 339, 357] These are, essentially, just fitness off the slopes. [cite: 340, 358] Between workouts, the team has regular team meetings where they grow bonds, set expectations, and strategize. [cite: 340, 358] Skier Dylan Cafferty ‘27, an avid skier, explained how he thinks the preseason practices help the team in the long run. [cite: 341, 359] \"We're not just practicing on the slopes; we're doing a lot of dryland training, which focuses on building strength and endurance. [cite: 360] It really helps us prepare for when we do get on the snow.\" [cite: 360] Captain Mason Comeau ‘25, also emphasized the importance of preseason training. [cite: 361] “A lot of people think that skiing is just getting on your skis and going down a hill,” Comeau said, “but it’s not just that. [cite: 362] You need to be fit and strong… so that you can control your body.” [cite: 362] In addition to these dryland practices, the team also incorporates team building activities. [cite: 363] \"We do a lot of team building activities, and it helps us bond as a team, and it's a great way to meet new people,” Cafferty said. [cite: 364] Comeau also highlighted the importance of team unity. [cite: 365] \"We're a small team, so it's important that we all get along and support each other. [cite: 366] It's a great way to build camaraderie, and it helps us to push each other to be better.\" [cite: 366] The team also uses this time to strategize and set goals for the season. [cite: 367] “We have regular team meetings where we discuss our goals for the season and how we can achieve them,” Comeau said. [cite: 368] “It's a great way to stay motivated and focused.” [cite: 368] The versatility of the Varsity Skiing team is a testament to their dedication and adaptability. [cite: 369] Despite the challenges of warmer winters and limited snow, they continue to thrive, proving that true athletes can excel in any conditions. [cite: 369] Their ability to turn the campus into their training ground, combined with their focus on team building and strategizing, sets them apart and ensures their success. [cite: 369] As Cafferty put it, “we’re not just a ski team; we’re a family.” [cite: 369]"
  },
  {
    "title": "Athletes Use Off-Season to Gain an Edge",
    "author": "Tim Puner ‘26 Sports Writer",
    "text": "It is important for athletes to utilize the off-season through consistent training routines. [cite: 370, 381] Although conditioning is often seen as the most annoying part of athletic training, athletes recognize its importance and spend time building their endurance. [cite: 371, 382] Alden Goodman ‘26 practices this mindset. [cite: 372, 383] “Through the winter season,” Goodman said, “I try to build my stamina by going on runs every day… [which will] help me with climbing as well.” [cite: 372, 383] Goodman is not alone in using the off-season in this way. [cite: 373, 384] Teddy Choe ‘26 does “club track in the off-season to stay active. [cite: 374, 385] It helps [him] improve [his] performance for both the spring and fall seasons.” [cite: 374, 385] Like many others here, Goodman and Choe competed tirelessly through the fall season in their respective sports. [cite: 375, 386] While it may seem intuitive that the best way to excel in a sport is by devoting yourself to it, some of our best athletes actually use their “off-season” to cross-train or participate in other sports. [cite: 376, 387] This approach not only helps prevent burnout but also develops different muscle groups and skills, making them more well-rounded athletes. [cite: 388] For example, a basketball player might take up swimming during their off-season to improve their cardiovascular endurance without putting stress on their joints. [cite: 389] This cross-training can lead to improved overall athletic performance and a reduced risk of injury. [cite: 389] Moreover, participating in other sports can provide a mental break from the intensity of their primary sport, allowing them to return refreshed and re-energized. [cite: 390] This holistic approach to athletic development is gaining popularity among top athletes, who recognize the benefits of diversifying their training. [cite: 391] By focusing on both physical and mental well-being, athletes can maximize their potential and achieve long-term success. [cite: 391]"
  },
  {
    "title": "SJSU Decision to Let Trans Athlete Play Volleyball Sparks Controversy",
    "author": "Ania Robinson ‘26 Sports Writer",
    "text": "who forfeited, calling them “sore losers.” [cite: 393, 402] Katelyn Xue ‘26, a volleyball player herself, shared mixed feelings about Fleming’s playing. [cite: 393, 402] She expressed some discomfort about competing with someone who might have a biological advantage but ultimately stated, “play the game. [cite: 394, 403] It’s just fun. [cite: 394, 403] She’s on the other side of the net, she’s on the other team. [cite: 394, 403] Just play the game.” [cite: 394, 403] Nehemiah Sanon ‘26 stated, “I feel like I understand why other teams would [forfeit], but you have to think about that one person. [cite: 395, 404] That could crush her morale. [cite: 395, 404] It's rude, but I get why they do it.” [cite: 395, 404] He acknowledges that the volleyball teams have their own opinions and make their own decisions, but he also humanizes Fleming. [cite: 396, 405] Ariam Gebresilassie ‘25 brought up an interesting question. [cite: 397, 406] She wondered, “say there is a very buff person who is at the time identifying as a woman and born as a woman, [and] they’re dominating in their sport, like ten times better than anyone. [cite: 406] Then, they transition, and they enter the men's league, and they’re dominating the male league. [cite: 406] What then? [cite: 406] Do you take out that person?” [cite: 406] This remark invites us to consider how we define fairness in sports and whether the current systems, such as the NCAA, adequately account for individual differences and embrace skills while remaining fair. [cite: 407] The debate surrounding Blaire Fleming accentuates the complexities of integrating transgender athletes into highly competitive sports. [cite: 408] It highlights the tension between biological differences, identity, and the values of inclusion and fairness, and the decision to let Fleming play may set important precedents for the future of sports. [cite: 409]"
  },
  {
    "title": "Coco's Corner",
    "author": "Boarding Monitors",
    "text": "Notes from 11/21 & 12/5: Stu Redesign w/ Ms. Reiser: Discuss thoughts on how the stu redesign went and what we would change - this does not mean that action will be taken all of of these ideas, we are just brainstorming - The furniture in the underclassman section is more designed for relaxing but the upperclassmen section is more work-oriented - Get rid of the sophomore wall to open up the space and remove division - The redesign encourages everyone to sit together - Possibly move the printer upstairs and the computer locker elsewhere and replace with more couches - The help desk is not used - put in long couches that you can disassemble, like the ones in the RSG - Put square tables so that they fit together for larger groups More storage space Boarder Dinner - We discussed menu items we would love to see at boarder dinner and other aspects of the event with Ms. Butler Segmented Work -Talk about what each pair has been up to! [cite: 420, 421] Here are some highlighted achievements - The juniors are teeing up a grade-wide Secret Santa - The sophomores are almost finished with their class merch - look out for an incoming form - The seniors had lower school students make cards for the seniors before the November 1st college application deadline :) and they are starting to manage the budget for the senior trip - The day monitors are working to better communicate the late policy The head monitors are working on some fun holiday excitement for the last week of school - 4 days of holiday! [cite: 422] Hi, everyone! [cite: 423] First off, we want to thank you all for the opportunity to serve the boarding community and the SGA as your Boarding Monitors this year. [cite: 423] We have been putting our best efforts into our work so far, and we don’t plan on slowing down! [cite: 424] We wanted to provide a quick update on some exciting things happening in the boarding community: The Boarder Dinner menu for this year has been confirmed, and let me tell you, what has been confirmed is a massive step up from those in past years. [cite: 425, 441] Aramark really outdid themselves this year. [cite: 441] You can also expect dazzling performances from several Acapella groups as usual. [cite: 442] Of course, as per tradition, our winter jubilation will continue with caroling. [cite: 443] While we have been working hard practicing in Goodwin and Hathaway, we can’t wait to see what the rest of the dorms come up with. [cite: 444] Beyond boarder dinner, we, along with the rest of the Boarding Council, have brainstormed a plethora of potential ideas to follow during winter break. [cite: 445] Here’s a sneak peek of what’s to come. [cite: 446] What do you guys think? [cite: 427] Let us know! [cite: 427]"
  }
]