[
  {
    "title": "New Upper School Principal Rachel Stone Seeks to Care for the Community",
    "author": "Dilan Payne '27",
    "text": "This July, newly appointed Upper School Principal Rachel Stone joined Milton, stating that her focus would be caring for the community. Stone says that this love of community originally steered her towards a career in public health, and she never intended to become a teacher. \"Teaching was supposed to just be a one-year adventure. That was thirty years ago.\" Stone, who majored in biology at Yale University, assumed she would go to medical school after college. However, during her senior year, Stone accepted a teaching job at Blair Academy, a co-ed boarding school in Blairstown, New Jersey. There, she taught biology and chemistry, coached girls' basketball, and worked in the dorms. What began as a one-year detour evolved into a five-year stint which concluded with her decision to attend graduate school at Columbia University's Mailman School of Public Health. Stone describes her passion for public health as a blend of her interest in medicine and science with her dedication to community. To her, public health means asking \"how you can take care of a community, whether it's a hospital, whether it's a town, whether it's a school.\" Through collaboration, connection, and a bit of fun, Stone hopes to do just that: take care of the Milton community.\n\nAfter earning her master's degree from Columbia, she returned to Blair Academy as Dean of Faculty, and later, Assistant Head of School. After 22 total years at Blair, she became Head of School at the Canterbury School, a co-ed boarding and day school in Connecticut. Though Stone is experienced, her previous schools are notably different from Milton.\n\nBoth of her previous schools were predominantly boarding and had student bodies of less than 500. Though Stone's past experiences differ from Milton, the shift is \"what's exciting for [her].\" Stone observes that many Milton students and faculty talk about bridging the gap between boarding and day students. However, she stated that, so far, \"no one can really define it to me. I hear it, though, and I want to understand it.\" She aims to narrow that gap by helping to organize events, but she acknowledged that \"it comes down to student culture\" and hopes students will reflect upon what events or discussions will bring people to campus.\n\nStone says she wants to facilitate connection not only between boarding and day students, but also between faculty members across buildings and departments. Stone, calling \"the talent and experience\" of Milton teachers \"extraordinary,\" emphasized that teachers can benefit from observing their colleagues, even those from completely different departments. She noted that \"as a science teacher, [one] could go watch history or art or language, and even though the material is different, [one] begin[s] to stop paying attention to that material and [begin paying more attention to the teaching].\" Stone hopes to create her own path to the classroom, channeling her scientific interests into further additions to the course catalog (at Blair, she created \"a junior/senior elective in public health, specifically in epidemiology\") while forming personal relationships with her students.\n\n\"One of the things I was most excited about in the principal job is being able to spend more time with students,\" Stone stated. Since her previous job consisted predominantly of travel and fundraising, Stone looks forward to building the student relationships that she had not had the chance to experience over the last eight years. To build a community, Stone first looks to build a foundation of individual connections, one student at a time. When asked if anything disappointed her about her new position, Stone replied: \"I thought there would be more students walking through the hallway of my office, since it's so close to the Student Center. I have to find a way to get students to drop by. Maybe I'll just start playing some Coldplay. A candy bowl, some good music, that should help out.\""
  },
  {
    "title": "Quadival Lauded as Bonding Opportunity",
    "author": "Joanna Zhang '27",
    "text": "On the evening of Friday, September 6, the first full day of classes, Milton's Student Activities Association held the Quadival, a beginning-of-the-school-year tradition, bringing much laughter on the quad. Iridescent lights from rides accompanied by the smell of popcorn and cotton candy welcomed the new year. Screaming on rides, sitting for face-painting, and slurping Italian ice, students rejoiced with friends and bonded with new classmates. Attendees reported an impressive crowd. \"There were a lot of people there... it was one of the few events on campus I went to that has a mixture of a lot of people from every grade,\" says Katie Rodman '27, \"but I think it was a bit more of the underclassmen who actually went on the [rides] while the upperclassmen just socialized and bonded with friends.\" Similarly, Hugh Kramer '27 stated that \"[he] thought the attendance of the Quadival was a good mix\" of students from every grade.\n\nSpecifically, Kramer believed that \"all the sophomores were there\" and that \"a lot of graduates and previous students came back to participate in this event which was pretty great.\" As one of the most popular events of the entire school year, the Quadival offered many different activities. According to Sonia Pande '26, \"there were three spinny rides--the teacup, the swing, and another spinny one.\" Pande liked most of the rides but thought that \"the swing ride was kind of underwhelming\" because they \"wished it could move faster and be a thrill.\" Mia Gao '28, however, felt the \"rides were kinda overwhelming\" and that \"[she] thought there would be better activities.\" Milton Art Club also offered a face-paint station. Pande described how Molly Sheehan painted a rainbow on their face: \"It was so pretty; I loved it!\"\n\nMany returning students compared this year's Quadival with last year's. Mira Lu '27 declared that the setup of this year's Quadival felt \"a lot better than last year's... because there [were] three rides in total compared to two rides from last year... Having three rides made the line for each ride a bit shorter\". Caroline Blake '25 stated that there was more of a variety of snacks this year compared to last year; the snacks in this year's Quadival included cotton candy, snowcones, and popcorn.\n\nUnfortunately, besides the highlights of this year's Quadival, the Quadival failed to serve fried dough as promised. Six out of the eight students surveyed for this article mentioned their disappointment about the absence of fried dough when thinking about the Quadival. Lu explained that \"they said there's going to be fried dough both last year and this year, but they did not have it two years in a row. It was disappointing,\" especially when the SAA utilized fried dough to advertise this event. Similarly, Tobias Kim '27 expressed how he was persuaded to attend the Quadivial by the promise of fried dough and was upset when he found out that there was none. Kim stated that \"as a carnival, it was not that good,\" but acknowledged how the Quadival provided a great platform for students to entertain with friends and bond with peers. Likewise, according to Gao, \"the Quadival was a good place to talk to more people\" as a new student because \"the rides put [her] with other people that [she had] not talked to before.\" Thus, the Quadival, despite its imperfections, offered students and faculties a platform to relax, bond with one another. As Kramer articulated, \"The Quadival wasn't that good but the reputation preceded itself... it's pretty good to hang out with friends on a Friday night.\""
  },
  {
    "title": "Poll Finds 50/50 Split on Student Approval of New Schedule",
    "author": "Teresa Li '26",
    "text": "Students returned this year to discover various changes to their schedules, including a reduction of the number of club blocks and a change in the half course schedule. Additionally, the extra help block no longer coincides with a club block, and the placements of class blocks have been reworked. A survey of 54 students reveals mixed opinions in the student body.\n\nAccording to Academic Dean Heather Sugrue, a faculty schedule committee met last year to discuss changes that should be made to the schedule \"to improve the lived experience.\" In making their decisions, the committee surveyed students in the Classes of 2025, 2026, and 2027 regarding their opinions on the schedule; the group then proposed the changes to the administration, which approved the adjustments. Speaking to the reasons behind the making of these changes, Sugrue states that \"[all changes] were made to improve the student experience and to help students have the most amount of access to their teachers, while also focusing on the flow of a given week for learning.\"\n\nOverall, 51.9% of 54 students who responded to the Measure's poll from September 12 to September 17 prefer the new schedule, while 48.1% of students prefer the old schedule. John Hackett '26, who preferred the old schedule, explains that the problem lies in the club block change because \"now, instead of clubs clashing with Extra Help, they clash with each other.\" He concludes that \"this [change] just moved the problem... rather than get rid of it.\" Alternatively, Chris Pols '27 likes the new schedule more because \"[her] classes are more spread out,\" a consequence of the shift in block placements. Many new students who responded chose the new schedule because they simply did not understand the difference. Suggesting a solution for the problem regarding the lost club block, Devan Agrawal '25 proposed to \"[drop] a class meeting or Upper School meeting\" so that Extra Help can be singled out without needing to shorten club blocks. Benjamin Wang '27 echoes this opinion in stating, \"there could be room in other blocks (perhaps some meeting times) to add back that lost club block.\" Eli Berk '26 does not like the club block change, as he explains, \"I'm part of a lot of clubs that I already struggled to balance [so] by making this change, the administration is asking every student to drop one of their clubs.\" Berk continued, \"additionally, I don't believe that this will even encourage Extra Help [because] the choice between Extra Help or a club is now the choice between Extra Help or free time, [making] it an easier decision to do nothing.\" Similarly, Claudia Krishnan '25, who is part of the Sustainability Board and a co-head of an a capella group both of which now meet during club block 3-believes that this change \"limits [her] ability to attend clubs.\" On the other hand, Aava Darvish '27 likes \"how [club block] doesn't clash with Extra Help\" but at the same time, dislikes the fact that \"now several of [her] clubs are happening [simultaneously].\" In addition, Wang appreciates the separation of the extra club block since it is \"a good notion to encourage students to utilize teaching resources.\" Conversely, for those who don't participate in many clubs, such as Elly Ash '26, having \"[fewer] club blocks doesn't affect [her] too much.\n\nIn terms of half courses, 44.4% of students surveyed prefer having their half courses meet for three non-extended blocks every two weeks, 22.2% prefer two blocks with two 35 minute classes, 14.8% prefer four blocks, and 18.5% prefer three blocks with one that is extended. Rohan Shah '26, one of the students that chose two blocks with two 35 minute classes, the current iteration, thinks that \"[shorter] blocks are better for focus.\" However, Amara Prather '26 says she \"enjoyed having more time with [her] half course... but also [likes] the extra hour of free time.\"\n\nPerforming Arts Department Chair Eleza Kort noted, \"I don't think it's a perfect solution, but I understand the issue... [before], a full course met 4 periods a week and a half course met 2 periods a week...I think it worked much better.\" English Teacher Lisa Baker also reasoned that the shortened half-courses \"make sense\"; however, she \"[misses] the continuity of seeing [her] students twice a week- [it's] hard to build [the] classroom community necessary for excellent writing workshops, in particular. Additionally, Community Engagement Director Andrea Geyling-Moore expressed that \"[she now needs] to think very carefully and intentionally about what [she] wants to include or adjust in terms of content...but [she doesn't] anticipate anything too drastic.\""
  },
  {
    "title": "AI Challenges Students in an Election Year",
    "author": "Editorial Board",
    "text": "Whether we are of voting age or not, it is critical that we educate ourselves on the political state of our world. In recent months, we have been exposed to an abundance of misinformation on social media, television broadcasts, and even news articles from popular, well-vetted sites. When surrounded by a flurry of propaganda, especially during this election year, it is hard to know what is true and what is not. In the face of these ambiguities and falsehoods, how can we improve our media literacy and make informed, educated decisions?\n\nAmid the exponential rise of artificial intelligence, integrity is losing its place amongst popular sources of information. On the app X, formerly known as Twitter, CEO Elon Musk has removed filters and safeguards. On August 18th, former president Donald Trump posted a fake image of opponent Kamala Harris, insinuating that she had ties to Marxism and the Communist party. Although the image itself is clearly fake, its implications are powerful nevertheless. With X's lack of censors, we cannot be sure of all the information we access. Furthermore, Trump's vast outreach ensures that his posts will receive millions of views, reposts, and shares. The combination of these two factors led to the post garnering a whopping 82 million views, including 120 thousand reposts. Despite the large amount of backlash following Trump's post, the fact that this misinformation is so accessible is evidence enough that social media and AI are incredibly dangerous political weapons in the modern age.\n\nThese artificial intelligence issues notably extend into academic environments like Milton as well. AI is undoubtedly a useful tool. However, when students start to brainstorm essay topics with chatGPT, or ask it the steps to solve a math problem instead of struggling through it, we lose opportunities to strengthen the critical thinking skills we need to make our way through this misinformation-filled climate. This easy access to AI propels misinformation from both sides, both in its creation and peoples' unquestioned faith in it.\n\nConservative, liberal, independent — whatever political beliefs we have, we all face the threat of misinformation. As either citizens or primary residents of this country, we all have a common duty to educate ourselves politically and make informed choices so that we can positively effect change. In order to combat the flood of lies, misleading headlines, and obscurities that plagues public knowledge, we must learn to have strong media literacy. So, how can Milton do this?\n\nFirst, we fact-check. Inflammatory news stories - just like rumor and gossip spread fast in a place like Milton. Before sharing an outrageous headline or claim — even one that seems believable — dig deeper into the source. Take the time to actually read the article. Just because the title may make a strong claim, we should not assume the contents will follow. Furthermore, if you are assigned an article in class, compare the information you see in the reading to what you find in other sources. Are these sources partisan or biased? How so? Are they appealing because they spout information we are comfortable with and that we want to hear? If we do not take the time to question our pre-existing prejudices, we cannot be effective arbiters of truth.\n\nSecond, we engage. As Ariam and J.P. mentioned in their opening speeches at convocation, we must engage in both the light-hearted and serious moments of the school year. Whether discussing an issue around the Harkness table or in the Stu, engage in conversations with anyone and everyone. Milton is a diverse hub of multiculturalism; gain new perspectives and share our own, even (and especially) when they make us uncomfortable. In this time, we cannot be so quick to trust everything we read. These issues affect real people, and as young, privileged people, we must do the work to understand these vast perspectives."
  },
  {
    "title": "New Farokhzad Math Center Revamps Math Department",
    "author": "Gustavo dos Reis '26",
    "text": "On September 5th, 2024, students and faculty members celebrated the inauguration of the Farokhzad Math Center. Following a year of construction, the school's newest building, located between the Art & Media Center and the Kellner Performing Arts Center, provides a dedicated space for Milton Academy's mathematics department and doubles the number of mathematics classrooms on campus.\n\nFunded by a multi-million-dollar donation from Shadi and Omid Farokhzad P '23 '25, the Farokhzad Math Center marks the end of the 2015 Master Campus Planning—the same plan that called for construction of the on-campus ice hockey rink, moving Cox Library to Wigglesworth Hall, and renovation of Schwartz Student Center. Chief Financial Officer Heidi Vanderbilt-Brown said that \"this kind of project wouldn't have been possible without a naming gift, from both [the Farokhzad family] and other families.\"\n\nNow, as the community can finally enjoy the new building, which Head of School Alixe Callen described as \"state-of-the-art,\" highlighting that \"no other school has this kind of setting for math: the layout of the classrooms, the whiteboard spaces, and the technology.\" As Vanderbilt-Brown explained, the Farokhzad Math Center brings more classrooms for mathematics classes on campus, a benefit that improves students' ability to find specific teachers and creates more space for group work and school assemblies.\n\nHT Xue '26 feels glad that Milton now \"has another space on campus for learning and congregating.\" He explained that the new building \"shows that the school is investing more in math... They also hired a bunch of new teachers. My teacher this year, Mr. Jiang, is the most overqualified high school teacher I have ever met. So I guess the new math building is a big part of that effort.\" Similar to Xue, Mathematics faculty member Hubert Hwang likes \"how much space there is and how bright it is\" and confessed that \"it's kind of shocking to remember what the library used to be like with all the books.\"\n\nMathematics faculty member Akinade Adeboye also highlighted the quality of the new center on campus. His biggest hope for the Farokhzad Math Center, however, is that it \"will become the new student center.\" Though Vennie Xiao '26 stated that \"it's nice that [Milton Academy] now has a building for math and that students do not have to share spaces with the middle school,\" she also thought that the new space \"is kind of cramped. There is a lot in there, and it feels somewhat claustrophobic on the upper floors.\" Xiao added, \"I think [my math experience] is about the teachers, so I am not sure if [the Farokhzad Math Center] will improve my academic experience in the math department.\"\n\nMilton's librarians also celebrate the new space. Librarian Joanna Novick thinks that the new Farokhzad Math Center \"will be great for both the Student Center and the Library because they are often incredibly packed.\" Novick continued to state that \"the new building has a lot of great spaces, and I think that once students get accustomed to the FMC, it will help a lot.\" Now, as students and faculty members settle into the new building, the school's leadership team enters another phase of planning, which will define the next changes to the campus. \"We are just entering a strategic planning process, which will include a new campus master plan, so all of that will roll out in the next few years,\" Callen clarified. In Xue's opinion, Milton Academy's next priority should be renovating the science laboratories. \"Pritzker is a great place, but we don't have fantastic facilities for engineering and physics classes. But I understand that there are other more pressing issues,\" he detailed. Callen, on the other hand, thinks that \"Milton desperately needs a new dining hall. As [the planning teams] go through that process, that [need will be something at the forefront of my mind.\" Still, she added, \"I'm only one person involved in a process where everybody has a chance to weigh in. We will see.\""
  },
  {
    "title": "Altered Schedule Presents Pros and Cons",
    "author": "Kaysia Maddix '26",
    "text": "Frankly, I didn't notice the new change regarding the club periods in my schedule until I took a deeper look. At the advent of a new school year and a fresh schedule, most everyone is too busy finding out what classes they have, who their teachers are, who is in their classes, and if they have the same lunch period as their friends. Few notice the subtle scheduling changes such as the number of club blocks decreasing from four to three for the 2024-2025 school year. Upon closer examination, I was taken by surprise by the change and have mixed feelings about the altered schedule. Yet, despite the inconveniences it may pose, I believe the school acted upon the student body's best interests.\n\nLooking back into the past school year, students and teachers alike had heavy complaints regarding the Extra Help period and Club Blocks 3 and 4. Many students complained that the Extra Help period coincided with Club Block 2 was highly inconvenient, as they were forced to choose between whether they wanted to meet with their teacher or attend a club that meets on the second block. Both are equally infrequent, occurring only once a week. I personally found it difficult to choose between attending the Caribbean Student Association or spending time with my teacher reviewing a topic I was struggling with. For some students, this was the only time in busy schedules that allowed them to schedule a meeting before an important test or project. Due to the overlap, some clubs could not meet last year because their leaders prioritized meeting with their teacher over meeting with their club members. Upon noticing this, Milton attempted to fix the issue by designating the Extra Help block specifically for meeting with teachers, but it left many students with mixed emotions. During Club Blocks 3 and 4, students had the opportunity to participate in multiple club meetings. I can speak to this, as I was able to attend both Onyx and Jaded Matrix clubs during that time. Students who did not have a club to attend used it as a time to complete homework or study for exams, making it a useful time for everyone. However, over the summer, Club Block 4 was removed; this absence of a club block will affect students' ability to participate in multiple clubs they're interested in.\n\nClub leaders, too, may face challenges in dodging a Club Block when another club with a similar audience meets. For instance, according to Tang board member Jennifer Li '26, the Chinese culture club—which used to meet on Thursday mornings—almost changed to the same time block as International Students Club. A potential overlap in prospective attendees may have led both clubs to see a deficit in attendance. Thankfully, ISC is now meeting one block after Tang, she confirms, but similar issues may easily arise among other clubs. An overabundance of options during each club block will pose problems to students, who may struggle to make a decision, as well as clubs themselves.\n\nDespite my criticism of the schedule change, I also want to acknowledge its positive aspects. This change is beneficial for the school as it now allows students to have built-in time in their schedules to meet with teachers if they need help. They no longer have to sacrifice their lunch break, free periods, or after-school time, as this change gives them the opportunity to prioritize getting the help they need during the school day. There's no longer a need to choose between education and club meetings. Even if there are mixed opinions about the change, I believe that Milton simply wished to give students more opportunities to seek help."
  },
  {
    "title": "Do Fifteen-Minute Classes Build Connections or Create Exhaustion?",
    "author": "Elizabeth de Ramel '26",
    "text": "Convocation Day is a hallmark of each new year. After a highly anticipated three-month summer break, faculty and students gathered once again to greet new and old faces alike in semi-formal attire. Students first assembled in the ACC to watch seniors file in, hear welcome speeches by the head monitors and faculty leadership, and see their friends once more. Following the assembly, Milton tasked its students with attending six fifteen-minute classes and running between opposite ends of campus within four hours; however, this cramped schedule ultimately resulted in exhaustion and dampened the experience of the first day of school.\n\nWhile the quick pace may initially seem impractical, it can offer a range of positive benefits. These periods don't cover much and only consist of simple introductions and a short overview of the year ahead. An early engagement can help break down social barriers, creating an inclusive and welcoming environment. Math teacher Alexis Lund emphasizes the importance of these initial moments, explaining, \"[class] wasn't going to be academic... but I could get to say a simple hi to my classes... to say this is me, this is you.\" From her perspective, these interactions aren't aimed at diving into the curriculum, but rather establishing a base connection. By acknowledging each student as an individual, Lund feels she creates an atmosphere where students feel seen and valued, allowing them to feel more comfortable engaging and collaborating with their peers.\n\nHowever, after talking to multiple students, a recurring theme emerged: exhaustion. Constantly shifting one's focus from one topic to another can be mentally straining, diminishing these students' learning motivation and overall enjoyment of learning. Esme Campbell '26 agrees, stating: \"Some teachers tried to introduce new material...for only 15-minute classes to try to absorb that information is pretty overwhelming.\" While these short breaks offer brief respite, they limit the opportunity for a deeper engagement with the material. The constant rush of information can limit a student's mental recovery before diving into the next class. Instead of opening the door for a smooth learning process, these transitions can lead to a fragmented educational experience where students cannot immerse themselves in a single topic; this not only affects not only one's academic performance but of the students' time.\n\nTo balance the positives of the brief classes with the need to manage exhaustion, Milton could offer two days of class periods, splitting up the number of classes per day. Longer periods can allow students to take a deep dive into introductory material or activities, ensuring that these sessions are engaging yet manageable. This alternative would let students focus on their new classes as well as new peers. Ultimately, balancing academic rigor with meaningful social interactions is key to promoting both academic success and overall student well-being. The unique format of six fifteen-minute classes across campus on Convocation Day serves as a valuable opportunity for early engagement and relationships without taking up too much academic time, accommodating the needs of students as well as ensuring them to be well-prepared for the school year. By embracing a more refined approach to this special day, Milton can continue to foster an effective and supportive learning environment from the very beginning of the academic year."
  },
  {
    "title": "Summer Homework for Math Should Be Mandatory",
    "author": "Angela Xu '27",
    "text": "Despite the horror most students might feel upon seeing the title of this article, I believe that at least some form of summer homework for math should be mandatory. This way, we can eliminate the huge mountain of September review homework while ensuring students have practiced the skills needed to complete their new course. I believe a lot of academic ability disappears over the summer and practicing basic concepts will ease the transition back to the rhythm of school.\n\nTo people who haven't yet been subjected to the torturous review process, 40-question review packets and multiple quizzes are only some examples of the many delights that greet students as they make their way through the tedious back to school transition. Due to the tightly-planned syllabi according to which most courses run, students often get only a week or two of review for everything they learned last year. I, for one, remember the hours staying up late trying to recall the formulas for trigonometric functions, the graphs of parametric equations, and the conversions for polar functions as I struggled through my review packet. Additionally, in some courses, students may feel overwhelmed as they try to cram old and new information together. This is especially the case for some accelerated courses, such as Accelerated Calculus (though I do love the course). This approach of \"everything in your face all at once\" is intense and draining.\n\nHowever, I also do not believe in giving no review homework at all. At this point, some readers may argue that the school can assign summer homework, but it shouldn't be mandatory. But will students do homework that is not required? As a student, I also agree that mandatory homework sounds horrible—but it really doesn't have to be. Summer homework does not need to be a burden. By structuring little amounts of homework in a way that encourages students to review material gradually over the course of the summer (instead of cramming everything in the last two days), students can maintain math skills without sacrificing their precious vacation time. Math homework also doesn't have to mean boring problem sets. More traditional methods of review such as Delta Math (the website Milton currently uses) offer step by step solutions to questions and quick daily practices. Recently, fun math games have appeared in classroom environments. These games only require around 3-5 minutes each day. There are even math review quiz-zes on websites such as Kahoot!.\n\nWhile mandatory summer math homework might not be the most popular idea among students, it would play a crucial role in combating the \"summer slide.\" It would aid the difficult transition at the start of the school year. By offering regular, manageable review throughout the break, students could hold onto key concepts without facing the rush of stress in September. Moreover, when done right, the homework doesn't even have to be time-consuming and might even be—dare I say it—fun. Ultimately, a small amount of summer math practice could make a true difference when it's time to go back to class."
  },
  {
    "title": "Reach App Fails to Improve Campus Sign-Outs",
    "author": "Anton Badushov '26",
    "text": "This year, the boarding community transitioned from using a \"blue card\" sign-out system to using a third-party software called Reach, which has over 50 one-star reviews out of 83 total App Store ratings. Let me tell you what the software is theoretically meant to do: Reach purports to be a swifter and more efficient way for boarders to leave campus, allowing teachers to electronically approve boarders' sign-out requests or forbid the student from leaving campus entirely. Reach sign-outs require many things that the previous blue-card system also required, such as documenting a student's destination, leaving and returning times, and means of transportation.\n\nNow that you know Reach's goal, let me explain why Reach is the wrong application at the right time. Today, despite what many politicians may tell you, everything is becoming digital. Digitization comes in all shapes—remember when you used to have a physical plane ticket, and now that ticket is in your iPhone's wallet? People used to read newspapers given to them by a mailman—now we get our news from a screen. That same type of improvement has now extended to Milton Academy's blue card system. Digitization is amazing, don't get me wrong. Milton needed to change the blue card system—past Milton Measure articles proved the flaws in its code. One of the many flaws of the blue-card system was the requirement of a duty person's signature to leave campus, and another was the requirement to ask parents permission to sleep over at someone's house or to attend a birthday party. These major inconveniences needed to be changed. But what replaced these flaws was just a digital system with the same defects.\n\nThe Reach system still requires the duty person to approve the sign-out, and if the faculty member on duty does not see the request, students might wait for one, two, or even three hours to leave campus. Absolutely none of the blue card system's original issues have changed since the new system was put in place. Students still need to check out of the dorm physically through a QR code and also need to check back in the dorm physically with the duty person. Also, the complex mechanics of the app make it very confusing for students and teachers alike to use the app. With at least ten buttons on the app, Reach does too much on such a small screen. Troubles like this may seem nothing more than inconvenient. However, if you have a surgery you need to get to in order to fix a torn ligament, and Reach isn't being cooperative with its mechanics, those precious minutes could cost you. Another issue is that you need an electronic device to use Reach. Good luck signing out or back in if your phone dies. I don't like that Milton hasn't changed anything about the sign-out system except slapping a new label on it and digitizing.\n\nMilton Academy's sign-out system needed changes, but what replaced the blue-card was certainly the wrong solution. Reach's lengthy sign-out process continues to stamp out student spontaneity just like the previous blue-card system. Boarding schools should aim to nurture independence and responsibility in their students. However, the Reach system contradicts this objective by imposing a strict framework that requires students to seek permission from faculty and parents for every single outing. As much as Milton preaches its \"Dare to be True\" mindset, the incomprehensible Reach system pushes Milton away from student independence. Students should have the freedom and responsibility to travel without the need for overbearing supervision."
  },
  {
    "title": "Something Rotten Marks the End of Anastas' Tenure",
    "author": "Adrienne Webb '26",
    "text": "In the nature of a school environment, change is bound to occur, be it through students or faculty. Milton has numerous teachers that have been a stable presence throughout the years—one of them being Darlene Anastas, after working at Milton Academy for 44 years, is now leaving the school. Her final musical production will be Something Rotten, the fall musical (set to start showings in November 14-16).\n\nThe show takes place around the 1590s, and focuses on the characters of William Shakespeare and Nick Bottom. Nick Bottom, along with his brother Nigel, are both writers desperate to create a hit in the theatrical industry whilst rivaling the crowd-acclaimed Shakespeare. This musical includes a variety of dancing and singing numbers and involves many historical references. Anastas explains that despite the show's carefree humor, it carries the genuine message to \"be true to yourself,\" a theme Anastas believes should be reinforced.\n\nOn the other hand, while the majority of the play is meant to be lighthearted, Rue Tanzi '26 brought up the point of the play's teetering across the fine line between comedic and outright offensive at times. Playing the role of Shylock and parts of the ensemble, Tanzi explains that playing a character whose main personality is the fact he is Jewish, as a half Jewish person, is \"concerning.\" They later go on to explain that in the context of people's being very prejudiced against Jewish people in the 1590s, \"there are some pieces of humor that are on the line between comedic and offensive.\" With this in mind, they are still \"working towards playing the character in the least offensive way possible whilst also remaining true to his character.\" That being said, Tanzi is still looking forward to their part in the play and finds that overall, it's a show that is worth watching.\n\nPhoebe Zhang '26, a member of the ensemble, finds the play to be entertaining with its tap dance and other musical numbers. She notes that even with a small role, \"Dar does her best to give people who have small roles a moment to be recognized whether that's a line, solo, song, or just a solo dance for a couple seconds.\" Despite not knowing the trajectory of the theater department without Dar, Phoebe is sure of Dar's legacy: \"Not only does she leave behind many of her handmade props, but also her spirit.\" On a similar note, Tanzi also believes Dar is a crucial piece to the cohesiveness of every Milton production. Having worked with her as an assistant-director, Tanzi finds that Dar is a \"pretty good director\" and that \"she has been a great help and support.\"\n\nSeline Shahzad '26, a member of the musical's cast, claims that Anastas stands out as a director due to her organization and dedication to making each student involved feel excited about her shows. Anastas evidently values the contributions of the cast and crew, as she reminds the community that \"You can't do a musical without the students.\" Shahzad notes that Anastas' \"enthusiasm for theatre shines through whatever she is working on, be it directing actors or coordinating the tech shop. The contributions she has made to the theatre department over her 44 years at Milton will stand long after her departure.\""
  },
  {
    "title": "Wide-Ranging New Releases Made a Great Summer of Music",
    "author": "Carmelle Jagaselvan '26",
    "text": "The Summer of 2024 proved to be a culturally significant time for music. Through new music releases and celebrity feuds, artists of various genres showcased a dynamic selection for music listeners these past three months.\n\nBillboard, one of the most well-known sites to view music popularity on the internet, updated its 'Songs of the Summer' list every week throughout the summer. \"I Had Some Help\" by Post Malone, featuring Morgan Wallen, remained the number one song for all fourteen runs of the list. Not far behind were Shaboozey's \"A Bar Song (Tipsy),\" Kendrick Lamar's \"Not Like Us,\" which both peaked at number two on the chart. Also included for all fourteen weeks were Sabrina Carpenter's \"Espresso,\" Hozier's \"Too Sweet\", and Billie Eilish's \"BIRDS OF A FEATHER.\"\n\nStarting the summer off strong, Charli xcx released her sixth studio album, Brat, on June 7. Despite the album's simple presentation, with its lime green cover and grainy arial text, the term \"brat summer\" rose to fame online. The album's most well-known form of advertisement was the infamous lime green brat wall in Brooklyn, New York. Here, Charli revealed the release of her deluxe album with simple text that read: \"brat and it's the same but there's three more songs so it's not. Some of the most popular songs on the album include \"Apple\" and \"Von Dutch,\" which both gained major traction on social media. \"Apple\" now features in 1.6 million videos on TikTok.\n\nAfter its initial release in September of 2023, Chappel Roan's album The Rise and Fall of a Midwest Princess rose to the top of the charts this past summer. The top songs of the album, \"Pink Pony Club,\" \"HOT TO GO!\" and \"Femininomenon,\" and Roan's more recent single, \"Good Luck, Babe,\" quickly became fan favorites. Other notably popular albums that were released prior to the summer were Morgan Wallen's One Thing At a Time, Taylor Swift's The Tortured Poet's Department, Billie Eilish's HIT ME HARD AND SOFT, Beyonce's Cowboy Carter, and Ariana Grande's Eternal Sunshine.\n\nThe charts also displayed new developments in the indie genre with Clairo's Charm and beabadoobee This is How Tomorrow Moves. Other summer releases include Camilla Cabello's album C, XOXO, and Eminem's album The Death of Slim Shady (Coup de Grâce). Gracie Abrams released her long awaited album The Secret of Us, which included her single \"Risk\" and other songs that gained rapid popularity including \"Close To You,\" \"I Love You, I'm Sorry,\" and \"Us\" featuring Taylor Swift.\n\nEnding the summer with a bang, Sabrina Carpenter released her sixth studio album, Short n' Sweet, on August 23. Carpenter's previously released singles, \"Espresso\" and \"Please, Please, Please,\" both quickly rose to the top of the charts, foreshadowing the album's success. The album, including ten new songs as well as the singles, has been at the top of the Billboard 200 list since it came out. Looking forward, NPR reports that SOPHIE's self-titled album, Mount Feries Night Palace, and Dua Saleh's, I Should Call Them are three of the most awaited albums currently. As we enter the fall season, we continue to reminisce about this past summer's hits as we set aside \"Songs of the Summer\" in order to get ready to cozy up with our autumn playlists."
  },
  {
    "title": "Advanced Theatre Studies Course Offers New Path",
    "author": "Phoebe Zhang '26",
    "text": "Every year, the Performing Arts Department offers a spectrum of advanced courses—improvisation, directing, costume design, musical theater and more. However, students scarcely get the opportunity to discover the department's full potential: many courses do not acquire enough interest to run. This year, the department's new half course, Advanced Drama: Theatre Studies, aims to break such barriers. It merges multiple drama disciplines into one umbrella course, empowering advanced drama students who signed up for under-enrolled courses to continue their pursuits while offering all drama students an opportunity to utilize the department's resources to the fullest.\n\nAs a continuation of Arts Program Drama, the Theatre Studies course's foremost interest naturally must be for students to overcome their boundaries and advance the knowledge gained in regular drama. Indeed, Eliza Kort and Shane Fuller, the instructors of the course, testify to the rigor of the class, stating that \"the first project would push the student's acting skills.\" In fact, the eagerness to become better stage artists through this challenging course drives invested drama students to choose it. When asked the reason behind taking Theatre Studies, Seline Shahzad '26 explained that \"the class is an opportunity to step out of [her] comfort zone and learn how to embody a wider range of characters.\" David Lee '25, Shahzad's classmate, holds the same hopes for the course, claiming that he is \"very excited to tackle some more dramatic or unconventional works as both an actor and a director.\" Furthermore, Rue Tanzi '26 chose this course because its challenges provide an appropriate segue into their professional career. According to Tanzi, who is planning to go to college for acting and is a working actor for film, \"the class would not only help [them] gain more skills for the field but would also boost [their] chances of getting into rigorous acting programs.\"\n\nMeanwhile, aside from helping students thrive in their areas of interest, Theater Studies, as a multidisciplinary course, promises students a chance \"to engage with different minds,\" as Lee puts it. The course provides this platform to work with different-minded artists. As the class explores diverse drama techniques, it naturally attracts students with many varying interests. Lee explains this component of the course by saying that \"the students would practice proposing, combining, and considering different perspectives and ideas.\" However, to fulfill the aforementioned promise is no easy task: despite being a half course, Theater Studies has to accommodate various interests of the enrolled students, including acting, directing, playwriting, and more. To that end, the course has a flexible syllabus, distinguishing it from most half courses. The instructors collect students preferences and hence, as Tanzi shares, \"the students handpick every unit to workshop what they want.\" To emphasize the personalized learning experience the course offers, Kort also mentions that \"the course is planned bit by bit, and currently only the quarter is planned out.\" Ultimately, the rigorous, adaptive, and multidisciplinary nature of the Theater Studies course seeks to chart a new direction for the Performing Arts department, aiming to benefit not just Advanced Drama students but the department as a whole. Additionally, the flexible course framework and small class size allow convenient adjustments depending on student's schedules and preferences."
  },
  {
    "title": "Something Rotten and No Exit Kick off Fall Theater Offerings",
    "author": "Sissi Ma '26",
    "text": "Two brothers in 1595, Shakespeare, and a mysterious room are among what the Performing Arts Department will be offering this fall. The upcoming performances include the Class IV Follies, Dreaming Wide Awake, on October 17; No Exit, a play, on October 31; and Something Rotten, a musical, on November 16.\n\nSomething Rotten, the biggest production of the season, is a musical comedy set in 1595 that follows the Bottom brothers, Nick and Nigel, who attempt to write a play while competing against Shakespeare. According to theater teacher Darlene Anastas, the director of this play, the show \"is a wild romp through Musical Theater history and lots of quotes from Shakespeare.\" The process of putting together the play began with auditions on September 3. Anastas explained that the auditions consisted of \"learning a song and learning a dance sequence\" relevant to Something Rotten. The cast is tasked with playing different characters at different times throughout the show, and all of the actors play ensemble roles at one point or the other. Rhys Adams '26, playing Nick Bottom, remarked that he believes the musical has incredible potential and they are currently trying their best to bring it to fruition. Anastas agreed, describing the show as fun and wild: \"everyone sings, everyone dances, and we all laugh.\"\n\nNext, No Exit, directed by Performing Arts teacher Peter Parisi, is an existentialist play, originally in French, in which the main characters get locked in a mysterious room and deliberate on how to escape. Eventually, the audience learns that these three characters are all deceased, and this mysterious room is their punishment for sins they've committed during their lifetime.\n\nFinally, the Class IV Follies, always performed by the freshman class, are still in the works of creation. Curtains for this show will go up in four weeks, so get excited and show up! In the end, it is quite obvious that the Performing Arts at Milton does indeed have three very special treats coming up for us in the next two months. Don't forget to come and support these amazing student actors on October 17, October 31, and November 16!"
  },
  {
    "title": "Uniting Through Competition: Students Reflect on the 2024 Olympics",
    "author": "Rohan Shah '26",
    "text": "This year, Paris hosted the 2024 Summer Olympics and Paralympics—with close to three billion total viewers, these games became a cultural phenomenon. Uniting fans across the globe, the Games highlight the immense power of sports to bring people together. Milton students, with peers across continents, are uniquely positioned to reflect on these events with diverse perspective and foster a sense of community through this international competition. Whether students attended the games in person or watched them on television, the story they tell is the same: the Olympics represent a culmination of athletic talent that unites, rather than divides, the globe through fierce competition.\n\nOn July 26, the Summer Olympics began with their opening ceremony. For the next 20 days, 184 nations competed in 40 different sports to accumulate the most wins and medals for their team. Athletes won notable victories across the board, but some standouts include Team USA track star Noah Lyles, USA gymnast Simone Biles, Chinese swimmer Pan Zhanle, and Swedish pole vaulter Armand Duplantis. Lyles entered the 100m event with a growing reputation and a point to prove that he was the fastest man on the track. After edging out Jamaica's Kishane Thomas by just 0.005 seconds in a dramatic finish, Lyles realized his dream with a headline-worthy gold medal. Biles also made headlines after winning all-around gold, team gold, and vault gold, completing her collection of 11 Olympic medals. While Team USA typically dominated the medal count, this year they faced a formidable challenger in Team China. Zhanle shattered his own 100m freestyle record with an astonishing 46.40-second swim, winning by nearly a body's length and leaving his competitors far behind at the touch. Additionally, Duplantis made headlines not just for his athletic achievements but also for a personal moment. After breaking his own world record and securing the gold in pole vault, Duplantis immediately rushed to celebrate with his girlfriend, who captured the entire scene on her phone and shared the special moment with the world.\n\nAfter the Olympics ended, the Paralympics—hosting over 4,000 athletes—began on August 28. One special story from these events was that of Hunter Woodhall, champion of the Paralympic 400m, and husband of Team USA Olympic athlete Tara Davis-Woodhall. With his wife's win in women's long jump and his victory on the track, Woodhall secured the couple's legacy as the \"gold medal couple.\" They celebrated each other's victories by immediately rushing to embrace, moments that showed their deep appreciation and support for one another.\n\nBut while watching gold medal moments on television or seeing highlight reels gives some a thrill, nowhere is the feeling of Olympic unity more clear than in-person, where the atmosphere is motivating and the games unite diverse audiences in common chants. Shyla Ahluwalia '26 reflected on her experience watching beach volleyball: \"Everyone was on their feet, jumping and cheering, and when certain plays happened on the court, the crowd would chant, 'Ace, ace, ace,' and 'Monster Smash.'\" She went on to explain, \"No matter the stakes of the event, there was always a constant sense of community and culture, as people from all over came to support these athletes, their countries, and the different sports.\" Additionally, when attending the award ceremony after the women's soccer gold medal match featuring the USWNT and Brazil, Ahluwalia noticed that \"[although] tensions were definitely high, the community feeling still [felt] very much present, as songs were sung in harmony, and each and every player was congratulated and respected during the crowning of medals ceremony.\"\n\nWhile watching on TV might dilute the intensity of emotions experienced in-person, the chance to cheer for many different athletes brings its own appeal. Luka Buchheim '27 and Kairo Diaz-Archilla '28 both mentioned that though they were rooting for their home countries, Germany and Puerto Rico, respectively, their favorite moments spotlighted athletes not from their home nations. Buchheim shared that he was rooting for Germany, but revealed that his favorite event was \"the 4 by 100 free relay,\" which Germany didn't dominate. Diaz-Archilla added that he was \"Team USA all the way,\" but also loved supporting his home country during its bronze medal finish in the women's 110 hurdles.\n\nIn both discussions, this idea of fostering unity came through as Milton students actively cheered for multiple nations at once and celebrated the hard work each athlete put in. Continued efforts from Milton to organize events that bring together students from diverse backgrounds would build on the idea of fostering unity and camaraderie founded by the Games."
  },
  {
    "title": "The US Open Transforms Tennis into a Unifying Global Spectacle",
    "author": "Preston Tsang '27",
    "text": "The US Open this year was historic, with a star-studded audience and an exciting lineup, culminating in record-breaking attendance and dramatic events. Earning a name for its thrilling matches that can run late into the night, the annual competition, established in 1888, attracts tennis fans around the world to New York City to watch the final Grand Slam of the season. There, the top international athletes fight for their chance of glory and a prize of 75 million dollars.\n\nThis year's tournament was particularly notable, with the return of two former Women's US Open champions, 2018 & 2020 champion Naomi Osaka and 2021 champion Emma Raducanu, who won the US Open in 2021. On the Men's side, the headlines prior to the US Open surrounded the young prodigy Carlos Alcaraz and his rival Novak Djokovic. Alcaraz had been getting the best of Djokovic, defeating him in numerous grand slam finals; however, following Djokovic's victory over Alcaraz in the Olympic Games, the rivalry intensified. Many tuned into the US Open to follow whether Djokovic could cement his legacy as the best tennis player of all time or if Alcaraz could add to his already promising resume.\n\nThis year, the Italian Jannik Sinner snagged the Men's single title, dominating the court with his skill and passion. Aryna Sabalenka grabbed the Women's single title with a series of strategic plays that confused her opponent. For the men's doubles, the Australian team Max Purcell and Jordan Thompson took home first place, with the Germans Kevin Krawietz and Tim Putz as the runners-up. The Women's doubles saw champions Jelena Ostapenko and Lyudmyla Kichenok and runner-up Shuai Zhang and Kristina Mladenovic. For the mixed doubles, Sara Errani and Andrea Vavassori won with Donald Young and Taylor Townsend as the runners-up. Despite tennis's relative unpopularity in the US, both Americans Taylor Fritz and Jessica Pegula managed to reach the finals, igniting momentum for national interest in the sport.\n\nTennis is a well-known sport across the Milton community. Although Milton does not offer a place for boarders to view matches, the US Open is a widely discussed topic. Many students who watched the US Open before the start of school had positive remarks. \"This year's US Open really introduced fans to the sport,\" Varsity Boys Tennis Team member Phillip Suk '27 said, \"this competition is culturally diverse because of rising players like Francais Tiafoe and Taylor Fritz [who make] the competition more exciting, compared to other grand slams, which are less fun.\" Ben Wang '27, another avid tennis player, commented: \"I follow tennis and I think watching professional matches helps me to see the strategies. I think the US Open is really special as it is one of the four biggest tournaments in the calendar year.\" Similarly, Sonya Farruqui '27 remarked, \"it is a fun and unique experience to see it in real life at the Louis Armstrong Stadium. I would say the stress is a part of the experience and made it more fun.\"-Alex Sherman '27, on the other hand, had negative views from the tournament, stating that, \"Taylor Fritz is trash.\" The US Open is definitely not the Superbowl, or the World Cup, but it holds a special place in the hearts of tennis players. This monumental event is held only once a year and fans get to see the best of the best battling for gold. Setting aside the unique perspectives of students, one thing is certain: the US Open unifies players from around the world and spectators from around the community. Suk noted that he watched the competition with non-tennis-playing friends, who \"really enjoyed it.\" This event transcends just competition: it enriches the community and creates a greater overall appreciation for tennis."
  },
  {
    "title": "Trainers Reveal How To Avoid Injury",
    "author": "Anthony Wu '27",
    "text": "Last year, numerous players reached new milestones, set school records, and embraced the exhilarating spirit of competition. However, injuries are an inevitable part of the sports world, and with many student-athletes sidelined for significant periods of time due to these injuries, it is crucial that athletes listen to Milton's athletic training staff.\n\nThis upcoming fall, Milton's Athletic Training Center is committed to helping our athletes stay healthy and perform at their best. At the training center in the back of the Athletic and Convocation Center, athletic trainers Jennifer Bonn, Cameron Larocque, and Nicole Hall help players through injuries and guide them through rehabilitation to prevent future occurrences. This article offers Milton's professional advice as to how to prevent injuries this fall.\n\nFirst, proper equipment is vital in every team and of every level. Understanding and utilizing the right equipment for your sport is the foundation of injury prevention. For example, Head Athletic Trainer Jennifer Bonn explained that cross country runners' equipment to \"help prevent injury is their sneakers.\" Bonn added that \"sneakers should be changed out every 200 miles or so, otherwise injuries will start to occur, starting most likely from their feet and up the kinetic chain.\" For contact sports like football, Bonn suggested that \"players need to make sure that their helmet fits properly in order to help protect against head injuries.\" Furthermore, Bonn assured that \"wearing a mouthguard in field hockey helps protect the mouth and prevent tooth injuries.\"\n\nIn addition to sport-specific equipment, the trainers emphasize the importance of overall wellness for injury prevention. \"Most preventative measures have to deal with preparation,\" remarked Athletic Trainer Cameron Larocque. He emphasized drinking fluids like water, especially during hot weather. As a rule of thumb, Bonn said, athletes should drink half of their body weight in ounces daily. The trainers also advise athletes to prioritize sleep, suggesting eight to ten hours per night. Although Milton gives students a heavy course load, Larocque highlighted that sleep should still be students' number one priority.\n\nStretching and strength training round out the prevention plan. \"A combination of dynamic and static stretching is ideal, before and after activity, along with foam rolling to help with muscle soreness,\" said Bonn. Completing a round of dynamic stretching before training that includes every muscle group helps to pump blood into muscles and increase blood flow. After practice or games, though players might want to leave quickly, static stretching is critical to inducing muscle hypertrophy, which conditions muscles that are used repeatedly. Last but not least, incorporating strength training will help muscles tear and reform to build stronger muscles. However, Bonn emphasized the importance of not overloading, suggesting to incorporate the strength training two to three days per week, on non-consecutive days.\n\nBut what about playing through those nagging aches and pains? Our trainers caution against ignoring your body's signals. \"Learning to understand your body is a vital tool,\" says Bonn. \"Overtraining is not beneficial to the body. It is okay to take a day off and let your body recover!\" Bonn continued, \"do not ignore pain. If you are unsure if you injured yourself or are just sore, come to the Athletic Training staff, and we can take a look and walk you through this.\"\n\nUnfortunately, even with the best prevention strategies, injuries can still happen. Bonn reflected on guiding students through recovery: \"Everyone responds differently to injury, and everyone's process of getting through the injury is different. Season-ending injuries are extremely tough, and the process of recovery can be long and hard.\" Bonn emphasized support is vital during recovery. \"I think making sure that student-athletes have the support they need during the recovery process is important.\" The trainer has seen many students successfully rehab from surgery by staying motivated and following protocols from their care teams. The key takeaway? \"Listen to the instructions from doctors, athletic trainers, strength and conditioning coaches, and all resources here on campus can help,\" commented varsity skier Anthony Wu '27 after his recovery from a shoulder injury. Additionally, Matthew Li '26 stated that \"as someone who has been through a major injury, [he knows] that recovery is extremely important, and Milton's trainers are a great help.\" Milton's athletic support teams are here to help you stay in the game this fall. By being proactive with prevention and being attentive to your body's needs, you'll be positioned for a healthy, successful season."
  },
  {
    "title": "The Pats are BACK",
    "author": "Benjamin Wang '27",
    "text": "With the start of a new school year comes cooler weather, more homework, and football season. For those who grew up in New England, you know what that means: it's time for the Patriots! But the Pats look a little different this year, with a new coach and fresh faces all around. Let's dive into the team's overall changes, last Sunday's events, and what all this means for the Patriots.\n\nThis year, a new coach, Jerod Mayo, joined the Patriots. Mayo, a former NFL linebacker, is a great football mind, taking over for previous head coach Bill Belichick. Belichick's stint lasted 23 years, during which he won an outstanding six Super Bowls as well as numerous accolades from media members—CBS ranks him the #1 coach of all time. All this to say, Mayo had his work cut out for him. Still, Mayo brought intensity and excitement to football not seen in Belichick's hardnosed era.\n\nAfter a rough past couple of seasons—the Pats ended 4-13 in 2023—the higher-ups decided the coaching switch was necessary. Hiring Mayo has proved to work out, as the players seem to like and respect him as a mentor despite his younger age of 38 years. Chris Cappillo '26 agrees that the switch was beneficial, stating that \"Mayo is different from Belichick because with Belichick, [the Patriots] had somewhat higher expectations… and [an] old legacy that almost always failed.\" With Mayo, pressure for success is taken off, and the Patriots can focus on development and getting the right guys to dominate future seasons. How Mayo handled the offseason is a good example of his forward-looking vision.\n\nDuring the offseason, Mayo completely took over. The defense had been good in years past, finishing as the 9th ranked in 2023, but the Pats' offense was in shambles. The Pats let go of their 2021 first-round draft pick Mac Jones after a disappointing few seasons in New England and drafted North Carolina's Drake Maye with the third overall pick in 2024. They also bolstered the receiving core, drafting Ja'Lynn Polk in the second round and Javon Baker in the fourth. They also slightly improved the defense with some cheap free-agency signings and retained key players like Mike Onwenu and Kyle Dugger. But, the receiving core is still young and the offensive line is ranked last in the entire NFL. Mayo also made a controversial decision before week 1: he opted to start veteran Jacoby Brissett instead of Maye.\n\nBut, according to Jordan Munsey '26, Maye's not playing could be the right choice. Munsey \"think[s that] Drake Maye needs time to develop [and] if Maye started now, he would have no options, a terrible offensive line protecting him. An injury would be pretty likely.\" So, with a veteran quarterback at the helm, a lackluster offense, a new coach, and a standout defense, the Pats headed into week one.\n\nThe Patriots' first game of the year was against the Bengals, who, despite having some off-the-field issues with star wide receiver Ja'marr Chase regarding practices and missing other star wide receiver Tee Higgins to an injury, were heavily favored in the game according to analysts and sportsbooks. Still, shockingly, the Pats pulled out a gritty win. Mitch Byrne '28 pointed out how \"all of the media pointed to a loss for the Patriots, being +7.5 point underdogs, [but that] the Patriots clearly started off as the more dominant team.\" The low expectations mixed with no pressure to win it all this year could have been just what the Patriots needed to win and exceed expectations.\n\nA new era in New England football has arrived, one of defiance and desire behind a new head coach. It will be interesting to see if these upsets continue throughout the season and if the Patriots will be enough to carry them to the playoffs. Football is back, and the Patriots might be too."
  },
  {
    "title": "Wolfpack and Samba Take On Spain",
    "author": "Devan Kathiresan '26",
    "text": "This past summer, Milton's soccer program granted the Boys and Girls Varsity Soccer teams an incredible opportunity: a preseason trip to Spain. As both teams have aspirations to dominate the ISL this fall, training with high-caliber teams in Spain put both Samba and Wolfpack on track for a successful season.\n\nIn past years, both soccer teams have participated in a five-day preseason trip to Camp Cedar, Maine. This trip is jam-packed with two practices a day and an additional game played in the evening, usually against other prep school soccer programs in attendance. Spending quality time with teammates and bonding with new players provides an experience that prepares Milton Soccer for the season ahead. Chris Cappillo '26, a junior on Boys Varsity Soccer, commented that his \"first Milton experience was at preseason camp freshman year.\" He added that \"it was an awesome way to start off Milton Academy and a good way to make friends.\" However, upon learning of the Spain trip, Cappillo also understood that \"going to Spain with your high school team is a once in a lifetime experience that would be incredible.\"\n\nThe trip started with a seven hour flight to Madrid, followed by a two hour bus ride to Valladolid, where players and coaches on the Boys and Girls teams stayed in separate hotels about two blocks away from one another. On this trip, every day consisted of one practice or game and one or two cultural activities accompanied by fantastic meals. Captain of the Boys team Hayes Benzan '25 asserted that \"being able to tour around Spain brought everyone on both teams really close together.\" Not only was the touring of historic Spain enjoyable for players, but it also gave the athletes a chance to rest their legs and recover from playing in the strenuous heat. While preseason at Maine's Camp Cedar entailed long days of playing, the balance of cultural bonding and soccer in Spain allowed players to take better care of their bodies in preparation for the upcoming season.\n\nBoth teams played three full games throughout the ten days in Spain. The Boys team went undefeated—winning one and tying two—and the Girls team fought hard, ending with two losses and a tie. On the last day, both teams had incredibly impressive performances against the world-renowned Atletico Madrid's Under 17 academy teams. To start the day off, Girls Varsity Soccer kept a clean sheet and tied Atletico Madrid's girls team 0-0. Juniors Sophie Crowley '24 and Chloe DiAdamo '24 both had stellar performances and did their job to prevent some of Spain's top talent from scoring. After the girls' hard-fought result, the focus shifted to the Boys game, where Samba came out hot going up 1-0 in the first half. Tacking on two more goals, they ended the game winning 3-1 with impressive performances from players Mateo Pagannini '25, who bagged the winning goal, and Benzan, who was a workhorse in the midfield. Milton Soccer's performances against Atletico Madrid captured the progress that both teams had made throughout the trip. In her interview, DiAdamo ended by saying how the \"final tie gave [her team] a lot of confidence for the upcoming season.\"\n\nEmmy Easterly '25, a standout player on Girls Varsity Soccer, thought that the trip was incredibly beneficial for their program. She said that \"player morale and relationships were benefited by this trip,\" and \"that everyone had to rely on each other for familiarity and comfort in a foreign country.\" In complete agreement, Boys Captain Josh Partal '25 could not overstate how \"important the Spain trip was for the entire Milton Soccer program.\" As the fall season begins, both varsity teams look to build on the foundations established in Spain."
  },
  {
    "title": "This Hispanic Heritage Month, Let us Remember Why We Crave Knowledge",
    "author": "Seyla Fernandez '25",
    "text": "My abuelo likes to talk. In Tehuixtla, the small town in Puebla, Mexico where my family is from, it's understood that if Antonio begins a speech, whether that be at the dinner table, or in the middle of a town parade, we'll all be there for a while. So, this past Christmas time, when he called us around, my cousins and I reluctantly got comfortable. There was a baile that night, and after spending the last hour getting ready, and another eternity taking pictures, we were all itching for the music, drinks, and giggles of being forced to dance with a stranger.\n\nHis story began like one I'd heard many times. Once campesinos, my grandparents, along with all of those before them, worked in the fields that enveloped the town. Eventually, when the ground turned barren, the land could no longer provide a life for them. We often would pass the plot of land they had worked, now lifeless and covered with stalls of imported products - peaches replacing pitaya. From here, I knew, families began to say goodbye to Tehuixtla, and thus began the exodus to America. This time, however, the story rewinded, Abuelo's typically loud voice breaking ever so quietly. In his childhood, I'd known, he walked every week from Tehuixtla to the city, to attend school. He stayed with family members, always repaying them with a bag of rice that he brought with him. His pursuit of education never faltered, and he began to attend college as he worked. As the crops withered, however, so too did the possibility of attending school. \"My biggest regret,\" he told us, our moods now much more somber, \"was not finishing school.\" Looking at the 8 of us he said \"you should all focus not on what will make you the most money, but what it is that truly excites you.\"\n\nI've thought about his advice a lot, especially as I now begin to apply to college, and I extend his wishes to Latino students. Regardless of which country you hail from, or your citizenship status, we all have a similar story of sacrifice. Someone has put their dreams to the side for the interests of future generations. If you are reading this article, if you have the gift of attending school, you are such sacrifices realized. This Hispanic Heritage Month, I urge all of us to look forward to the rest of the school year, and backwards to everyone that's gotten us here. Rather than be discouraged by the weight of generations of dreams, use it as fuel. We are all in a position where we truly have the resources to do anything. That is not to say there won't continue to be struggles; the stereotypes of us as lazy continue to perpetuate a dissociation of Latinos from academia. But, when have there not been roadblocks? Whether your calling is the sciences, sports, or art, we all have so much to give. We bring a unique passion and life to our works that is cultivated through our history. Furthermore, let us bring our culture into academic spaces. Any time I read Spanglish literature, or see hoops and virgencita necklaces on students in public, it is an assertion of: I see you; and I know you see me. There is not one way to be educated. My grandfather did not graduate college, yes, and he also cemented his family in a foreign country - selling fruit, filling vending machines, and starting a real estate business. My grandfather is educated. My grandmother taught herself how to read using the Bible. She is educated. The desire for knowledge knows no borders, but for us who have it all at our fingertips, let us reach for it."
  },
  {
    "title": "Say What",
    "author": "Sissi Ma '26",
    "text": "ACROSS\n1. Artistic Chinese dynasty\n5. \"Peace ___ time\"\n10. Sweetie\n14. Ancient Greek coin\n15. Bing Crosby's record label\n16. Supply-and-demand subj.\n17. Its not that hard\n20. Japanese seaport\n21. Wi-Fi device\n22. Musical gift\n23. Sick; same as 49 across\n25. SOH, CAH, ___\n27. It's too easy\n36. FDR's shelter org.\n37. \"__ and the Night Visitors\"\n38. Nutrient in celery\n39. \"Carpe diem\" acronym\n41. Investigate\n43. Department of Agriculture and Natural Resources (abbr.)\n44. Toothbrush brand\n46. Loyalty\n48. Pou__: vantage point\n49. Not feeling so hot; same as 23 across\n52. ___ and aah\n53. \"Sprechen ___ Deutsch?\"\n54. Swelling reducer\n57. Approaches\n61. Destiny\n65. To die\n68. Hamster's home\n69. Clarifying words\n70. Man, in Milan\n71. \"Bonanza\" brother\n72. One of life's certainties, per Benjamin Franklin\n73. STEM student's homework assignment, for short\nDOWN\n1. Prefix meaning \"one\"\n2. __, RO __ by Isaac Asimov\n3. \"You've Got Mail\" director Ephron\n4. Modern Family Character\n5. Texting shrug\n6. Tree whose seeds yield an organic insecticide\n7. Eight: Prefix\n8. West Coast sch. with the mascot King Triton\n9. Reach without delay\n10. Spelling contest\n11. Case for a dermatologist\n12. __ Raton, Florida\n13. Fed. power dept.\n18. Mea ___\n19. \"Gotta run!\"\n24. Like a wet noodle\n26. Corrosive chemical\n27. \"I Believe ___\"\n28. Rose feature\n29. Leaves for lunch?\n30. You are here\n31. Tedious task\n32. Nudge\n33. Embarrass\n34. National cloth of Ghana\n35. Mistake\n40. Butter substitute\n42. French summers\n45. Rodeo horse\n47. 17-syllable poem"
  },
  {
    "title": "Humor Page",
    "author": "Your Ivy bound and community based humor board <3",
    "text": "Hi Community! The gorgeous, talented, beautiful, intelligent, captivating, gracious, stunning, charming humor board is feeling very loving and would like to give back to our campus and recommend ways to win as a community!\n\nWIN:\n• Threatening to drop out after getting a B+ in english\n• Burner phone to live in phone hotel\n• Legacy admission to an Ivy\n• Dropping first and last names in the Forbes line\n• Collecting board positions\n• More school meetings!\n• Restoring the swamps one quad at a time\n• Making your own hours as a senior\n• LinkedIn-fluencing\n• Whatever happened in Forbes on Monday\n\nNOT win :((((\n• Signing out via Reach!\n• Respecting major school rules\n• Losing half of our faculty this year\n• The new Stu Pacific garbage patch (composting)\n• English Department bringing down Georgetown acceptances one proficient at a time\n• The Wolfpack plague\n• Getting caught in a sprinkler monsoon\n• Censorship :(\n\nYou’re welcome everyone! Love, Your Ivy bound and community based humor board <3"
  }
]

